#include "grcastle.h"

#include "placeholder.h"
#include "types.h"

#include "cm/camera.h"
#include "ft/ftdevice.h"
#include "ft/ftlib.h"
#include "gr/grdisplay.h"
#include "gr/granime.h"
#include "gr/grdatfiles.h"
#include "gr/grlib.h"
#include "gr/grmaterial.h"
#include "gr/ground.h"
#include "gr/grzakogenerator.h"
#include "gm/gm_16AE.h"
#include "gr/inlines.h"
#include "it/it_26B1.h"
#include "it/it_266F.h"
#include "it/it_2725.h"
#include "lb/lb_00B0.h"
#include "lb/lb_00F9.h"
#include "lb/lbvector.h"
#include "lb/types.h"
#include "mp/mplib.h"

#include <dolphin/mtx.h>
#include <baselib/archive.h>
#include <baselib/gobj.h>
#include <baselib/gobjgxlink.h>
#include <baselib/gobjproc.h>
#include <MetroTRK/intrinsics.h>
#include <baselib/jobj.h>
#include <baselib/psstructs.h>
#include <baselib/random.h>
#include <baselib/spline.h>
#include <MSL/trigf.h>

const unkCastleCallback grCs_803B7F28[5] = {
    grCastle_801D0550, grCastle_801D059C, grCastle_801D05E8,
    grCastle_801D0634, grCastle_801D0680,
};

const unkCastleCallback2 grCs_803B7F3C[5] = {
    grCastle_801D06CC, grCastle_801D0744, grCastle_801D07BC,
    grCastle_801D0834, grCastle_801D08AC,
};

S16Vec3 grCs_803E0FE8[] = {
    { 4, 6, 1 },
    { 5, 6, 4 },
};

StageCallbacks grCs_803E0FF4[21] = {
    { NULL, NULL, NULL, NULL, 0 },
    { grCastle_801CE8E8, grCastle_801CE9E0, grCastle_801CE9E8,
      grCastle_801CEAC8, 0 },
    { grCastle_801CE7E8, grCastle_801CE858, grCastle_801CE860,
      grCastle_801CE8E4, 0 },
    { grCastle_801CD658, grCastle_801CD8A0, grCastle_801CD8A8,
      grCastle_801CD960, 0 },
    { grCastle_801CD5BC, grCastle_801CD600, grCastle_801CD608,
      grCastle_801CD60C, 0 },
    { grCastle_801CEACC, grCastle_801CEEFC, grCastle_801CEF04,
      grCastle_801CF0F0, 0 },
    { grCastle_801CDA0C, grCastle_801CDC3C, grCastle_801CDC44,
      grCastle_801CDF50, 0 },
    { grCastle_801CEACC, grCastle_801CEEFC, grCastle_801CEF04,
      grCastle_801CF0F0, 0 },
    { grCastle_801CE260, grCastle_801CE3A4, grCastle_801CE578,
      grCastle_801CE7E4, 0 },
    { grCastle_801CE260, grCastle_801CE3A4, grCastle_801CE578,
      grCastle_801CE7E4, 0 },
    { grCastle_801CE260, grCastle_801CE3A4, grCastle_801CE578,
      grCastle_801CE7E4, 0 },
    { grCastle_801CE260, grCastle_801CE3A4, grCastle_801CE578,
      grCastle_801CE7E4, 0 },
    { grCastle_801CE260, grCastle_801CE3A4, grCastle_801CE578,
      grCastle_801CE7E4, 0 },
    { grCastle_801CE260, grCastle_801CE3A4, grCastle_801CE578,
      grCastle_801CE7E4, 0 },
    { grCastle_801CE260, grCastle_801CE3A4, grCastle_801CE578,
      grCastle_801CE7E4, 0 },
    { grCastle_801CE260, grCastle_801CE3A4, grCastle_801CE578,
      grCastle_801CE7E4, 0 },
    { grCastle_801CE260, grCastle_801CE3A4, grCastle_801CE578,
      grCastle_801CE7E4, 0 },
    { grCastle_801CEACC, grCastle_801CEEFC, grCastle_801CEF04,
      grCastle_801CF0F0, 0 },
    { grCastle_801CF0F4, grCastle_801CF300, grCastle_801CF308,
      grCastle_801CF74C, 0 },
    { grCastle_801CF0F4, grCastle_801CF300, grCastle_801CF308,
      grCastle_801CF74C, 0 },
    { grCastle_801CF0F4, grCastle_801CF300, grCastle_801CF308,
      grCastle_801CF74C, 0 },
};

StageData grCs_803E11A4 = {
    CASTLE,
    grCs_803E0FF4,
    "/GrCs.dat",
    grCastle_801CD37C,
    grCastle_801CD338,
    grCastle_801CD4A0,
    grCastle_801CD4A4,
    grCastle_801CD4C8,
    grCastle_801D0B04,
    grCastle_801D0B0C,
    (1 << 0),
    grCs_803E0FE8,
    2,
};

typedef struct grCastleParams_Entry {
    /* 0x00 */ s16 x0;
    /* 0x02 */ u8 pad_x2[2];
    /* 0x04 */ f32 x4;
    /* 0x08 */ f32 x8;
    /* 0x0C */ f32 xC;
    /* 0x10 */ f32 x10;
} grCastleParams_Entry;

typedef struct grCastleParams {
    /* 0x000 */ s16 x0;
    /* 0x002 */ s16 x2;
    /* 0x004 */ s16 x4;
    /* 0x006 */ s16 x6;
    /* 0x008 */ s16 x8;
    /* 0x00A */ s16 xA;
    /* 0x00C */ s16 xC;
    /* 0x00E */ s16 xE;
    /* 0x010 */ f32 x10;
    /* 0x014 */ f32 x14;
    /* 0x018 */ f32 x18;
    /* 0x01C */ u8 pad_x1C[4];
    /* 0x020 */ f32 x20;
    /* 0x024 */ f32 x24;
    /* 0x028 */ f32 x28;
    /* 0x02C */ f32 x2C;
    /* 0x030 */ f32 x30;
    /* 0x034 */ f32 x34;
    /* 0x038 */ f32 x38;
    /* 0x03C */ f32 x3C;
    /* 0x040 */ s16 x40;
    /* 0x042 */ s16 x42;
    /* 0x044 */ s16 x44;
    /* 0x046 */ u8 pad_x46[2];
    /* 0x048 */ f32 x48;
    /* 0x04C */ f32 x4C;
    /* 0x050 */ f32 x50;
    /* 0x054 */ s16 x54;
    /* 0x056 */ u8 pad_x56[2];
    /* 0x058 */ s16 x58;
    /* 0x05A */ u8 pad_x5A[2];
    /* 0x05C */ grCastleParams_Entry entries[9];
    /* 0x110 */ f32 x110;
    /* 0x114 */ s32 x114;
    /* 0x118 */ f32 x118;
    /* 0x11C */ f32 x11C;
    /* 0x120 */ f32 x120;
    /* 0x124 */ f32 x124;
    /* 0x128 */ u8 pad_x128[4];
    /* 0x12C */ s16 x12C[4];
    /* 0x134 */ f32 x134;
    /* 0x138 */ f32 x138;
    /* 0x13C */ f32 x13C;
    /* 0x140 */ f32 x140;
} grCastleParams;

typedef struct grCastle_PlatSubObj {
    /* 0x00 */ HSD_JObj* jobj;
    /* 0x04 */ f32 current;
    /* 0x08 */ s16 state;
    /* 0x0A */ s16 counter;
    /* 0x0C */ f32 wind;
} grCastle_PlatSubObj;

static f32 grCs_804D45E0 = 0.017453292f;
static u8 grCs_804D45E4 = 1;

static grCastleParams* grCs_804D6970;
static struct lb_80011A50_t* grCs_804D6974;

static const Quaternion grCs_803B7EB8 = { 0.0f, 0.0f, 0.0f, 1.0f };

typedef struct grCastle_BlinkTable {
    s16 data[19];
} grCastle_BlinkTable;

static const grCastle_BlinkTable grCs_803B7EC8 = {{
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0
}};

static const Vec3 grCs_803B7E9C = { -257.0f, 13.5f, -252.0f };

typedef struct grCastle_DynEntry {
    s16 depth;
    s16 type;
} grCastle_DynEntry;

typedef struct grCastle_DynEntries {
    grCastle_DynEntry e[4];
} grCastle_DynEntries;

static const grCastle_DynEntries grCs_803B7EA8 = {{
    { 66, 6 },
    { 76, 6 },
    { 85, 6 },
    { 94, 6 },
}};

typedef struct grCastle_YOffsets {
    f32 v[6];
} grCastle_YOffsets;

static const grCastle_YOffsets grCs_803B7F50 = {{
    4.0f, 6.0f, 7.0f, 6.0f, 4.0f, -1.0f,
}};

