#include "grcorneria.h"

#include "grcorneria.static.h"

#include "placeholder.h"

#include "baselib/forward.h"

#include "baselib/sislib.h"
#include "cm/camera.h"
#include "ft/ftlib.h"
#include "gm/gm_1832.h"
#include "gm/gm_1A45.h"
#include "gm/gmregclear.h"
#include "gr/granime.h"
#include "gr/grdatfiles.h"
#include "gr/grdisplay.h"
#include "gr/grlib.h"
#include "gr/grmaterial.h"
#include "gr/ground.h"
#include "gr/grvenom.h"
#include "gr/grzakogenerator.h"
#include "gr/inlines.h"
#include "gr/stage.h"
#include "gr/types.h"
#include "if/ifcoget.h"
#include "if/ifstatus.h"
#include "it/item.h"
#include "it/items/itgreatfoxlaser.h"
#include "lb/lb_00B0.h"
#include "lb/lb_00F9.h"
#include "lb/lbaudio_ax.h"
#include "mp/mplib.h"

#include <baselib/controller.h>
#include <baselib/debug.h>
#include <baselib/gobj.h>
#include <baselib/gobjgxlink.h>
#include <baselib/jobj.h>
#include <baselib/particle.h>
#include <baselib/random.h>

int grCn_803E1D80[3] = { 0, 0, 0 };
int grCn_803E2190[5] = { 0, 0, 1, 2, 5 };

int grCn_804D466C = -1;

typedef struct grCn_StageData {
    /* 0x00 */ f32 x0;
    /* 0x04 */ f32 x4;
    /* 0x08 */ f32 x8;
    /* 0x0C */ f32 xC;
    /* 0x10 */ f32 x10;
    /* 0x14 */ f32 x14;
    /* 0x18 */ f32 x18;
    /* 0x1C */ s32 x1C;
    /* 0x20 */ s32 x20;
    /* 0x24 */ f32 x24;
    /* 0x28 */ s32 x28;
    /* 0x2C */ s32 x2C;
    /* 0x30 */ f32 x30;
    /* 0x34 */ f32 x34;
    /* 0x38 */ f32 x38;
    /* 0x3C */ f32 x3C;
    /* 0x40 */ f32 x40;
    /* 0x44 */ f32 x44;
    /* 0x48 */ f32 x48;
    /* 0x4C */ f32 x4C;
    /* 0x50 */ u8 pad50[0x18];
    /* 0x68 */ s32 x68;
    /* 0x6C */ u8 pad6C[0x4];
    /* 0x70 */ f32 x70;
    /* 0x74 */ s32 x74;
    /* 0x78 */ s32 x78;
    /* 0x7C */ s32 x7C;
    /* 0x80 */ s32 x80;
    /* 0x84 */ s32 x84;
    /* 0x88 */ f32 x88;
} grCn_StageData;

static grCn_StageData* grCn_804D69A0;
static u32 grCn_804D69A4;
static int grCn_804D69A8;
static int grCn_804D69AC;
static int grCn_804D69B0;

typedef struct {
    int data[3];
} grCn_Entry;

typedef struct grCn_Data {
    /* 0x000 */ u8 pad0[0x30];
    /* 0x030 */ HSD_GObj* arwing_gobj[3];
    /* 0x03C */ s32 arwing_type[3];
    /* 0x048 */ s32 arwing_group[3];
    /* 0x054 */ u8 pad1[0x1F0];
    /* 0x244 */ f32 cannon_x;
    /* 0x248 */ f32 cannon_y;
    /* 0x24C */ u8 pad2[0x34];
    /* 0x280 */ Vec3 effect_pos;
    /* 0x28C */ u8 pad3[0x6C];
    /* 0x2F8 */ s32 anim_ids[14];
    /* 0x330 */ Vec3 positions[14];
    /* 0x3D8 */ s32 x3D8[9][3];
    /* 0x444 */ s32 x444[5];
    /* 0x458 */ s32 x458[8];
    /* 0x478 */ u8 pad5[0x40];
    /* 0x4B8 */ struct {
        s16 joint0;
        s16 joint1;
    } dialog_joints[5];
    /* 0x4CC */ grCn_Entry entries[][5];
} grCn_Data;

extern grCn_Data grCn_803E1D38;

void grCorneria_801DCCFC(void)
{
    s32 stage;
    s32 imin, imax;
    PAD_STACK(16);

    grCn_803E1D38.arwing_gobj[0] = NULL;
    grCn_803E1D38.arwing_type[0] = 0;
    grCn_803E1D38.arwing_group[0] = 0;
    grCn_803E1D38.arwing_gobj[1] = NULL;
    grCn_803E1D38.arwing_type[1] = 0;
    grCn_803E1D38.arwing_group[1] = 0;
    grCn_803E1D38.arwing_gobj[2] = NULL;
    grCn_803E1D38.arwing_type[2] = 0;
    grCn_803E1D38.arwing_group[2] = 0;

    stage = Stage_80225194();
    switch (stage) {
    case 0xE9:
    case 0x47:
        grCn_804D69B0 = 1;
        break;
    default:
        grCn_804D69B0 = (imax = 0);
        break;
    }

    if (grCn_804D69B0 == 1) {
        grCn_804D69A8 = 0x78;
        return;
    }

    imin = grCn_804D69A0->x3C;
    imax = grCn_804D69A0->x40;
    if (imax > imin) {
        s32 range = imax - imin;
        imax = imin + (range != 0 ? HSD_Randi(range) : 0);
