#include "grcorneria.h"

#include "grcorneria.static.h"

#include "placeholder.h"

#include "baselib/forward.h"

#include "baselib/generator.h"
#include "baselib/sislib.h"
#include "cm/camera.h"
#include "ft/ftlib.h"
#include "gm/gm_1832.h"
#include "gm/gm_1A45.h"
#include "gm/gmregclear.h"
#include "gr/granime.h"
#include "gr/grdatfiles.h"
#include "gr/grdisplay.h"
#include "gr/grlib.h"
#include "gr/grmaterial.h"
#include "gr/ground.h"
#include "gr/grvenom.h"
#include "gr/grzakogenerator.h"
#include "gr/inlines.h"
#include "gr/stage.h"
#include "gr/types.h"
#include "if/ifcoget.h"
#include "if/ifstatus.h"
#include "it/item.h"
#include "it/items/itarwinglaser.h"
#include "it/items/itgreatfoxlaser.h"
#include "lb/lb_00B0.h"
#include "lb/lbaudio_ax.h"
#include "lb/lbspdisplay.h"
#include "mp/mplib.h"
#include "pl/player.h"

#include <baselib/controller.h>
#include <baselib/debug.h>
#include <baselib/gobj.h>
#include <baselib/gobjgxlink.h>
#include <baselib/jobj.h>
#include <baselib/random.h>

typedef struct grCn_StageData {
    /* 0x00 */ f32 x0;
    /* 0x04 */ f32 x4;
    /* 0x08 */ f32 x8;
    /* 0x0C */ f32 xC;
    /* 0x10 */ f32 x10;
    /* 0x14 */ f32 x14;
    /* 0x18 */ f32 x18;
    /* 0x1C */ f32 x1C;
    /* 0x20 */ f32 x20;
    /* 0x24 */ f32 x24;
    /* 0x28 */ f32 x28;
    /* 0x2C */ f32 x2C;
    /* 0x30 */ f32 x30;
    /* 0x34 */ f32 x34;
    /* 0x38 */ f32 x38;
    /* 0x3C */ f32 initial_spawn_delay_min;
    /* 0x40 */ f32 initial_spawn_delay_max;
    /* 0x44 */ f32 respawn_delay_min;
    /* 0x48 */ f32 respawn_delay_max;
    /* 0x4C */ f32 group4_chance;
    /* 0x50 */ u8 pad50[0x18];
    /* 0x68 */ f32 maneuver_cooldown;
    /* 0x6C */ u8 pad6C[0x4];
    /* 0x70 */ f32 arwing_scale;
    /* 0x74 */ s32 single_laser_interval;
    /* 0x78 */ s32 single_laser_chance;
    /* 0x7C */ s32 multi_laser_interval;
    /* 0x80 */ s32 multi_laser_chance;
    /* 0x84 */ s32 laser_effect_id;
    /* 0x88 */ f32 x88;
} grCn_StageData;

static grCn_StageData* grCn_StageParams;
static u32 grCn_CurrentArwingSlot;
static int grCn_ArwingSpawnTimer;
static bool grCn_ArwingUpdateDisabled;
static int grCn_MultiArwingMode;

static S16Vec3 grCn_803E1D38[] = {
    { 0x0003, 0x0003, 0x0000 }, { 0x0004, 0x0003, 0x0000 },
    { 0x0000, 0x000D, 0x0000 }, { 0x0001, 0x000E, 0x0000 },
    { 0x0002, 0x000F, 0x0000 }, { 0x0005, 0x0010, 0x0000 },
    { 0x0006, 0x0011, 0x0000 }, { 0x0007, 0x0012, 0x0000 },
};

static HSD_GObj* grCn_ArwingGObjs[3] = { 0 };
static int grCn_ArwingTypes[3] = { 0 };
static int grCn_ArwingGroups[3] = { 0 };

StageCallbacks grCn_803E1D8C[] = {
    {
        grCorneria_801DD620,
        grCorneria_801DD64C,
        grCorneria_801DD654,
        grCorneria_801DD658,
        0x00000000,
    },
    {
        grCorneria_801DDAC4,
        grCorneria_801DDCE8,
        grCorneria_801DE024,
        grCorneria_801DE4BC,
        0x00000000,
    },
    {
