#include "grcorneria.h"

#include "grcorneria.static.h"

#include "baselib/sislib.h"
#include "cm/camera.h"
#include "gm/gm_1A45.h"
#include "gm/gmregclear.h"
#include "gr/granime.h"
#include "gr/grdisplay.h"
#include "gr/grlib.h"
#include "gr/grmaterial.h"
#include "gr/ground.h"
#include "gr/grvenom.h"
#include "gr/grzakogenerator.h"
#include "gr/inlines.h"
#include "gr/stage.h"
#include "gr/types.h"
#include "if/ifcoget.h"
#include "if/ifstatus.h"
#include "lb/lb_00B0.h"
#include "lb/lb_00F9.h"
#include "mp/mplib.h"

#include <baselib/controller.h>
#include <baselib/debug.h>
#include <baselib/gobj.h>
#include <baselib/jobj.h>
#include <baselib/random.h>

int grCn_803E1D80[3] = { 0, 0, 0 };
int grCn_803E2190[5] = { 0, 0, 1, 2, 5 };

int grCn_804D466C = -1;

static void* grCn_804D69A0;
static u32 grCn_804D69A4;
static s32 grCn_804D69A8;
static int grCn_804D69AC;
static s32 grCn_804D69B0;

typedef struct {
    int data[3];
} grCn_Entry;

extern grCn_Entry grCn_803E2204[][5];

typedef struct grCn_Data {
    /* 0x000 */ u8 pad_00[0x30];
    /* 0x030 */ s32 x30[3];
    /* 0x03C */ s32 indices[3];
    /* 0x048 */ s32 x48[3];
    /* 0x054 */ u8 pad_54[0x2DC];
    /* 0x330 */ Vec3 positions[34];
    /* +4C8 */ UNK_T pad2;
    /* 0x4CC */ grCn_Entry entries[][5];
} grCn_Data;

extern grCn_Data grCn_803E1D38;

s32 grCorneria_801DCCFC(void)
{
    f32 temp_f0;
    f32 temp_f2;
    s32 temp_r30;
    s32 var_r31;
    s32 var_r3;
    s32 diff;

    grCn_803E1D38.x30[0] = 0;
    grCn_803E1D38.indices[0] = 0;
    grCn_803E1D38.x48[0] = 0;
    grCn_803E1D38.x30[1] = 0;
    grCn_803E1D38.indices[1] = 0;
    grCn_803E1D38.x48[1] = 0;
    grCn_803E1D38.x30[2] = 0;
    grCn_803E1D38.indices[2] = 0;
    grCn_803E1D38.x48[2] = 0;
    var_r3 = Stage_80225194();
    switch (var_r3) {
    case 0xE9:
    case 0x47:
        grCn_804D69B0 = 1;
        break;
    default:
        grCn_804D69B0 = 0;
        break;
    }
    if (grCn_804D69B0 == 1) {
        grCn_804D69A8 = 0x78;
        return var_r3;
    }
    temp_f0 = M2C_FIELD(grCn_804D69A0, f32*, 0x3C);
    temp_f2 = M2C_FIELD(grCn_804D69A0, f32*, 0x40);
    temp_r30 = (s32) temp_f0;
    var_r3 = (s32) temp_f2;
    var_r31 = (s32) temp_f2;
    if (var_r3 > temp_r30) {
