#ifndef __GALE01_1EFC68
#define __GALE01_1EFC68

#include <placeholder.h>

#include "platform.h"

#include <dolphin/mtx.h>

struct grMc_8049F4B8_t {
    /*   +0 */ float x0;
    /*   +4 */ float x4;
    /*   +8 */ float x8;
    /*   +C */ float xC;
    /*  +10 */ float x10;
    /*  +14 */ float x14;
    /*  +18 */ float x18;
    /*  +1C */ float x1C;
    /*  +20 */ float x20;
    /*  +24 */ float x24;
    /*  +28 */ float x28;
    /*  +2C */ float x2C;
    /*  +30 */ float x30;
    /*  +34 */ float x34;
    /*  +38 */ float x38;
    /*  +3C */ float x3C;
    /*  +40 */ float x40;
    /*  +44 */ float x44;
    /*  +48 */ float x48;
    /*  +4C */ float x4C;
    /*  +50 */ float x50;
    /*  +54 */ float x54;
    /*  +58 */ float x58;
    /*  +5C */ float x5C;
    /*  +60 */ float x60;
    /*  +64 */ float x64;
    /*  +68 */ float x68;
    /*  +6C */ float x6C;
    /*  +70 */ float x70;
    /*  +74 */ float x74;
    /*  +78 */ float x78;
    /*  +7C */ float x7C;
    /*  +80 */ float x80;
    /*  +84 */ float x84;
    /*  +88 */ float x88;
    /*  +8C */ float x8C;
    /*  +90 */ float x90;
    /*  +94 */ float x94;
    /*  +98 */ float x98;
    /*  +9C */ float x9C;
    /*  +A0 */ float xA0;
    /*  +A4 */ float xA4;
    /*  +A8 */ float xA8;
    /*  +AC */ float xAC;
    /*  +B0 */ float xB0;
    /*  +B4 */ float xB4;
    /*  +B8 */ float xB8;
    /*  +BC */ float xBC;
    /*  +C0 */ float xC0;
    /*  +C4 */ float xC4;
    /*  +C8 */ float xC8;
    /*  +CC */ float xCC;
    /*  +D0 */ float xD0;
    /*  +D4 */ float xD4;
    /*  +D8 */ float xD8;
    /*  +DC */ float xDC;
    /*  +E0 */ float xE0;
    /*  +E4 */ float xE4;
    /*  +E8 */ float xE8;
    /*  +EC */ float xEC;
    /*  +F0 */ float xF0;
    /*  +F4 */ float xF4;
    /*  +F8 */ float xF8;
    /*  +FC */ float xFC;
    /* +100 */ float x100;
    /* +104 */ float x104;
    /* +108 */ float x108;
    /* +10C */ float x10C;
    /* +110 */ float x110;
    /* +114 */ float x114;
    /* +118 */ float x118;
    /* +11C */ float x11C;
    /* +120 */ float x120;
    /* +124 */ float x124;
    /* +128 */ float x128;
    /* +12C */ float x12C;
    /* +130 */ float x130;
    /* +134 */ float x134;
    /* +138 */ float x138;
    /* +13C */ float x13C;
    /* +140 */ float x140;
    /* +144 */ float x144;
    /* +148 */ float x148;
    /* +14C */ float x14C;
    /* +150 */ float x150;
    /* +154 */ float x154;
    /* +158 */ float x158;
    /* +15C */ float x15C;
    /* +160 */ float x160;
    /* +164 */ float x164;
    /* +168 */ float x168;
    /* +16C */ float x16C;
    /* +170 */ float x170;
    /* +174 */ float x174;
    /* +178 */ float x178;
    /* +17C */ float x17C;
    /* +180 */ float x180;
    /* +184 */ float x184;
    /* +188 */ float x188;
    /* +18C */ float x18C;
    /* +190 */ float x190;
    /* +194 */ float x194;
    /* +198 */ float x198;
    /* +19C */ float x19C;
    /* +1A0 */ float x1A0;
    /* +1A4 */ float x1A4;
    /* +1A8 */ float x1A8;
    /* +1AC */ float x1AC;
    /* +1B0 */ float x1B0;
    /* +1B4 */ float x1B4;
    /* +1B8 */ float x1B8;
    /* +1BC */ float x1BC;
    /* +1C0 */ float x1C0;
    /* +1C4 */ float x1C4;
    /* +1C8 */ float x1C8;
    /* +1CC */ float x1CC;
    /* +1D0 */ float x1D0;
    /* +1D4 */ float x1D4;
    /* +1D8 */ float x1D8;
    /* +1DC */ float x1DC;
    /* +1E0 */ float x1E0;
    /* +1E4 */ float x1E4;
    /* +1E8 */ float x1E8;
    /* +1EC */ float x1EC;
    /* +1F0 */ float x1F0;
    /* +1F4 */ float x1F4;
    /* +1F8 */ float x1F8;
    /* +1FC */ float x1FC;
    /* +200 */ float x200;
    /* +204 */ float x204;
    /* +208 */ float x208;
    /* +20C */ float x20C;
    /* +210 */ float x210;
    /* +214 */ float x214;
    /* +218 */ float x218;
    /* +21C */ float x21C;
    /* +220 */ float x220;
    /* +224 */ float x224;
    /* +228 */ float x228;
    /* +22C */ float x22C;
    /* +230 */ float x230;
    /* +234 */ float x234;
    /* +238 */ float x238;
    /* +23C */ float x23C;
    /* +240 */ float x240;
    /* +244 */ float x244;
    /* +248 */ float x248;
    /* +24C */ float x24C;
    /* +250 */ float x250;
    /* +254 */ float x254;
    /* +258 */ float x258;
    /* +25C */ float x25C;
    /* +260 */ float x260;
    /* +264 */ float x264;
    /* +268 */ float x268;
    /* +26C */ float x26C;
    /* +270 */ float x270;
    /* +274 */ float x274;
    /* +278 */ float x278;
    /* +27C */ float x27C;
    /* +280 */ float x280;
    /* +284 */ float x284;
    /* +288 */ float x288;
    /* +28C */ float x28C;
    /* +290 */ float x290;
    /* +294 */ float x294;
    /* +298 */ float x298;
    /* +29C */ float x29C;
    /* +2A0 */ float x2A0;
    /* +2A4 */ float x2A4;
    /* +2A8 */ float x2A8;
    /* +2AC */ float x2AC;
    /* +2B0 */ float x2B0;
    /* +2B4 */ float x2B4;
    /* +2B8 */ float x2B8;
    /* +2BC */ float x2BC;
    /* +2C0 */ float x2C0;
    /* +2C4 */ float x2C4;
    /* +2C8 */ float x2C8;
    /* +2CC */ float x2CC;
    /* +2D0 */ float x2D0;
    /* +2D4 */ float x2D4;
    /* +2D8 */ float x2D8;
    /* +2DC */ float x2DC;
    /* +2E0 */ float x2E0;
    /* +2E4 */ float x2E4;
    /* +2E8 */ float x2E8;
    /* +2EC */ float x2EC;
    /* +2F0 */ float x2F0;
    /* +2F4 */ float x2F4;
    /* +2F8 */ float x2F8;
    /* +2FC */ float x2FC;
    /* +300 */ float x300;
    /* +304 */ float x304;
    /* +308 */ float x308;
    /* +30C */ float x30C;
    /* +310 */ float x310;
    /* +314 */ float x314;
    /* +318 */ float x318;
    /* +31C */ float x31C;
    /* +320 */ float x320;
    /* +324 */ float x324;
    /* +328 */ float x328;
    /* +32C */ float x32C;
    /* +330 */ float x330;
    /* +334 */ float x334;
    /* +338 */ float x338;
    /* +33C */ float x33C;
    /* +340 */ float x340;
    /* +344 */ float x344;
    /* +348 */ float x348;
    /* +34C */ float x34C;
    /* +350 */ float x350;
    /* +354 */ float x354;
    /* +358 */ float x358;
    /* +35C */ float x35C;
    /* +360 */ float x360;
    /* +364 */ float x364;
    /* +368 */ float x368;
    /* +36C */ float x36C;
    /* +370 */ float x370;
    /* +374 */ float x374;
    /* +378 */ float x378;
    /* +37C */ float x37C;
    /* +380 */ float x380;
    /* +384 */ float x384;
    /* +388 */ float x388;
    /* +38C */ float x38C;
    /* +390 */ float x390;
    /* +394 */ float x394;
    /* +398 */ float x398;
    /* +39C */ float x39C;
    /* +3A0 */ float x3A0;
    /* +3A4 */ float x3A4;
    /* +3A8 */ float x3A8;
    /* +3AC */ float x3AC;
    /* +3B0 */ float x3B0;
    /* +3B4 */ float x3B4;
    /* +3B8 */ float x3B8;
    /* +3BC */ float x3BC;
    /* +3C0 */ float x3C0;
    /* +3C4 */ float x3C4;
    /* +3C8 */ float x3C8;
    /* +3CC */ float x3CC;
    /* +3D0 */ float x3D0;
    /* +3D4 */ float x3D4;
    /* +3D8 */ float x3D8;
    /* +3DC */ float x3DC;
    /* +3E0 */ float x3E0;
    /* +3E4 */ float x3E4;
    /* +3E8 */ float x3E8;
    /* +3EC */ float x3EC;
    /* +3F0 */ float x3F0;
    /* +3F4 */ float x3F4;
    /* +3F8 */ float x3F8;
    /* +3FC */ float x3FC;
    /* +400 */ float x400;
    /* +404 */ float x404;
    /* +408 */ float x408;
    /* +40C */ float x40C;
    /* +410 */ float x410;
    /* +414 */ float x414;
    /* +418 */ float x418;
    /* +41C */ float x41C;
    /* +420 */ float x420;
    /* +424 */ float x424;
    /* +428 */ float x428;
    /* +42C */ float x42C;
    /* +430 */ float x430;
    /* +434 */ float x434;
    /* +438 */ float x438;
    /* +43C */ float x43C;
    /* +440 */ float x440;
    /* +444 */ float x444;
    /* +448 */ float x448;
    /* +44C */ float x44C;
    /* +450 */ float x450;
    /* +454 */ float x454;
    /* +458 */ float x458;
    /* +45C */ float x45C;
    /* +460 */ float x460;
    /* +464 */ float x464;
    /* +468 */ float x468;
    /* +46C */ float x46C;
    /* +470 */ float x470;
    /* +474 */ float x474;
    /* +478 */ float x478;
    /* +47C */ float x47C;
    /* +480 */ float x480;
    /* +484 */ float x484;
    /* +488 */ float x488;
    /* +48C */ float x48C;
    /* +490 */ float x490;
    /* +494 */ float x494;
    /* +498 */ float x498;
    /* +49C */ float x49C;
    /* +4A0 */ float x4A0;
    /* +4A4 */ float x4A4;
    /* +4A8 */ float x4A8;
    /* +4AC */ float x4AC;
    /* +4B0 */ float x4B0;
    /* +4B4 */ float x4B4;
    /* +4B8 */ float x4B8;
    /* +4BC */ float x4BC;
    /* +4C0 */ float x4C0;
    /* +4C4 */ float x4C4;
    /* +4C8 */ float x4C8;
    /* +4CC */ float x4CC;
    /* +4D0 */ float x4D0;
    /* +4D4 */ float x4D4;
    /* +4D8 */ float x4D8;
    /* +4DC */ float x4DC;
    /* +4E0 */ float x4E0;
    /* +4E4 */ float x4E4;
    /* +4E8 */ float x4E8;
    /* +4EC */ float x4EC;
    /* +4F0 */ float x4F0;
    /* +4F4 */ float x4F4;
    /* +4F8 */ float x4F8;
    /* +4FC */ float x4FC;
    /* +500 */ float x500;
    /* +504 */ float x504;
    /* +508 */ float x508;
    /* +50C */ float x50C;
    /* +510 */ float x510;
    /* +514 */ float x514;
    /* +518 */ float x518;
    /* +51C */ float x51C;
    /* +520 */ float x520;
    /* +524 */ float x524;
};
STATIC_ASSERT(sizeof(struct grMc_8049F4B8_t) == 0x528);

static struct grMc_8049F4B8_t grMc_8049F4B8;

#endif
