#include "grshrineroute.h"

#include "ground.h"
#include "types.h"

#include <platform.h>

#include "baselib/forward.h"

#include "baselib/jobj.h"
#include "cm/camera.h"
#include "gm/gm_1601.h"
#include "gr/granime.h"
#include "gr/grlib.h"
#include "gr/stage.h"
#include "lb/lb_00F9.h"
#include "ef/efsync.h"
#include "ft/ftdevice.h"
#include "ft/ftlib.h"
#include "gr/grdisplay.h"
#include "gr/grmaterial.h"
#include "gr/grzakogenerator.h"
#include "gr/inlines.h"
#include "lb/lb_00B0.h"
#include "lb/lbvector.h"
#include "mp/mplib.h"
#include "pl/player.h"

#include <baselib/debug.h>
#include <baselib/gobj.h>
#include <baselib/gobjgxlink.h>
#include <baselib/gobjproc.h>
#include <baselib/lobj.h>
#include <baselib/random.h>
#include <MSL/math_ppc.h>
#include <MSL/trigf.h>

s16 grSh_Route_803E58E0[8] = {
    0x33, 0x4F, 0x65, 0x66, 0x73, 0x74, 0x83, 0x00
};

StageCallbacks grSh_Route_803E58F0[7] = {
    {
        grShrineRoute_802089AC,
        grShrineRoute_802089D8,
        grShrineRoute_802089E0,
        grShrineRoute_802089E4,
        0,
    },
    {
        grShrineRoute_8020A868,
        grShrineRoute_8020A894,
        grShrineRoute_8020A89C,
        grShrineRoute_8020A8A0,
        0,
    },
    {
        grShrineRoute_802089E8,
        grShrineRoute_80208A28,
        grShrineRoute_80208A30,
        grShrineRoute_80208A34,
        0,
    },
    {
        grShrineRoute_8020A868,
        grShrineRoute_8020A894,
        grShrineRoute_8020A89C,
        grShrineRoute_8020A8A0,
        0,
    },
    {
        grShrineRoute_80208D14,
        grShrineRoute_80208F0C,
        grShrineRoute_80208F70,
        grShrineRoute_80209AEC,
        0xC0000000,
    },
    {
        grShrineRoute_80209AF0,
        grShrineRoute_80209BE4,
        grShrineRoute_80209BEC,
        grShrineRoute_8020A100,
        0,
    },
    {
        grShrineRoute_8020A104,
        grShrineRoute_8020A214,
        grShrineRoute_8020A21C,
        grShrineRoute_8020A864,
        0,
    },
};

StageData grSh_Route_803E5988 = {
    SHRINEROUTE,
    grSh_Route_803E58F0,
    "/GrNSr.dat",
    grShrineRoute_OnInit,
    grShrineRoute_OnDemoInit,
    grShrineRoute_OnLoad,
    grShrineRoute_OnStart,
    grShrineRoute_802088B8,
    grShrineRoute_OnTouchLine,
    grShrineRoute_OnCheckShadowRender,
    (1 << 0),
    NULL,
    0,
};

static struct {
    int x0;
    int x4;
    int x8;
    int xC;
    int x10;
    f32 x14;
    f32 x18;
    f32 x1C;
    f32 x20;
    int x24;
    grZakoGenerator_SpawnDesc x28;
}* grSh_Route_804D6A58;

extern float grNKr_804DB868;
extern HSD_LightDesc grSh_Route_803E5D74;
extern HSD_LightDesc grSh_Route_803E5D90;
extern Vec3 grSh_Route_803B8360;
extern Vec3 grSh_Route_803B836C;
extern Vec3 grSh_Route_803B8378;
extern Vec3 grSh_Route_803B8384;
extern Vec3 grSh_Route_803B8390;

extern struct grSh_Route_LightConfig {
    /* 0x00 */ GXColor x0;
    /* 0x04 */ Vec3 x4;
    /* 0x10 */ Vec3 x10;
    /* 0x1C */ s32 x1C;
    /* 0x20 */ f32 x20;
    /* 0x24 */ s32 x24;
    /* 0x28 */ f32 x28;
    /* 0x2C */ f32 x2C;
    /* 0x30 */ s32 x30;
} grSh_Route_803E5A58[];

float grShrineRoute_802087B0(void)
{
    return grNKr_804DB868;
}

void grShrineRoute_OnDemoInit(bool arg) {}

void grShrineRoute_OnInit(void)
{
    grSh_Route_804D6A58 = Ground_801C49F8();
    stage_info.unk8C.b4 = 0;
    stage_info.unk8C.b5 = 0;
    grShrineRoute_802088C0(0);
    grShrineRoute_802088C0(4);
    grShrineRoute_802088C0(2);
    Ground_801C39C0();
    Ground_801C3BB4();
    grShrineRoute_8020B0AC();
}

void grShrineRoute_OnLoad(void)
{
    grShrineRoute_802088C0(6);
}

void grShrineRoute_OnStart(void)
{
    int val;
    grZakoGenerator_801CAE04(&grSh_Route_804D6A58->x28);
    val = grSh_Route_804D6A58->x24;
    if (val != 0) {
        val = HSD_Randi(grSh_Route_804D6A58->x24);
    } else {
        val = 0;
    }
    if (val == 0) {
        grZakoGenerator_801CAEB0(Ground_801C5840(), Ground_801C5940());
    }
}

bool grShrineRoute_802088B8(void)
{
    return false;
}

HSD_GObj* grShrineRoute_802088C0(int gobj_id)
{
