#include "grzebes.h"

#include <platform.h>

#include "forward.h"

#include <dolphin/os.h>

#include "cm/camera.h"
#include "ft/ftdevice.h"
#include "ft/ftlib.h"
#include "gr/granime.h"
#include "gr/grdatfiles.h"
#include "gr/grdisplay.h"
#include "gr/grlib.h"
#include "gr/grmaterial.h"
#include "gr/grzakogenerator.h"
#include "gr/inlines.h"
#include "lb/lb_00B0.h"
#include "lb/lb_00F9.h"
#include "mp/mplib.h"

#include <baselib/gobjgxlink.h>
#include <baselib/gobjproc.h>
#include <baselib/jobj.h>
#include <baselib/lobj.h>
#include <baselib/random.h>

#include <MSL/math_ppc.h>

/* 1D84A0 */ static void grZebes_801D84A0(bool arg);
/* 1D8528 */ static void grZebes_801D8528(void);
/* 1D852C */ void grZebes_801D852C(void);
/* 1D8550 */ static bool grZebes_801D8550(void);
/* 1D8558 */ static Ground_GObj* grZebes_801D8558(int);
/* 1D8814 */ static bool grZebes_801D8814(Ground_GObj* arg);
/* 1D90FC */ static void grZebes_801D90FC(Ground_GObj* arg);
/* 1D9254 */ static bool grZebes_801D9254(Ground_GObj* arg);
/* 1D93D8 */ static void grZebes_801D93D8(Ground_GObj* arg);
/* 1D93DC */ void grZebes_801D93DC(Ground_GObj* gobj);
/* 1D9408 */ static bool grZebes_801D9408(Ground_GObj* arg);
/* 1D9410 */ static void grZebes_801D9410(Ground_GObj* arg);
/* 1D94EC */ static void grZebes_801D94EC(Ground_GObj* arg);
/* 1D94F0 */ static void fn_801D94F0(Ground_GObj* gobj);
/* 1D95B0 */ static bool grZebes_801D95B0(Ground_GObj* arg);
/* 1D95B8 */ static void grZebes_801D95B8(Ground_GObj* arg);
/* 1D9754 */ static void grZebes_801D9754(Ground_GObj* arg);
/* 1D99D8 */ static bool grZebes_801D99D8(Ground_GObj* arg);
/* 1DA0C4 */ static void grZebes_801DA0C4(f32 level);
/* 1DA254 */ static void grZebes_801DA254(Ground_GObj* gobj, f32 level);
/* 1D9F2C */ static void grZebes_801D9F2C(Ground_GObj* arg);
/* 1D9F7C */ static bool grZebes_801D9F7C(Ground_GObj* arg);
/* 1DA0C0 */ static void grZebes_801DA0C0(Ground_GObj* arg);
/* 1DA3E8 */ static void grZebes_801DA3E8(void);
/* 1DA528 */ static u8 grZebes_801DA528(HSD_GObj*, void*, s32, s32);
/* 1DA9D8 */ static void fn_801DA9D8(Item_GObj* arg0, Ground* gp, Vec3* pos,
                                     HSD_GObj* fobj, f32 slope);
/* 1DA9F0 */ static void fn_801DA9F0(Item_GObj* arg0, Ground* gp, Vec3* pos,
                                     HSD_GObj* fobj, f32 slope);
/* 1DAC90 */ static void fn_801DAC90(Item_GObj*, Ground*, Vec3*, HSD_GObj*,
                                     f32);
/* 1DAA08 */ static s32 grZebes_801DAA08(void);
/* 1DAE70 */ static void grZebes_801DAE70(s32, u8, f32, f32, f32);
/* 1DB3CC */ static s32 grZebes_801DB3CC(HSD_GObj* gobj);
/* 1DBB60 */ static s32 grZebes_801DBB60(s32 arg);
/* 1DC260 */ static void grZebes_801DC260(void);
/* 1DC408 */ static void grZebes_801DC408(Ground_GObj*);
/* 1DC744 */ static void grZebes_801DC744(s32, s32);
/* 1DC9DC */ static void grZebes_801DC9DC(s32 arg);
/* 1DCCB8 */ static DynamicsDesc* grZebes_801DCCB8(enum_t arg);
/* 1DCCC0 */ static bool grZebes_801DCCC0(Vec3* arg, int arg0, HSD_JObj* jobj);

static s16 grZe_803E1A10[] = {
    1, 6, 21, 4, 6, 14, 3, 6,
    1, 2, 7, 6, 5, 7, 1, 0,
};

static StageCallbacks grZe_callbacks[] = {
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
    { NULL, NULL, NULL, NULL, { 0 } },
};

static u8 grZe_803E1B20[0x0A] = { 0 };
static u8 grZe_803E1B2C[0x58] = { 0 };
static u8 grZe_803E1B84[0x0A] = "grzebes.c";
static u8 grZe_803E1B90[0xF0] = { 0 };
static u8 grZe_803E1C80[0x6C] = { 0 };
static u8 grZe_803E1CEC[0x3C] = { 0 };

typedef struct grZe_AcidLevelEntry {
    /* +0 */ s16 base;
    /* +2 */ s16 delay_min;
    /* +4 */ s16 delay_max;
    /* +6 */ s16 level;
} grZe_AcidLevelEntry;

typedef struct grZe_YakumonoParam {
    /* 0x00 */ f32 x00;
    /* 0x04 */ f32 x04;
    /* 0x08 */ f32 x08;
    /* 0x0C */ f32 x0C;
    /* 0x10 */ s32 x10;
    /* 0x14 */ u8 pad_14[0x30 - 0x14];
    /* 0x30 */ f32 x30;
    /* 0x34 */ f32 x34;
    /* 0x38 */ f32 x38;
    /* 0x3C */ f32 x3C;
    /* 0x40 */ f32 x40;
    /* 0x44 */ f32 x44;
    /* 0x48 */ f32 x48;
    /* 0x4C */ f32 x4C;
    /* 0x50 */ f32 x50;
    /* 0x54 */ f32 x54;
    /* 0x58 */ f32 x58;
    /* 0x5C */ f32 x5C;
    /* 0x60 */ f32 x60;
    /* 0x64 */ f32 x64;
    /* 0x68 */ f32 x68;
    /* 0x6C */ f32 x6C;
    /* 0x70 */ f32 x70;
    /* 0x74 */ f32 x74;
    /* 0x78 */ f32 x78;
    /* 0x7C */ f32 x7C;
    /* 0x80 */ f32 x80;
    /* 0x84 */ f32 x84;
    /* 0x88 */ f32 x88;
    /* 0x8C */ f32 x8C;
    /* 0x90 */ f32 x90;
    /* 0x94 */ f32 x94;
    /* 0x98 */ f32 x98;
    /* 0x9C */ f32 x9C;
    /* 0xA0 */ grZe_AcidLevelEntry entries[30];
} grZe_YakumonoParam;

/* 4D6990 */ static grZe_YakumonoParam* grZe_804D6990;
/* 4D6994 */ static s32 grZe_804D6994;
/* 4D6998 */ static s16 grZe_804D6998;

extern f32 grZe_804DB0B0;

typedef struct grZe_BubbleEntry {
    /* 0x00 */ u8 active;
    /* 0x01 */ u8 pad_01;
    /* 0x02 */ s16 timer;
    /* 0x04 */ u32 unk04;
    /* 0x08 */ f32 x;
    /* 0x0C */ f32 y;
    /* 0x10 */ f32 unk10;
    /* 0x14 */ f32 unk14;
    /* 0x18 */ f32 size;
    /* 0x1C */ f32 unk1C;
    /* 0x20 */ HSD_GObj* gobj;
} grZe_BubbleEntry;;

/* 8049F140 */ static Vec3 grZe_8049F140[2];
/* 8049F158 */ static Vec3 grZe_8049F158[2];
/* 8049F170 */ static grZe_BubbleEntry grZe_8049F170[20];

typedef struct grZe_BubbleConfig {
    f32 scales[7];
    Vec3 positions[4];
} grZe_BubbleConfig;

typedef struct grZe_AcidState {
    /* +00 */ u8 state;
    /* +01 */ u8 next;
    /* +02 */ s16 timer;
    /* +04 */ f32 base_x;
    /* +08 */ f32 offset;
    /* +0C */ f32 velocity;
    /* +10 */ f32 damage;
    /* +14 */ HSD_JObj* jobj1;
    /* +18 */ HSD_JObj* jobj2;
    /* +1C */ Item_GObj* mat;
    /* +20 */ s32 anim_idx;
} grZe_AcidState;

extern const grZe_BubbleConfig grZe_803B8044;

void grZebes_801D84A0(bool arg) {}

void grZebes_801D84A4(void)
{
    grZe_804D6990 = Ground_801C49F8();
    stage_info.unk8C.b4 = 0;
    stage_info.unk8C.b5 = 1;
    grZebes_801D8558(0);
    grZebes_801D8558(1);
    grZebes_801D8558(6);
    grZebes_801D8558(4);
    grZebes_801D8558(8);
    Ground_801C39C0();
    Ground_801C3BB4();
    grZebes_801DA3E8();
}
void grZebes_801D8528(void) {}

void grZebes_801D852C(void)
{
    grZakoGenerator_801CAE04(0);
}

bool grZebes_801D8550(void)
{
    return false;
}

Ground_GObj* grZebes_801D8558(int id)
{
    Ground_GObj* gobj;
    StageCallbacks* cbs = &grZe_callbacks[id];
    gobj = Ground_801C14D0(id);
    if (gobj != NULL) {
        Ground* gp = GET_GROUND(gobj);
        gp->x8_callback = NULL;
        gp->xC_callback = NULL;
        GObj_SetupGXLink(gobj, grDisplay_801C5DB0, 3, 0);
        if (cbs->callback3 != NULL) {
