#include <dolphin.h>
#include <dolphin/thp/thp.h>

static const u8 __THPJpegNaturalOrder[80] = {
    0,  1,  8,  16, 9,  2,  3,  10, 17, 24, 32, 25, 18, 11, 4,  5,
    12, 19, 26, 33, 40, 48, 41, 34, 27, 20, 13, 6,  7,  14, 21, 28,
    35, 42, 49, 56, 57, 50, 43, 36, 29, 22, 15, 23, 30, 37, 44, 51,
    58, 59, 52, 45, 38, 31, 39, 46, 53, 60, 61, 54, 47, 55, 62, 63,
    63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63
};

static const f64 __THPAANScaleFactor[8] = {
    1.0f, 1.387039845f, 1.306562965f, 1.175875602f,
    1.0f, 0.785694958f, 0.541196100f, 0.275899379f,
};

static THPHuffmanTab* Ydchuff ATTRIBUTE_ALIGN(32);
static THPHuffmanTab* Udchuff ATTRIBUTE_ALIGN(32);
static THPHuffmanTab* Vdchuff ATTRIBUTE_ALIGN(32);
static THPHuffmanTab* Yachuff ATTRIBUTE_ALIGN(32);
static THPHuffmanTab* Uachuff ATTRIBUTE_ALIGN(32);
static THPHuffmanTab* Vachuff ATTRIBUTE_ALIGN(32);
static f32 __THPIDCTWorkspace[64] ATTRIBUTE_ALIGN(32);
static u8* __THPHuffmanBits;
static u8* __THPHuffmanSizeTab;
static u16* __THPHuffmanCodeTab;
static THPSample* Gbase ATTRIBUTE_ALIGN(32);
static u32 Gwid ATTRIBUTE_ALIGN(32);
static f32* Gq ATTRIBUTE_ALIGN(32);
static u8* __THPLCWork512[3];
extern u8* __THPLCWork672[3];
static u32 __THPOldGQR5;
static u32 __THPOldGQR6;
static u8* __THPWorkArea;
static THPCoeff* __THPMCUBuffer[6];
static THPFileInfo* __THPInfo;
static BOOL __THPInitFlag = FALSE;

typedef struct THPRestartFields {
    u8 pad[0x8FC];
    u16 nMCU;
    u16 currMCU;
    u8 RST;
} THPRestartFields;

typedef struct THPMCURowFields {
    u8 pad[0x8CC];
    u16 MCUsPerRow;
} THPMCURowFields;

typedef struct THPFileInfoMCUBufferView {
    u8 pad[0x10];
    THPCoeff* mcuBuffer[6];
} THPFileInfoMCUBufferView;

#define THPROUNDUP(a, b) ((((s32) (a)) + ((s32) (b) - 1L)) / ((s32) (b)))

void __THPPrepBitStream(THPFileInfo* info)
{
    u32* ptr;
    u32 offset, i, j, k;

    ptr = (u32*) ((u32) info->file & 0xFFFFFFFC);
    offset = (u32) info->file & 3;

    if (info->cnt != 33) {
        info->cnt -= (3 - offset) * 8;
    } else {
        info->cnt = (offset * 8) + 1;
    }

    info->file = (u8*) ptr;
    info->currByte = *ptr;

    for (i = 0; i < 4; i++) {
        if (info->validHuffmanTabs & (1 << i)) {
            for (j = 0; j < 32; j++) {
                info->huffmanTabs[i].quick[j] = 0xFF;

                for (k = 0; k < 5; k++) {
                    s32 code = j >> (5 - k - 1);

                    if (code <= info->huffmanTabs[i].maxCode[k + 1]) {
                        info->huffmanTabs[i]
                            .quick[j] = info->huffmanTabs[i].Vij[(
                            s32) (code + info->huffmanTabs[i].valPtr[k + 1])];
                        info->huffmanTabs[i].increment[j] = k + 1;
                        k = 99;
                    }
                }
            }
        }
    }

    {
        s32 YdcTab, UdcTab, VdcTab, YacTab, UacTab, VacTab;

        YdcTab = (info->components[0].DCTableSelector << 1);
        UdcTab = (info->components[1].DCTableSelector << 1);
        VdcTab = (info->components[2].DCTableSelector << 1);

        YacTab = (info->components[0].ACTableSelector << 1) + 1;
        UacTab = (info->components[1].ACTableSelector << 1) + 1;
        VacTab = (info->components[2].ACTableSelector << 1) + 1;

        Ydchuff = &info->huffmanTabs[YdcTab];
        Udchuff = &info->huffmanTabs[UdcTab];
        Vdchuff = &info->huffmanTabs[VdcTab];

        Yachuff = &info->huffmanTabs[YacTab];
        Uachuff = &info->huffmanTabs[UacTab];
        Vachuff = &info->huffmanTabs[VacTab];
    }
}

s32 THPDec_8032F8D4(u32 file_arg, void* out_arg)
{
    u8* p = (u8*) file_arg;
    THPDec_8032FD40_Data* out = (THPDec_8032FD40_Data*) out_arg;
    u8 sH[8];
    u8 sV[8];
    u8 jfif[] = "JFIF";
    u8 found_jfif;
    u8 marker;
    u8 comp_i;
    u8 sampling;
    u8 jfif_i;
    u32 i;
    u8 ncomp;
    u16 len;

    found_jfif = 0;
    memset(out, 0, 0xC);
    if (p[0] != 0xFF || p[1] != 0xD8) {
        return 0;
    }
    p += 2;

    do {
        if (*p != 0xFF) {
            return 0;
        }
        p++;
        while ((s8) *p == 0xFF) {
            p++;
        }
        marker = *p;
        p++;

        if (marker == 0xC0) {
            out->_pad = (p[3] << 8) | p[4];
            out->val1 = (p[5] << 8) | p[6];
            ncomp = p[7];
            p += 8;
            if (ncomp != 3) {
                return 0;
            }
            for (comp_i = 0; comp_i < ncomp; comp_i++) {
                sampling = p[1];
                sH[comp_i] = sampling >> 4;
                sV[comp_i] = sampling & 0xF;
                p += 3;
            }
            if (sH[0] / sH[1] == 2 && sH[0] / sH[2] == 2) {
                if (sV[0] / sV[1] == 2 && sV[0] / sV[2] == 2) {
                    out->val2 = 4;
                } else if (sV[0] == sV[1] && sV[0] == sV[2]) {
                    out->val2 = 2;
                }
            } else if (sH[0] == sH[1] && sH[0] == sH[2]) {
                if (sV[0] == sV[1] && sV[0] == sV[2]) {
                    out->val2 = 1;
                }
            } else {
                return 0;
            }
        } else if (marker == 0xE0) {
            len = (p[0] << 8) | p[1];
            p += 2;
            for (jfif_i = 0; jfif_i < 5; jfif_i++) {
                if (*p != jfif[jfif_i]) {
                    return 0;
                }
                p++;
            }
            found_jfif = 1;
            for (i = 0; i < len - 7; i++) {
                p++;
            }
        } else if (marker == 0xDA) {
            return 1;
        } else if (marker >= 0xC0 && marker <= 0xFE) {
            len = (p[0] << 8) | p[1];
            p += 2;
            for (i = 0; i < len - 2; i++) {
                p++;
            }
        }
    } while (!(out->val2 != 0 && found_jfif != 0));

    return 1;
}

static inline void __THPGQRSetup(void)
{
    register u32 tmp1, tmp2;

#ifdef __MWERKS__ // clang-format off
    asm {
        mfspr   tmp1, GQR5;
        mfspr   tmp2, GQR6;
    }
#endif // clang-format on

    __THPOldGQR5 = tmp1;
    __THPOldGQR6 = tmp2;

#ifdef __MWERKS__ // clang-format off
    asm {
        li      r3, 0x0007
        oris    r3, r3, 0x0007
        mtspr   GQR5, r3
        li      r3, 0x3D04
        oris    r3, r3, 0x3D04
        mtspr   GQR6, r3
    }
#endif // clang-format on
}

static inline void __THPGQRRestore(void)
{
    register u32 tmp1, tmp2;
    tmp1 = __THPOldGQR5;
    tmp2 = __THPOldGQR6;

#ifdef __MWERKS__ // clang-format off
    asm {
        mtspr   GQR5, tmp1;
        mtspr   GQR6, tmp2;
    }
#endif // clang-format on
}

static void __THPDecompressYUV(void* tileY, void* tileU, void* tileV)
{
    u16 currentY, targetY;
    __THPInfo->dLC[0] = tileY;
    __THPInfo->dLC[1] = tileU;
    __THPInfo->dLC[2] = tileV;

    currentY = __THPInfo->decompressedY;
    targetY = __THPInfo->yPixelSize;

    __THPGQRSetup();
    __THPPrepBitStream(__THPInfo);

    if (__THPInfo->xPixelSize == 512 && targetY == 448) {
        while (currentY < targetY) {
            __THPDecompressiMCURow512x448();
            currentY += 16;
        }
    } else if (__THPInfo->xPixelSize == 640 && targetY == 480) {
        while (currentY < targetY) {
            __THPDecompressiMCURow640x480(__THPInfo);
            currentY += 16;
        }
    } else {
        while (currentY < targetY) {
            __THPDecompressiMCURowNxN(__THPInfo, __THPInfo->xPixelSize);
            currentY += 16;
        }
    }

    __THPGQRRestore();
}

static u8 __THPSetupBuffers(THPFileInfo* info)
{
    u8 i;
    THPCoeff* buffer;

    if (info->cnt != 4) {
        OSReport("ERROR: THP only supports 4:2:0!!!\n");
        return 0;
    }

    buffer = (THPCoeff*) OSRoundUp32B(__THPWorkArea);

    for (i = 0; i < 6; i++) {
        __THPMCUBuffer[i] = &buffer[i * 64];
    }
}

typedef struct THPVideoDecodeHeader {
    u16 xSize;
    u16 ySize;
} THPVideoDecodeHeader;

typedef struct THPVideoDecodeInfoView {
    u8* file;
    u32 currByte;
    u32 cnt;
    u8* x0C;
    u8 pad10[0x50 - 0x10];
    u16 xSize;
    u16 ySize;
    u8 pad54[0x6C - 0x54];
    u8* x6C;
    u8 pad70[0x7D - 0x70];
    u8 x7D;
    u8 pad7E[0x8D2 - 0x7E];
    u16 x8D2;
    u8 pad8D4[0x8E8 - 0x8D4];
    u16 x8E8;
    u16 x8EA;
    u16 x8EC;
    u16 x8EE;
    u8 pad8F0[0x904 - 0x8F0];
    u8* x904;
} THPVideoDecodeInfoView;

/**
 * Decodes a THP video file.
 *
 * @param file   Pointer to the THP video file.
 * @param tileY  Pointer to the output tile for Y component.
 * @param tileU  Pointer to the output tile for U component.
 * @param tileV  Pointer to the output tile for V component.
 * @param work   Pointer to the work area.
 * @return       Error code indicating the success or failure of the decoding
 * process.
 */
s32 THPVideoDecode(void* file, void* tileY, void* tileU, void* tileV,
                   void* workArea)
{
    u8 done;
    THPVideoDecodeInfoView* info = tileU;
    THPVideoDecodeHeader* header = file;
    u8* statusOut = tileY;
    u8 status;
    s32 length;
    u32 i;

    DCZeroRange(info, 0x920);
    info->x904 = (u8*) info;
    info->x904 += 0x920;
    info->xSize = header->xSize;
    info->ySize = header->ySize;
    info->file = info->x6C;
    info->cnt = 33;
    info->x8EC = 0;
    info->x8EE = 0;
    info->x8D2 = 0;
    info->x8E8 = 0;
    info->x8EA = 0;
    info->x7D = 0;
    info->x0C = tileV;
    THPDec_803300E0((u32*) info);
    done = FALSE;
    info->file = info->x0C;

    for (;;) {
        if ((*(info->file)++) != 0xFF) {
            goto _err_bad_syntax;
        }

        while (*info->file == 0xFF) {
            info->file++;
        }

        status = (*(info->file)++);

        if (status <= 0xD7) {
            if (status == 0xC4) {
                status = __THPReadHuffmanTableSpecification((THPFileInfo*) info);
                if (status != 0) {
                    goto _err_bad_status;
                }
            } else if (status == 0xC0) {
                status = __THPReadFrameHeader((THPFileInfo*) info);
                if (status != 0) {
                    goto _err_bad_status;
                }
            } else {
                *statusOut = 11;
                return 0;
            }
        } else if (0xD8 <= status && status <= 0xDF) {
            if (status == 0xDD) {
                __THPRestartDefinition((THPFileInfo*) info);
            } else if (status == 0xDB) {
                status = __THPReadQuantizationTable((THPFileInfo*) info);
                if (status != 0) {
                    goto _err_bad_status;
                }
            } else if (status == 0xDA) {
                status = __THPReadScaneHeader((THPFileInfo*) info);
                if (status != 0) {
                    goto _err_bad_status;
                }
                done = TRUE;
                info->x6C = info->file;
            } else if (status != 0xD8) {
                *statusOut = 11;
                return 0;
            }
        } else if (0xE0 <= status) {
            if (status == 0xE0) {
                status = THPDec_80330158((THPFileInfo*) info);
                if (status != 0) {
                    goto _err_bad_status;
                }
            } else if (0xE1 <= status && status <= 0xEF) {
                THPDec_803302EC(&info->file);
            } else if (status == 0xFE) {
                length = (info->file[0] << 8) | info->file[1];
                info->file += 2;
                for (i = 0; i < length - 2; i++) {
                    info->file++;
                }
            } else {
                *statusOut = 11;
                return 0;
            }
        }

        if (done) {
            *statusOut = 0;
            return (s32) info;
        }
    }

_err_bad_syntax:
    *statusOut = 3;
    goto _err_exit;

_err_bad_status:
    *statusOut = status;

_err_exit:
    return 0;
}

s32 THPDec_803302EC(u8** data)
{
    u32 i;
    u8* ptr = *data;
    u16 high = ptr[0];
    u16 low = ptr[1];

    u16 count = (high << 8) | low;
    for (i = 0; i < count; i++) {
        (*data)++;
    }

    return 0;
}

void THPDec_803300E0(u32* data)
{
    s32 val;
    s32 offset;
    u8 count;
    u32* buffer;

    buffer = data;
    count = 0;
    val = (buffer[577] + 31) & 0xFFFFFFE0;
    buffer[577] = (val + 2048);
    offset = val;
    while (count < 16) {
        buffer[4] = offset;
        buffer[5] = offset + 128;
        buffer[6] = offset + 256;
        buffer[7] = offset + 384;
        offset += 1024;
        buffer[8] = offset - 512;
        buffer[9] = offset - 384;
        buffer[10] = offset - 256;
        buffer[11] = offset - 128;
        buffer += 8;
        count += 8;
    }
}

u8 THPDec_80330158(THPFileInfo* info)
{
    u8 jfif[] = "JFIF";
    u8* start;
    u8* p;
    u8* p2;
    u8* sig;
    u8 b1;
    u8 b2;
    u32 len;

    start = info->file;
    len = (u16) (start[1] | (start[0] << 8));
    info->file = start + 2;
    sig = jfif;
    p = info->file;
    info->file = p + 1;
    if (*p != *sig) {
        return 3;
    }
    p = info->file;
    info->file = p + 1;
    if (*p != *++sig) {
        return 3;
    }
    p = info->file;
    info->file = p + 1;
    if (*p != *++sig) {
        return 3;
    }
    p = info->file;
    info->file = p + 1;
    if (*p != *++sig) {
        return 3;
    }
    p = info->file;
    info->file = p + 1;
    if (*p != *++sig) {
        return 3;
    }
    info->file += 2;
    info->file += 1;
    info->file += 1;
    info->file += 1;
    info->file += 1;
    info->file += 1;
    p = info->file;
    info->file = p + 1;
    b1 = *p;
    p2 = info->file;
    info->file = p2 + 1;
    b2 = *p2;
    if (b1 != 0 || b2 != 0) {
        return 7;
    }
    if (len + 4 != (u32) (info->file - info->x0C)) {
        return 8;
    }
    return 0;
}

typedef struct THPScanComp {
    /* 0x00 */ u8 x00;
    /* 0x01 */ u8 samplingH;
    /* 0x02 */ u8 samplingV;
    /* 0x03 */ u8 quantizationTableSelector;
    /* 0x04 */ u8 DCTableSelector;
    /* 0x05 */ u8 ACTableSelector;
    /* 0x06 */ u16 x06;
    /* 0x08 */ u32 x08;
    /* 0x0C */ u32 x0C;
    /* 0x10 */ u32 x10;
    /* 0x14 */ s32 x14;
    /* 0x18 */ s32 x18;
    /* 0x1C */ s32 x1C;
    /* 0x20 */ s32 x20;
    /* 0x24 */ s32 x24;
    /* 0x28 */ s32 x28;
} THPScanComp;

typedef struct THPScanInfo {
    /* 0x000 */ u8* file;
    /* 0x004 */ u32 currByte;
    /* 0x008 */ u32 cnt;
    /* 0x00C */ u8* x0C;
    /* 0x010 */ u8 pad10[0x50 - 0x10];
    /* 0x050 */ u16 x50;
    /* 0x052 */ u16 x52;
    /* 0x054 */ u8 pad54[0x70 - 0x54];
    /* 0x070 */ u16 x70;
    /* 0x072 */ u16 x72;
    /* 0x074 */ u16 x74;
    /* 0x076 */ u16 x76;
    /* 0x078 */ u8 validHuffmanTabs;
    /* 0x079 */ u8 x79;
    /* 0x07A */ u8 x7A;
    /* 0x07B */ u8 x7B;
    /* 0x07C */ u8 x7C;
    /* 0x07D */ u8 pad7D[0x838 - 0x7D];
    /* 0x838 */ THPScanComp components[3];
    /* 0x8BC */ u8 x8BC[0x10];
    /* 0x8CC */ u16 x8CC;
    /* 0x8CE */ u16 x8CE;
    /* 0x8D0 */ u16 x8D0;
    /* 0x8D2 */ u8 pad8D2[0x8D4 - 0x8D2];
    /* 0x8D4 */ u16 x8D4;
    /* 0x8D6 */ u8 pad8D6[0x904 - 0x8D6];
    /* 0x904 */ u8* x904;
} THPScanInfo;

u8 THPDec_803310CC(THPScanInfo* info);

u8 THPDec_803310CC(THPScanInfo* info)
{
    u32 i;
    s32 count;
    s32 count2;
    s32 tmp;
    THPScanComp* c;

    count = info->x7A * 8;
    tmp = count + info->x70;
    tmp--;
    info->x8CC = tmp / count;
    count = info->x7B * 8;
    tmp = count;
    tmp += info->x72;
    tmp--;
    info->x8D0 = tmp / count;
    info->x8CE = 0;
    for (i = 0; i < info->x7C; i++) {
        c = &info->components[i];
        count = info->x7A * 8;
        tmp = count + info->x70 * c->samplingH;
        tmp--;
        c->x28 = tmp / count;
        count = info->x7B * 8;
        tmp = count;
        tmp += info->x72 * c->samplingV;
        tmp--;
        c->x24 = tmp / count;
        c->x14 = c->samplingH;
        c->x18 = c->samplingV;
        c->x1C = c->x14 * c->x18;
        c->x20 = c->x14 * 8;
        count = c->x1C;
        tmp = count;
        if (info->x8CE + count > 0x10) {
            return 0x11;
        }
        if (tmp > 0) {
            count2 = tmp;
            while (count2 > 0) {
                info->x8BC[info->x8CE++] = i;
                count2--;
            }
        }
        if (info->x8CE > 6) {
            OSReport("THP does not support anything other than 4:2:0!\n");
            return 0;
        }
        c->x06 = 0;
    }
    return 0;
}

typedef struct THPDecodeInfo {
    /* 0x000 */ u8 pad00[0x76];
    /* 0x076 */ u16 x76;
    /* 0x078 */ u8 pad78[0x8D4 - 0x78];
    /* 0x8D4 */ u16 x8D4;
    /* 0x8D6 */ u8 pad8D6[0x8EA - 0x8D6];
    /* 0x8EA */ u16 x8EA;
    /* 0x8EC */ u16 pad8EC;
    /* 0x8EE */ u16 x8EE;
    /* 0x8F0 */ u8* x8F0;
    /* 0x8F4 */ u8* x8F4;
    /* 0x8F8 */ u8* x8F8;
} THPDecodeInfo;

void THPDec_80331340(s32 arg0, void* arg1, void* arg2, void* arg3)
{
    THPDecodeInfo* info = (THPDecodeInfo*) arg0;
    info->x8F0 = arg1;
    info->x8F4 = arg2;
    info->x8F8 = arg3;

#ifdef __MWERKS__ // clang-format off
    asm {
        li      r3, 0x0007
        oris    r3, r3, 0x0007
        mtspr   GQR5, r3
        li      r3, 0x3D04
        oris    r3, r3, 0x3D04
        mtspr   GQR6, r3
    }
#endif // clang-format on

    __THPPrepBitStream((THPFileInfo*) info);
    while (info->x8EE < info->x8EA + info->x76) {
        __THPDecompressiMCURow640x480((THPFileInfo*) info);
        info->x8EE += info->x8D4;
    }
}

void THPDec_803313D0(s32 arg0, void* arg1, void* arg2, void* arg3, u32 x)
{
    u32 width = x;
    THPDecodeInfo* info = (THPDecodeInfo*) arg0;
    info->x8F0 = arg1;
    info->x8F4 = arg2;
    info->x8F8 = arg3;

#ifdef __MWERKS__ // clang-format off
    asm {
        li      r3, 0x0007
        oris    r3, r3, 0x0007
        mtspr   GQR5, r3
        li      r3, 0x3D04
        oris    r3, r3, 0x3D04
        mtspr   GQR6, r3
    }
#endif // clang-format on

    __THPPrepBitStream((THPFileInfo*) info);
    while (info->x8EE < info->x8EA + info->x76) {
        __THPDecompressiMCURowNxN((THPFileInfo*) info, width);
        info->x8EE += info->x8D4;
    }
}

s32 THPDec_8032FD40(THPDec_8032FD40_Data* data, u16 num)
{
    s32 base = data->val0 + 0x4028;
    s32 a;
    if (data->val2 != 4) {
        OSReport("ERROR: THP only supports 4:2:0!!!\n");
        return 0;
    }
    a = (data->val1 / 2) * (num / 2) * 2 + (data->val1 * num);
    base = base + a;
    return base;
}

typedef struct THPFrameHeaderComp {
    /* 0x00 */ u8 componentID;
    /* 0x01 */ u8 samplingH;
    /* 0x02 */ u8 samplingV;
    /* 0x03 */ u8 quantizationTableSelector;
    /* 0x04 */ u8 pad04[0x08 - 0x04];
    /* 0x08 */ u32 x08;
    /* 0x0C */ u32 x0C;
    /* 0x10 */ u8 pad10[0x2C - 0x10];
} THPFrameHeaderComp;

typedef struct THPFrameHeaderInfo {
    /* 0x000 */ u8* file;
    /* 0x004 */ u8 pad04[0x70 - 0x04];
    /* 0x070 */ u16 xPixelSize;
    /* 0x072 */ u16 yPixelSize;
    /* 0x074 */ u8 pad74[0x7A - 0x74];
    /* 0x07A */ u8 samplingHMax;
    /* 0x07B */ u8 samplingVMax;
    /* 0x07C */ u8 nComponents;
    /* 0x07D */ u8 pad7D[0x838 - 0x7D];
    /* 0x838 */ THPFrameHeaderComp components[3];
    /* 0x8BC */ u8 pad8BC[0x8D4 - 0x8BC];
    /* 0x8D4 */ u16 x8D4;
} THPFrameHeaderInfo;

static u8 __THPReadFrameHeader(THPFileInfo* info)
{
    THPFrameHeaderInfo* frame = (THPFrameHeaderInfo*) info;
    THPFrameHeaderInfo* compBase;
    THPFrameHeaderInfo* compBase2;
    u8 i;
    u8 j;
    u8 k;
    THPFrameHeaderComp* comp;
    u8 utmp8;
    u16 ySize;

    frame->file += 2;

    utmp8 = (*(frame->file)++);

    if (utmp8 != 8) {
        return 10;
    }

    frame->yPixelSize = (u16) ((frame->file)[0] << 8 | (frame->file)[1]);
    frame->file += 2;
    frame->xPixelSize = (u16) ((frame->file)[0] << 8 | (frame->file)[1]);
    frame->file += 2;

    frame->nComponents = (*(frame->file)++);
    if (frame->nComponents != 3 && frame->nComponents != 1) {
        return 12;
    }

    for (i = 0, compBase = frame; i < frame->nComponents;
         compBase = (THPFrameHeaderInfo*) ((u8*) compBase +
                                           sizeof(THPFrameHeaderComp)), i++) {
