#ifndef MELEE_EF_TYPES_H
#define MELEE_EF_TYPES_H

#include <placeholder.h>

#include "ef/forward.h" // IWYU pragma: export
#include <baselib/forward.h>

struct ef_UnkStruct2 {
    /* +0 */ HSD_JObj* x0;
};

struct ef_UnkStruct0 {
    /*  +0 */ ef_UnkStruct2* x0;
    /*  +4 */ int x4;
    /*  +8 */ UNK_T x8;
    /*  +C */ s16 xC;
    /*  +E */ s16 xE;
    /* +10 */ int x10;
    /* +14 */ int x14;
    /* +18 */ int x18;
};

struct ef_UnkStruct1 {
    /* +0 */ int x0;
    /* +4 */ int x4;
    /* +8 */ int x8;
    /* +C */ int xC;
};

#endif
