#include "ftdata.h"

#include "ft_0877.h"

#include <platform.h>

#include "ef/efasync.h"

#include "forward.h"

#include "ft/fighter.h"
#include "ft/ft_0852.h"
#include "ft/ft_0BEC.h"
#include "ft/ft_0C31.h"
#include "ft/ft_0CD1.h"
#include "ft/ft_0CDD.h"
#include "ft/ft_0D31.h"
#include "ft/ftcamera.h"
#include "ft/ftcliffcommon.h"
#include "ft/ftcolanim.h"
#include "ft/ftlipstickswing.h"
#include "ft/ftstarrodswing.h"
#include "ft/ftswing.h"
#include "ft/inlines.h"
#include "ft/types.h"
#include "ftCaptain/ftCa_Init.h"
#include "ftCaptain/ftCa_SpecialLw.h"
#include "ftCaptain/ftCa_SpecialN.h"
#include "ftCaptain/ftCa_SpecialS.h"
#include "ftCLink/ftCl_Init.h"

#include "ftCommon/forward.h"

#include "ftCommon/ftCo_AppealS.h"
#include "ftCommon/ftCo_Attack1.h"
#include "ftCommon/ftCo_Attack100.h"
#include "ftCommon/ftCo_AttackAir.h"
#include "ftCommon/ftCo_AttackDash.h"
#include "ftCommon/ftCo_AttackHi3.h"
#include "ftCommon/ftCo_AttackHi4.h"
#include "ftCommon/ftCo_AttackLw3.h"
#include "ftCommon/ftCo_AttackLw4.h"
#include "ftCommon/ftCo_AttackS3.h"
#include "ftCommon/ftCo_AttackS4.h"
#include "ftCommon/ftCo_Barrel.h"
#include "ftCommon/ftCo_BarrelWait.h"
#include "ftCommon/ftCo_Bury.h"
#include "ftCommon/ftCo_CaptureCaptain.h"
#include "ftCommon/ftCo_CaptureCut.h"
#include "ftCommon/ftCo_CaptureDamageKoopa.h"
#include "ftCommon/ftCo_CaptureKirby.h"
#include "ftCommon/ftCo_CaptureKoopa.h"
#include "ftCommon/ftCo_CaptureWaitKirby.h"

#include "ftKoopa/ftKp_Init.h"
#include "ftLink/ftLk_Init.h"
#include "ftLink/ftLk_SpecialHi.h"
#include "ftLink/ftLk_SpecialLw.h"
#include "ftLink/ftLk_SpecialN.h"
#include "ftLink/ftLk_SpecialS.h"
#include "ftLuigi/ftLg_Init.h"
#include "ftLuigi/ftLg_SpecialHi.h"
#include "ftLuigi/ftLg_SpecialLw.h"
#include "ftLuigi/ftLg_SpecialN.h"
#include "ftLuigi/ftLg_SpecialS.h"
#include "ftMario/ftMr_Init.h"
#include "ftMario/ftMr_SpecialHi.h"
#include "ftMario/ftMr_SpecialLw.h"
#include "ftMario/ftMr_SpecialN.h"
#include "ftMario/ftMr_SpecialS.h"
#include "ftMario/ftMr_Strings.h"
#include "ftMars/ftMs_Init.h"
#include "ftMars/ftMs_SpecialHi.h"
#include "ftMars/ftMs_SpecialLw.h"
#include "ftMars/ftMs_SpecialN.h"
#include "ftMars/ftMs_SpecialS.h"
#include "ftMasterHand/ftMh_CaptureDamageMasterHand.h"
#include "ftMasterHand/ftMh_CaptureMasterHand.h"
#include "ftMasterHand/ftMh_Init.h"
#include "ftMasterHand/ftMh_ThrownMasterHand.h"
#include "ftMewtwo/ftMt_Init.h"
#include "ftMewtwo/ftMt_SpecialHi.h"
#include "ftMewtwo/ftMt_SpecialLw.h"
#include "ftMewtwo/ftMt_SpecialN.h"
#include "ftMewtwo/ftMt_SpecialS.h"
#include "ftNana/ftNn_Init.h"
#include "ftNess/ftNs_Init.h"
#include "ftNess/ftNs_SpecialHi.h"
#include "ftNess/ftNs_SpecialLw.h"
#include "ftNess/ftNs_SpecialN.h"
#include "ftNess/ftNs_SpecialS.h"
#include "ftPeach/ftPe_Init.h"
#include "ftPeach/ftPe_SpecialHi.h"
#include "ftPeach/ftPe_SpecialLw.h"
#include "ftPeach/ftPe_SpecialN.h"
#include "ftPeach/ftPe_SpecialS.h"
#include "ftPichu/ftPc_Init.h"
#include "ftPikachu/ftPk_Init.h"
#include "ftPikachu/ftPk_SpecialHi.h"
#include "ftPikachu/ftPk_SpecialLw.h"
#include "ftPikachu/ftPk_SpecialN.h"
#include "ftPikachu/ftPk_SpecialS.h"
#include "ftPopo/ftPp_1211.h"
#include "ftPopo/ftPp_Init.h"
#include "ftPopo/ftPp_SpecialN.h"
#include "ftPopo/ftPp_SpecialS.h"
#include "ftPurin/ftPr_Init.h"
#include "ftPurin/ftPr_SpecialHi.h"
#include "ftPurin/ftPr_SpecialLw.h"
#include "ftPurin/ftPr_SpecialN.h"
#include "ftPurin/ftPr_SpecialS.h"
#include "ftSamus/ftSs_Init.h"
#include "ftSamus/ftSs_SpecialHi.h"
#include "ftSamus/ftSs_SpecialLw_1.h"
#include "ftSamus/ftSs_SpecialN.h"
#include "ftSamus/ftSs_SpecialS.h"
#include "ftSandbag/ftSb_Init.h"
#include "ftSeak/ftSk_Init.h"
#include "ftSeak/ftSk_SpecialHi.h"
#include "ftSeak/ftSk_SpecialLw.h"
#include "ftSeak/ftSk_SpecialN.h"
#include "ftSeak/ftSk_SpecialS.h"
#include "ftYoshi/ftYs_Guard.h"
#include "ftYoshi/ftYs_Init.h"
#include "ftYoshi/ftYs_SpecialHi.h"
#include "ftYoshi/ftYs_SpecialN.h"
#include "ftYoshi/ftYs_SpecialS.h"
#include "ftZakoBoy/ftBo_Init.h"
#include "ftZakoGirl/ftGl_Init.h"
#include "ftZelda/ftZd_Init.h"
#include "ftZelda/ftZd_SpecialHi.h"
#include "ftZelda/ftZd_SpecialLw.h"
#include "ftZelda/ftZd_SpecialN.h"
#include "ftZelda/ftZd_SpecialS.h"
#include "lb/lbarchive.h"
#include "lb/lbarq.h"
#include "lb/lbdvd.h"
#include "lb/lbfile.h"
#include "pl/player.h"

#include <baselib/forward.h>

#include <baselib/debug.h>
#include <baselib/objalloc.h>

extern int ft_8045996C[FTKIND_MAX];

/* 4599F0 */ extern UnkCostumeStruct lbl_804599F0;
/* 459A98 */ extern UnkCostumeStruct ft_80459A98;
/* 459B28 */ extern UnkCostumeStruct ft_80459B28;
/* 459C10 */ extern UnkCostumeStruct ft_80459C10;
/* 459CA0 */ extern UnkCostumeStruct ft_80459CA0;
/* 45A090 */ extern UnkCostumeStruct ft_8045A090;
/* 3C82EC */ extern UnkCostumeStruct ftLk_Init_803C82EC;
/* 459D18 */ extern UnkCostumeStruct ft_80459D18;
/* 459D90 */ extern UnkCostumeStruct ft_80459D90;
/* 459DF0 */ extern UnkCostumeStruct ft_80459DF0;
/* 459E68 */ extern UnkCostumeStruct ft_80459E68;
/* 459EC8 */ extern UnkCostumeStruct ft_80459EC8;
/* 459F28 */ extern UnkCostumeStruct ft_80459F28;
/* 459F88 */ extern UnkCostumeStruct ft_80459F88;
/* 45A000 */ extern UnkCostumeStruct ft_8045A000;
/* 45A0F0 */ extern UnkCostumeStruct ft_8045A0F0;
/* 45A168 */ extern UnkCostumeStruct ft_8045A168;
/* 45A1F8 */ extern UnkCostumeStruct ft_8045A1F8;
/* 45A270 */ extern UnkCostumeStruct ft_8045A270;
/* 45A2D0 */ extern UnkCostumeStruct ft_8045A2D0;
/* 45A330 */ extern UnkCostumeStruct ft_8045A330;
/* 45A3A8 */ extern UnkCostumeStruct ft_8045A3A8;
/* 45A420 */ extern UnkCostumeStruct ft_8045A420;
/* 45A480 */ extern UnkCostumeStruct ft_8045A480;
/* 45A4E0 */ extern UnkCostumeStruct ft_8045A4E0;
/* 45A540 */ extern UnkCostumeStruct ft_8045A540;
/* 45A5B8 */ extern UnkCostumeStruct ft_8045A5B8;
/* 45A630 */ extern UnkCostumeStruct ft_8045A630;
/* 45A648 */ extern UnkCostumeStruct ft_8045A648;
/* 45A660 */ extern UnkCostumeStruct ft_8045A660;
/* 45A678 */ extern UnkCostumeStruct ft_8045A678;
/* 45A690 */ extern UnkCostumeStruct ft_8045A690;
/* 45A6A8 */ extern UnkCostumeStruct ft_8045A6A8;

/* 3C0EC0 */ struct UnkCostumeList CostumeListsForeachCharacter[FTKIND_MAX] = {
    {
        &lbl_804599F0,
        5,
    },
    {
        &ft_80459B28,
        4,
    },
    {
        &ft_80459A98,
        6,
    },
    {
        &ft_80459CA0,
        5,
    },
    {
        &ft_80459C10,
        6,
    },
    {
        &ft_8045A090,
        4,
    },
    {
        &ftLk_Init_803C82EC,
        5,
    },
    {
        &ft_80459D18,
        5,
    },
    {
        &ft_80459D90,
        4,
    },
    {
        &ft_80459DF0,
        5,
    },
    {
        &ft_80459E68,
        4,
    },
    {
        &ft_80459EC8,
        4,
    },
    {
        &ft_80459F28,
        4,
    },
    {
        &ft_80459F88,
        5,
    },
    {
        &ft_8045A000,
        6,
    },
    {
        &ft_8045A1F8,
        5,
    },
    {
        &ft_8045A2D0,
        4,
    },
    {
        &ft_8045A270,
        4,
    },
    {
        &ft_8045A0F0,
