#ifndef MELEE_FT_TYPES_H
#define MELEE_FT_TYPES_H

#include <platform.h>
#include "ft/forward.h"
#include "ftCommon/forward.h"

#include "ft/ftanim.h"
#include "ftCaptain/types.h"
#include "ftCommon/types.h"
#include "ftDonkey/types.h"
#include "ftFox/types.h"
#include "ftGameWatch/types.h"
#include "ftKirby/types.h"
#include "ftKoopa/types.h"
#include "ftLink/types.h"
#include "ftLuigi/types.h"
#include "ftMario/types.h"
#include "ftMars/types.h"
#include "ftMasterHand/types.h"
#include "ftMewtwo/types.h"
#include "ftNess/types.h"
#include "ftPeach/types.h"
#include "ftPikachu/types.h"
#include "ftPopo/types.h"
#include "ftPurin/types.h"
#include "ftSamus/types.h"
#include "ftSandbag/types.h"
#include "ftSeak/types.h"
#include "ftYoshi/types.h"
#include "ftZakoBoy/types.h"
#include "ftZelda/types.h"
#include "gr/stage.h"
#include "lb/lbcollision.h"
#include "lb/lbrefract.h"
#include "pl/player.h"

#include <common_structs.h>
#include <math.h>
#include <dolphin/gx/types.h>
#include <dolphin/mtx/types.h>
#include <baselib/archive.h>
#include <baselib/controller.h>
#include <baselib/dobj.h>
#include <baselib/gobj.h>
#include <baselib/gobjgxlink.h>
#include <baselib/gobjuserdata.h>
#include <baselib/jobj.h>
#include <baselib/lobj.h>
#include <baselib/random.h>

// Table in PlCo.dat
typedef struct _FighterPartsTable {
    u8* joint_to_part;
    u8* part_to_joint;
    u32 parts_num;
} FighterPartsTable;

// Points to data in PlCo.dat
typedef struct _ftCommonData {
    /* +0 */ f32 x0;
    /* +4 */ f32 x4;
    /* +8 */ f32 x8_someStickThreshold;
    /* +C */ f32 xC;
    /* +10 */ f32 x10;
    /* +14 */ f32 x14;
    /* +18 */ f32 x18;
    /* +1C */ f32 x1C;
    /* +20 */ f32 x20;
    /* +24 */ f32 x24;
    /* +28 */ f32 x28;
    /* +2C */ f32 x2C;
    /* +30 */ f32 x30;
    /* +34 */ u8 x34[0x70 - 0x34];
    /* +70 */ f32 x70_someLStickYMax;
    /* +74 */ u8 x74[0x78 - 0x74];
    /* +78 */ f32 x78;
    /* +7C */ u8 x7C[0x88 - 0x7C];
    /* +88 */ f32 x88;
    /* +8C */ s32 x8C;
    /* +90 */ u8 x90[0x98 - 0x90];
    /* +98 */ f32 x98_shieldHealthInit;
    /* +9C */ u8 x9C[0xEC - 0x9C];
    /* +EC */ f32 xEC;
    /* +F0 */ f32 xF0;
    /* +F4 */ u8 xF4[0x128 - 0xF4];
    /* +128 */ f32 x128;
    /* +12C */ f32 x12C;
    /* +130 */ f32 x130;
    /* +134 */ s32 x134;
    /* +138 */ f32 x138;
    /* +13C */ f32 x13C;
    /* +140 */ u8 x140[0x164 - 0x140];
    /* +164 */ f32 x164;
    /* +168 */ u8 x168[0x194 - 0x168];
    /* +194 */ f32 x194_unkHitLagFrames;
    /* +198 */ f32 x198;
    /* +19C */ f32 x19C;
    /* +1A0 */ f32 x1A0;
    /* +1A4 */ u8 x1A4[0x1FC - 0x1A4];
    /* +1FC */ f32 x1FC;
    /* +200 */ f32 x200;
    /* +204 */ f32 x204_knockbackFrameDecay;
    /* +208 */ u8 x208[0x21C - 0x208];
    /* +21C */ f32 x21C;
    /* +220 */ u8 x220[0x258 - 0x220];
    /* +258 */ f32 x258;
    /* +25C */ u8 x25C[0x260 - 0x25C];
    /* +260 */ f32 x260_startShieldHealth;
    /* +264 */ u8 x264[0x27C - 0x264];
    /* +27C */ f32 x27C;
    /* +280 */ f32 x280_unkShieldHealth;
    /* +284 */ f32 x284;
    /* +288 */ f32 x288;
    /* +28C */ u8 x28C[0x294 - 0x28C];
    /* +294 */ f32 x294;
    /* +298 */ u8 x298[0x2A4 - 0x298];
    /* +2A4 */ f32 x2A4;
    /* +2A8 */ u8 x2A8[0x2B4 - 0x2A8];
    /* +2B4 */ f32 x2B4;
    /* +2B8 */ u8 x2B8[0x2DC - 0x2B8];
    /* +2DC */ f32 x2DC;
    /* +2E0 */ f32 x2E0;
    /* +2E4 */ u8 x2E4[0x308 - 0x2E4];
    /* +308 */ f32 x308;
    /* +30C */ u8 x30C[0x3A8 - 0x30C];
    /* +3A8 */ f32 x3A8;
    /* +3AC */ u8 x3AC[0x3E0 - 0x3AC];
    /* +3E0 */ f32 x3E0;
    /* +3E4 */ f32 x3E4;
    /* +3E8 */ f32 x3E8_shieldKnockbackFrameDecay;
    /* +3EC */ f32 x3EC_shieldGroundFrictionMultiplier;
    /* +3F0 */ u8 x3F0[0x418 - 0x3F0];
    /* +418 */ s32 x418;
    /* +41C */ s32 x41C;
    /* +420 */ u8 x420[0x440 - 0x420];
    /* +440 */ f32 x440;
    /* +444 */ f32 x444;
    /* +448 */ f32 x448;
    /* +44C */ f32 x44C;
    /* +450 */ f32 x450;
    /* +454 */ f32 x454;
    /* +458 */ f32 x458;
    /* +45C */ f32 x45C;
    /* +460 */ f32 x460;
    /* +464 */ u8 x464[0x480 - 0x464];
    /* +480 */ f32 x480;
    /* +484 */ u8 x484[0x498 - 0x484];
    /* +498 */ u32 x498_ledgeCooldownTime;
    /* +49C */ u8 x49C[0x4C4 - 0x49C];
    /* +4C4 */ s32 x4C4;
    /* +4C8 */ s32 x4C8;
    /* +4CC */ s32 x4CC;
    /* +4D0 */ f32 x4D0;
    /* +4D4 */ f32 x4D4;
    /* +4D8 */ u32 x4D8;
    /* +4DC */ u8 x4DC[0x59C - 0x4DC];
    /* +59C */ f32 x59C;
    /* +5A0 */ u8 x5A0[0x5C0 - 0x5A0];
    /* +5F0 */ f32 x5C0;
    /* +5C4 */ u8 x5C4[0x5F0 - 0x5C4];
    /* +5F0 */ u32 x5F0;
    /* +5F4 */ u8 x5F4[0x6D8 - 0x5F4];
    /// @todo expand to actual size
    /* +6D8 */ void* x6D8[1];
    /* +6DC */ GXColor x6DC_colorsByPlayer[4];
    /* +6EC */ u8 x6EC[0x6F4 - 0x6EC];
    /* +6F4 */ s32 x6F4_unkDamage;
    /* +6F8 */ s32 x6F8;
    /* +6FC */ s32 x6FC;
    /* +700 */ s32 x700;
    /* +704 */ f32 x704;
    /* +708 */ f32 x708;
    /* +70C */ f32 x70C;
    /* +710 */ f32 x710;
    /* +714 */ f32 x714;
    /* +718 */ u8 x718[0x768 - 0x718];
    /* +768 */ f32 x768;
    /* +76C */ f32 x76C;
    /* +770 */ f32 x770;
    /* +774 */ s32 x774;
    /* +7A0 */ u8 x7A0_filler[0x7A0 - 0x778];
    /* +7A0 */ s32 x7A0;
    /* +7A4 */ s32 x7A4;
    /* +7A8 */ s32 x7A8;
    /* +7AC */ s32 x7AC;
    /* +7B0 */ s32 x7B0;
    /* +7B4 */ s32 x7B4_unkDamage;
    /* +7B8 */ f32 x7B8;
    /* +7BC */ f32 x7BC;
    /* +7C0 */ f32 x7C0;
    /* +7C4 */ s32 x7C4;
    /* +7C8 */ s32 x7C8;
    /* +7CC */ s32 x7CC;
    /* +7D0 */ s32 x7D0;
    /* +7D4 */ s32 x7D4;
    /* +7D8 */ s32 x7D8;
    /* +7DC */ s32 x7DC;
    /* +7E0 */ s32 x7E0;
    /* +7E4 */ f32 x7E4_scaleZ;
    /* +7E8 */ u8 x7E8_filler[0x814 - 0x7E8];
    /* +814 */ s32 x814;
    // lots of more data following, exact size to be determined
} ftCommonData;

typedef struct _FtCollisionData {
    u8 x0[0x28];
    u32 x28;
    u8 x2C[0x30 - 0x2C];
    s32 x30;
    s32 x34;
} FtCollisionData;

typedef struct _DObjList {
    usize_t count;
    HSD_DObj** data;
} DObjList;

struct UnkFloat6_Camera;

typedef struct _ftData {
    struct {
        u8 x0_fill[0x8C];
        f32 x8C;
        u8 x90_fill[0xFC - 0x90];
        f32 xFC;
        u8 x100_fill[0x16C - 0x100];
        s32 x16C_idx;
    }* x0;
    /* 0x04 */ void* ext_attr;
    struct {
        u8 x0_fill[0x10];
        u8 unk10, unk11, unk12;
    }* x8;
    struct S_TEMP4* xC;
    u8* x10;
    s32 filler_x14[10];
    struct UnkFloat6_Camera* x3C;
    s32 filler_x40[2];
    /* 0x48 */ UNK_T* x48_items;
    FtCollisionData* x4C_collisionData;
    s32 filler_x50[2];
    void* x58;
} ftData;

typedef struct _ThrowFlags {
    union {
        struct {
            u8 b0 : 1;
            u8 b1 : 1;
            u8 b2 : 1;
            u8 b3 : 1;
            u8 b4 : 1;
            u8 b5 : 1;
            u8 b6 : 1;
            u8 b7 : 1;
        };
        u32 flags;
    };
} ThrowFlags;

typedef struct ftCo_DatAttrs {
    /* fp+110 */ f32 walk_init_vel;
    /* fp+114 */ f32 walk_accel;
    /* fp+118 */ f32 walk_max_vel;
    /* fp+11C */ f32 x11C_SlowWalkMax;
    /* fp+120 */ f32 x120_MidWalkPoint;
    /* fp+124 */ f32 x124_FastWalkMin;
    /* fp+128 */ f32 gr_friction; // used
    /* fp+12C */ f32 x12C_DashInitialVelocity;
    /* fp+130 */ f32 x130_DashrunAccelerationA;
    /* fp+134 */ f32 x134_DashrunAccelerationB;
    /* fp+138 */ f32 x138_DashrunTerminalVelocity;
    /* fp+13C */ f32 x13C_RunAnimationScaling;
    /* fp+140 */ f32 x140_MaxRunbrakeFrames;
    /* fp+144 */ f32 x144_GroundedMaxHorizontalVelocity;
    /* fp+148 */ f32 x148_JumpStartupTime;
    /* fp+14C */ f32 x14C_JumpHInitialVelocity;
    /* fp+150 */ f32 x150_JumpVInitialVelocity;
    /* fp+154 */ f32 x154_GroundToAirJumpMomentumMultiplier;
    /* fp+158 */ f32 x158_JumpHMaxVelocity;
    /* fp+15C */ f32 x15C_HopVInitialVelocity;
    /* fp+160 */ f32 x160_AirJumpVMultiplier;
    /* fp+164 */ f32 x164_AirJumpHMultiplier;
    /* fp+168 */ s32 x168_MaxJumps;
    /* fp+16C */ f32 grav;
    /* fp+170 */ f32 terminal_vel;
    /* fp+174 */ f32 air_drift_stick_mul;
    /* fp+178 */ f32 x178_AerialDriftBase;
    /* fp+17C */ f32 air_drift_max;
    /* fp+180 */ f32 x180_AerialFriction;
    /* fp+184 */ f32 x184_FastfallVelocity;
    /* fp+188 */ f32 x188_HorizontalAirMobilityConstant;
    /* fp+18C */ f32 x18C_Jab_2InputWindow;
    /* fp+190 */ s32 x190_Jab_3InputWindow;
    /* fp+194 */ s32 x194_FramesToChangeDirectionOnStandingTurn;
    /* fp+198 */ f32 x198_Weight;
    /* fp+19C */ f32 x19C_ModelScaling;
    /* fp+1A0 */ f32 x1A0_InitialShieldSize;
    /* fp+1A4 */ f32 x1A4_ShieldBreakInitialVelocity;
    /* fp+1A8 */ s32 x1A8_RapidJabWindow;
    /* fp+1AC */ s32 x1AC;
    /* fp+1B0 */ s32 x1B0;
    /* fp+1B4 */ s32 x1B4;
    /* fp+1B8 */ f32 x1B8_LedgeJumpHorizontalVelocity;
    /* fp+1BC */ f32 x1BC_LedgeJumpVerticalVelocity;
    /* fp+1C0 */ f32 x1C0_ItemThrowVelocityMultiplier;
    /* fp+1C4 */ s32 x1C4;
    /* fp+1C8 */ s32 x1C8;
    /* fp+1CC */ s32 x1CC;
    /* fp+1D0 */ s32 x1D0;
    /* fp+1D4 */ s32 x1D4;
    /* fp+1D8 */ s32 x1D8;
    /* fp+1DC */ s32 x1DC;
    /* fp+1E0 */ s32 x1E0;
    /* fp+1E4 */ s32 x1E4;
    /* fp+1E8 */ s32 x1E8;
    /* fp+1EC */ s32 x1EC;
    /* fp+1F0 */ f32 x1F0_KirbyBStarDamage;
    /* fp+1F4 */ f32 x1F4_NormalLandingLag;
    /* fp+1F8 */ f32 x1F8_NAirLandingLag;
    /* fp+1FC */ f32 x1FC_FAirLandingLag;
    /* fp+200 */ f32 x200_BAirLandingLag;
    /* fp+204 */ f32 x204_UAirLandingLag;
    /* fp+208 */ f32 x208_DAirLandingLag;
    /* fp+20C */ f32 x20C_NametagHeight;
    /* fp+210 */ s32 x210;
    /* fp+214 */ f32 x214_WallJumpHorizontalVelocity;
    /* fp+218 */ f32 x218_WallJumpVerticalVelocity;
    /* fp+21C */ s32 x21C;
    /* fp+220 */ f32 x220_TrophyScale;
    /* fp+224 */ Vec3 x224;
    /* fp+230 */ Vec3 x230;
    /* fp+23C */ f32 x23C;
    /* fp+240 */ Vec3 x240;
    /* fp+24C */ f32 x24C;
    /* fp+250 */ s32 x250;
    /* fp+254 */ s32 x254;
    /* fp+258 */ f32 x258; // used
    /* fp+25C */ f32 x25C_BubbleRatio;
    /* fp+260 */ s32 x260;
    /* fp+264 */ s32 x264;
    /* fp+268 */ s32 x268;
    /* fp+26C */ s32 x26C;
    /* fp+270 */ f32 x270_RespawnPlatformScale;
    /* fp+274 */ s32 x274;
    /* fp+278 */ s32 x278;
    /* fp+27C */ s32 x27C_CameraZoomTargetBone;
    /* fp+280 */ Vec3 x280;
    /* fp+28C */ s32 x28C;
    /* fp+290 */ s32 x290_WeightDependentThrowSpeedFlags;
} ftCo_DatAttrs;

typedef struct _FighterBone {
    /* +0 */ HSD_JObj* x0_jobj;
    /* +4 */ HSD_JObj* x4_jobj2; // used for interpolation
    /* +5 */ UnkFlagStruct flags;
    /* +6 */ u8 filler_x6[7];
} FighterBone;

typedef struct _CameraBox {
    u32 data_filler[2];
    s32 x8;
    UnkFlagStruct xC_flag;
    u8 xD_fill[0x10 - 0xD];
    Vec3 x10; // might be Vec2?
    Vec3 x1C;
    f32 x28;
    Vec2 x2C;
    Vec3 x34;
    Vec2 x40;
    Vec3 x48;
} CameraBox;

typedef struct _ftECB {
    Vec2 top;
    Vec2 bottom;
    Vec2 right;
    Vec2 left;
} ftECB;

typedef struct _ftCollisionBox {
    f32 top;
    f32 bottom;
    Vec2 left;
    Vec2 right;
} ftCollisionBox;

typedef struct _ECBFlagStruct {
    union {
        struct {
            u8 b0 : 1;
            u8 b1234 : 4;
            u8 b5 : 1;
            u8 b6 : 1;
            u8 b7 : 1;
        } bits;
        u8 raw;
    };
} ECBFlagStruct;

typedef struct SurfaceData {
    s32 index;
    u32 unk;
    Vec3 normal;
} SurfaceData;

typedef struct _CollData {
    /* fp+6F0 */ HSD_GObj* x0_gobj;
    /* fp+6F4 */ Vec3 x4_vec;
    /* fp+700 */ Vec3 x10_vec;
    /* fp+70C */ Vec3 x1C_vec;
