#ifndef __GALE01_04D164
#define __GALE01_04D164

#include "mplib.h" // IWYU pragma: export

#include <placeholder.h>

#include "mp/forward.h"

/* 04E97C */ static bool mpLib_8004E97C(float arg0, float arg1, float arg2,
                                        float arg3, float arg4, float arg5,
                                        float arg6, float arg7, float* arg8,
                                        float* arg9);
/* 4D64B0 */ static bool mpLib_804D64B0;
/* 4D64B4 */ static struct mpLib_804D64B4_t {
    u8 pad[0xC];
    int xC;
    u8 pad_x10[0x28 - 0x10];
    int x28;
}* mpLib_804D64B4;
/* 4D64B8 */ static mpLib_Point* mpLib_804D64B8;
/* 4D64BC */ static mp_UnkStruct2* mpLib_804D64BC;
/* 4D64C0 */ static mpLib_804D64C0_t* mpLib_804D64C0;
/* 4D64C4 */ static mpLib_804D64C0_t* mpLib_804D64C4;
/* 4D64C8 */ static mpLib_804D64C0_t* mpLib_804D64C8;
/* 4D64CC */ static s32 mpLib_804D64CC;
/* 4D64D0 */ static s32 mpLib_804D64D0;
/* 4D64D4 */ static s32 mpLib_804D64D4;
/* 4D64D8 */ static s32 mpLib_804D64D8;
/* 4D64DC */ static s32 mpLib_804D64DC;
/* 4D64E0 */ static s32 mpLib_804D64E0;
/* 4D64E4 */ static s32 mpLib_804D64E4;

#endif
