#include <melee/gm/types.h>
#include <melee/sc/types.h>

static s32 lbl_804D4190 = 0xFFFFFFFF;

static HSD_Archive* lbl_804D6638;
static HSD_Archive* lbl_804D6640;
static HSD_Archive* lbl_804D6644;
static HSD_Archive* lbl_804D6648;
static SceneDesc* lbl_804D664C;
static SceneDesc* lbl_804D6650;

static struct {
    u8 x0;
    u8 x1;
    u8 pad2[0x32 - 0x2];
    u8 x32;
    u8 pad33[0x5E - 0x33];
    u8 x5E;
    u8 pad5F[0xDC - 0x5F];
} lbl_80473AB8[0x40];

TmData gm_804771C4;

static struct lbl_803D9D20_t {
    /*  +0 */ u8 x0[0x59];
    /* +59 */ u8 x59[0x72 - 0x59];
    /* +72 */ u8 x72[0x8C - 0x72];
} lbl_803D9D20 = {
    {
        0x04, 0x06, 0x08, 0x0C, 0x10, 0x18, 0x20, 0x30,
        0x40, 0x06, 0x09, 0x0C, 0x12, 0x1B, 0x08, 0x0C,
        0x10, 0x10, 0x14, 0x18, 0x1C, 0x20, 0x20, 0x24,
        0x28, 0x2C, 0x30, 0x34, 0x38, 0x3C, 0x40, 0x40,
        0x04, 0x07, 0x08, 0x0E, 0x10, 0x19, 0x20, 0x31,
        0x3F, 0x04, 0x05, 0x08, 0x0A, 0x0E, 0x04, 0x05,
        0x06, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x10, 0x0D,
        0x0F, 0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x17,
        0x06, 0x05, 0x04, 0x04, 0x06, 0x04, 0x05, 0x04,
        0x05, 0x04, 0x04, 0x04, 0x05, 0x04, 0x04, 0x04,
        0x05, 0x06, 0x05, 0x04, 0x05, 0x05, 0x04, 0x04, 0x04,
    },
    {
        0x00, 0x01, 0x02, 0x04, 0x05, 0x06, 0x08,
        0x0B, 0x0D, 0x0E, 0x12, 0x11, 0x10, 0x0C, 0x03,
        0x16, 0x07, 0x0F, 0x0A, 0x09, 0x19, 0x15, 0x14,
        0x18, 0x17,
    },
};

static float lbl_803D9DAC[9] = { // maybe vec3?
    320, -240, 415.6922,
    320, -240, 415.6922,
};

static struct lbl_803D9DD0_t {
    /* +00 */ HSD_CObj* cobj;
    /* +04 */ char pad_B4[0xD0 - 0xB4];
    /* +20 */ float xD0;
    /* +24 */ float xD4;
    /* +28 */ Vec3 eye_position;
    /* +34 */ char pad_E4[0xEC - 0xE4];
    /* +3C */ Vec3 interest;
    /* +48 */ u8 pad_48[0x4];
} lbl_803D9DD0 = {
    0,
    { 0 },
    0,
    0,
    { 320, -240, 415.6922 },
    { 0 },
    { 320, -240, 0 },
};

static u32 lbl_803D9E1C[] = {
    0x0140008C,
    0x015E0082,
    0x01400096,
    0x01400078,
    0x014000A0,
    0x017200A0,
    0x0140008C,
    0x016800EB,
    0x014000F0,
    0x014000C8,
    0x014000BE,
    0x01400096,
    0x014000AA,
    0x0140008C,
    0x014000B4,
    0x014000B4,
    0x014000A0,
    0x0140008C,
    0x014E008C,
    0x0140008C,
    0x014000A0,
    0x014000AA,
    0x01400096,
    0x014000F0,
    0x015400F0,
    0x013F00F0,
    0x013F00F0,
    0x013F00F0,
    0x014700F0,
    0x014000F0,
    0x014000F0,
    0x014000F0,
};

struct {
    int x0, x4, x8;
} lbl_803D9F0C = { -1, -1, -1 };
