#include "gm_1BA8.h"

#include "gm_1BA8.static.h"

#include "gm_unsplit.h"

#include "vi/vi1201v1.h"

#include <sysdolphin/baselib/controller.h>
#include <sysdolphin/baselib/gobjplink.h>
#include <sysdolphin/baselib/gobjproc.h>
#include <sysdolphin/baselib/memory.h>
#include <sysdolphin/baselib/random.h>
#include <melee/cm/camera.h>
#include <melee/db/db.h>
#include <melee/ft/ftbosslib.h>
#include <melee/ft/ftlib.h>
#include <melee/gm/gm_unsplit.h>
#include <melee/gm/gmcamera.h>
#include <melee/gm/gmmain_lib.h>
#include <melee/gm/gmresult.h>
#include <melee/gm/gmresultplayer.h>
#include <melee/gm/gmtou.h>
#include <melee/gm/gmvsmelee.h>
#include <melee/gm/types.h>
#include <melee/gr/ground.h>
#include <melee/if/ifstock.h>
#include <melee/it/items/itevyoshiegg.h>
#include <melee/lb/lbarchive.h>
#include <melee/lb/lbaudio_ax.h>
#include <melee/lb/lbbgflash.h>
#include <melee/lb/lbcardgame.h>
#include <melee/lb/lbcardnew.h>
#include <melee/lb/lbdvd.h>
#include <melee/lb/lbmthp.h>
#include <melee/lb/lbsnap.h>
#include <melee/lb/lbtime.h>
#include <melee/lb/types.h>
#include <melee/mn/mngallery.h>
#include <melee/mn/types.h>
#include <melee/pl/player.h>
#include <melee/pl/plbonuslib.h>
#include <melee/vi/types.h>
#include <melee/vi/vi0102.h>
#include <melee/vi/vi0401.h>
#include <melee/vi/vi0402.h>
#include <melee/vi/vi0501.h>
#include <melee/vi/vi0502.h>
#include <melee/vi/vi1101.h>
#include <melee/vi/vi1201v1.h>
#include <melee/vi/vi1201v2.h>

GameScene gm_803DF618_Scenes[] = {
    {
        0,
        3,
        0,
        gm_801BAA60,
        gm_801BAAD0,
        {
            GS_CSS,
            &gm_80497758,
            &gm_80497758,
        },
    },
    {
        1,
        3,
        0,
        gm_801BAD70,
        gm_801BB758,
        {
            GS_VS,
            &gm_804978A0,
            &gm_804979D8,
        },
    },
    { 0xFF },
};

extern u8 gm_804D68F8;
extern u8 gm_804D68F9;

void gm_801BA8FC(void)
{
    lbArchive_LoadSymbols("GmEvent.dat", &gm_804D6900,
                          "sqEventInitDataLevelTbl", 0);
}

void gm_801BA938(struct EventData* arg0, int lo, int hi, bool arg3)
{
    struct GameCache* temp_r7 = &lbDvd_8001822C()->game_cache;
    u64 mask;
    s8 char_id;
    int i;

    for (i = lo; i < hi; i++) {
        char_id = arg0->x4C[i];
        if (char_id != CHKIND_NONE) {
            temp_r7->entries[i].char_id = char_id;
            temp_r7->entries[i].color = arg0->x50[i];
            if (arg0->x45 != 0 && i > 0 && arg0->x4C[i] == 4) {
                temp_r7->entries[i].x5 = 0;
            }
        }
    }

    if (arg3 != 0) {
        temp_r7->stage_id = arg0->x48;
    }
    lbDvd_80018254();
    mask = 0;
    for (i = lo; i < hi; i++) {
        if (arg0->x4C[i] != CHKIND_NONE) {
            mask |= lbAudioAx_80026E84(arg0->x4C[i]);
        }
    }
    mask |= lbAudioAx_80026EBC(arg0->x48);
    lbAudioAx_80026F2C(0x1C);
    lbAudioAx_8002702C(0xC, mask);
    lbAudioAx_80027168();
}

void gm_801BAA60(GameScene* arg0)
{
    struct EventData* temp_r31 = &gmMainLib_804D3EE0->unk_530;
    CSSData* css = gm_801A427C(arg0);
    PAD_STACK(8);

    gm_801B06B0(css, 0xE, temp_r31->x2, 0, temp_r31->x3, temp_r31->x4, 0,
                temp_r31->x6);
    if (temp_r31->x44 == 1) {
        gm_801BA938(temp_r31, 1, 4, true);
    }
}

void gm_801BAAD0(GameScene* arg0)
{
    CSSData* temp_r3;
    struct EventData* temp_r31;

    temp_r31 = &gmMainLib_804D3EE0->unk_530;
    temp_r3 = gm_801A4284(arg0);
    if (temp_r3->pending_scene_change == 2) {
        gm_801A42F8(GM_MENU);
        return;
    }
    gm_801B0730(temp_r3, &temp_r31->x2, NULL, &temp_r31->x3, &temp_r31->x4,
                NULL);
    temp_r31->x8 = -1;
    temp_r31->x9 = -1;
    temp_r31->xA = -1;
}

typedef struct gm_801BAB40_src {
    /* 0x00 */ u8 c_kind;
    /* 0x01 */ u8 slot_type;
    /* 0x02 */ u8 stocks;
    /* 0x03 */ u8 color;
    /* 0x04 */ u8 x5;
    /* 0x05 */ u8 sub_color;
    /* 0x06 */ u8 team;
    /* 0x07 */ u8 xB;
    /* 0x08 */ u8 flags;
    /* 0x09 */ u8 xE;
    /* 0x0A */ u8 cpu_level;
    /* 0x0B */ u8 pad;
    /* 0x0C */ u16 x12;
    /* 0x0E */ u16 hp;
    /* 0x10 */ f32 x18;
    /* 0x14 */ f32 x1C;
    /* 0x18 */ f32 x20;
} gm_801BAB40_src;

struct gm_event_char_list {
    u8 c_kind[33];
};

void gm_801BAB40(PlayerInitData* arg0, int arg1)
{
    gm_801BAB40_src* src = (gm_801BAB40_src*) arg1;
    gm_8016795C(arg0);
    arg0->c_kind = src->c_kind;
    arg0->slot_type = src->slot_type;
    arg0->stocks = src->stocks;
    arg0->color = src->color;
    arg0->slot = 0;
    arg0->x5 = src->x5;
    arg0->sub_color = src->sub_color;
    arg0->handicap = 9;
    arg0->team = src->team;
    arg0->xA = 0x78;
    arg0->xB = src->xB;
    arg0->xC_b0 = 0;
    arg0->xC_b1 = (src->flags & 0x80) >> 7;
    arg0->xC_b2 = (src->flags & 0x40) >> 6;
    arg0->xC_b3 = (src->flags & 0x20) >> 5;
    arg0->xC_b4 = (src->flags & 0x10) >> 4;
    arg0->xC_b6 = (src->flags & 0x08) >> 3;
    arg0->xC_b7 = (src->flags & 0x04) >> 2;
    arg0->xD_b1 = 0;
    arg0->xD_b2 = 0;
    arg0->xD_b4 = 0;
    arg0->xE = src->xE;
    arg0->cpu_level = src->cpu_level;
    arg0->x10 = 0;
    arg0->x12 = src->x12;
    arg0->hp = src->hp;
    arg0->x18 = src->x18;
    arg0->x1C = src->x1C;
    arg0->x20 = src->x20;
}

s32 gm_801BAC9C(GameScene* arg0, s32 arg1)
{
    UNUSED u8 _[8];
    u8 chars[33];
    struct EventData* ev = &gmMainLib_804D3EE0->unk_530;
    StartMeleeData* data = gm_801A427C(arg0);
    s32 i;
    s32 found;
    s32 k;
    s32 count = 0;
    struct gm_event_char_list* src =
        (struct gm_event_char_list*) gm_804D6900[ev->unk_535][0]->x4;
    PAD_STACK(8);

    for (i = 0; i < 0x21; i++) {
        u8 c = src->c_kind[i];
        if ((s32) c == 0x21) {
            break;
        }
        {
            found = 0;
            for (k = 0; k < arg1; k++) {
                if (data->players[k].c_kind == (s8) c) {
                    found++;
                }
            }
            if (found == 0) {
                chars[count] = c;
                count++;
            }
        }
    }
    return chars[HSD_Randi(count)];
}

struct gm_evspawn {
    /* 0x0 */ s8 unk0;
    /* 0x1 */ u8 pad1[2];
    /* 0x3 */ u8 unk3;
};

struct gm_evx10 {
    u8 pad[0x10];
    struct gm_evspawn* unk10;
    struct gm_evspawn* unk14;
    struct gm_evspawn* unk18;
    struct gm_evspawn* unk1C;
    struct gm_evspawn* unk20;
};

struct gm_evstage {
    u8 pad[2];
    u16 stage;
};

struct gm_evinit {
    /* 0x00 */ u8 unk0;
    /* 0x01 */ u8 unk1;
    /* 0x02 */ u8 unk2;
    /* 0x03 */ s8 unk3;
    /* 0x04 */ s8 unk4;
    /* 0x05 */ u8 unk5;
    /* 0x06 */ u16 unk6;
    /* 0x08 */ u32 unk8;
    /* 0x0C */ u8 padC[4];
    /* 0x10 */ u32 x10;
    /* 0x14 */ s32 unk14;
    /* 0x18 */ s32 x18;
    /* 0x1C */ f32 x1C;
    /* 0x20 */ f32 unk20;
    /* 0x24 */ f32 unk24;
};

struct gm_evstage_list {
    u16 count;
    u16 stage[1];
};

struct gm_evspawn_table {
    u8 count;
    u8 pad[0xF];
    gm_801BAB40_src* entries[5];
};

struct gm_evbonus {
    /* 0x00 */ s8 c_kind;
    /* 0x01 */ u8 x1;
    /* 0x02 */ u8 x2;
    /* 0x03 */ u8 x3;
    /* 0x04 */ u8 x4;
    /* 0x05 */ u8 x5;
    /* 0x06 */ u8 color;
    /* 0x07 */ u8 pad7;
    /* 0x08 */ f32 x8;
    /* 0x0C */ f32 xC;
    /* 0x10 */ f32 x10;
    /* 0x14 */ u8 flags;
    /* 0x15 */ u8 x15;
    /* 0x16 */ u8 x16;
    /* 0x17 */ u8 x17;
};

struct gm_evlevel {
    /* 0x00 */ u8 kind;
    /* 0x01 */ u8 flags;
    /* 0x02 */ u8 pad2[2];
    /* 0x04 */ struct gm_804D6900_x4_t* x4;
    /* 0x08 */ StartMeleeRules* x8;
    /* 0x0C */ struct gm_evbonus* xC;
    /* 0x10 */ void* x10;
    /* 0x14 */ gm_801BAB40_src* player_init[5];
};

struct gm_random_history {
    u8 pad0[2];
    u8 character_usage[0x1A];
    u8 stage_usage[0x1D];
};

void gm_801BAD70(GameScene* arg0)
{
    struct EventData* ev = &gmMainLib_804D3EE0->unk_530;
    StartMeleeData* md = gm_801A427C(arg0);
    u8* r3b = (u8*) md;
    u8 level = ev->unk_535;
    gm_803DF94C_t** event_info = gm_803DF94C;
    struct gm_804D6900_t** levels;
    struct gm_804D6900_t** lvlpp;
    struct gm_evlevel* level_info;
    s32 player_idx;
    s32 player_init_off;
    s32 spawn_off;
    PAD_STACK(0x20);

    lbArchive_LoadSymbols("GmEvent.dat", &gm_804D6900,
                          "sqEventInitDataLevelTbl", 0);
    levels = gm_804D6900[0];
    gm_80167A64(&md->rules);
    lvlpp = &levels[level];
    level_info = (struct gm_evlevel*) *lvlpp;
    md->rules.x0_0 = (*lvlpp)->x8->x0_0;
    md->rules.x0_3 = (*lvlpp)->x8->x0_3;
    md->rules.x0_6 = (*lvlpp)->x8->x0_6;
    md->rules.x0_7 = (*lvlpp)->x8->x0_7;
