#include "gmresultplayer.h"

#include "gm_unsplit.h"

#include "cm/camera.h"

#include <sysdolphin/baselib/aobj.h>
#include <sysdolphin/baselib/controller.h>
#include <sysdolphin/baselib/dobj.h>
#include <sysdolphin/baselib/gobj.h>
#include <sysdolphin/baselib/gobjgxlink.h>
#include <sysdolphin/baselib/gobjobject.h>
#include <sysdolphin/baselib/jobj.h>
#include <sysdolphin/baselib/mobj.h>
#include <sysdolphin/baselib/mtx.h>
#include <sysdolphin/baselib/tobj.h>
#include <melee/ef/efasync.h>
#include <melee/ef/eflib.h>
#include <melee/ft/ftdemo.h>
#include <melee/gm/gmresult.h>
#include <melee/gm/gm_1601.h>
#include <melee/gm/gm_1A45.h>
#include <melee/gm/types.h>
#include <melee/gr/ground.h>
#include <melee/gr/stage.h>
#include <melee/if/ifcoget.h>
#include <melee/it/item.h>
#include <melee/lb/lb_00B0.h>
#include <melee/lb/lb_00F9.h>
#include <melee/lb/lbarchive.h>
#include <melee/lb/lbaudio_ax.h>
#include <melee/lb/lbbgflash.h>
#include <melee/mn/mnmain.h>
#include <melee/mp/mpcoll.h>
#include <melee/pl/player.h>
#include <melee/sc/types.h>
#include <sysdolphin/baselib/random.h>

extern ResultsData lbl_8046DBE8;

extern u8 lbl_8046E1B0[];

typedef struct {
    /* 0x00 */ u8 pad_00[0x20];
    /* 0x20 */ f32 x20[4];
} CharScaleEntry;

extern CharScaleEntry lbl_803D6A18[];
extern f32 lbl_803D7058[];

typedef struct {
    /* 0x00 */ u8 pad_00[0x74];
    /* 0x74 */ f32 x74;
    /* 0x78 */ f32 x78;
    /* 0x7C */ f32 x7C;
    /* 0x80 */ f32 x80;
    /* 0x84 */ f32 x84;
    /* 0x88 */ f32 x88;
    /* 0x8C */ f32 x8C;
    /* 0x90 */ f32 x90;
    /* 0x94 */ f32 x94;
    /* 0x98 */ f32 x98;
} ResultsPlayerConfig;

extern ResultsPlayerConfig lbl_803B7B68;

extern int lbl_8046E38C[4];

extern HSD_JObj* lbl_8046E39C[4];

typedef struct {
    u8 x0_0 : 1;
    u8 x0_1 : 1;
    u8 x0_2 : 1;
    u8 x0_3 : 1;
    u8 x0_4 : 2;
    u8 x0_6 : 2;
    u8 pad_01[0x2313];
} lbl_8046E3AC_t;

extern lbl_8046E3AC_t lbl_8046E3AC;

void gm_80177724(struct ResultsMatchInfo* arg0)
{
    memzero(arg0, sizeof(*arg0));
}

static inline void inline0(HSD_JObj* jobj, float f)
{
    HSD_ForeachAnim(jobj, JOBJ_TYPE, ALL_TYPE_MASK, HSD_AObjSetRate,
                    AOBJ_ARG_AF, 0.0);
    HSD_ForeachAnim(jobj, JOBJ_TYPE, ALL_TYPE_MASK, HSD_AObjSetCurrentFrame,
                    AOBJ_ARG_AF, f);
    HSD_JObjAnimAll(jobj);
}

void fn_80177748(void)
{
    MatchEnd* temp_r3;
    int i;
    CharacterKind ckind;
    int var_r24;

    ResultsData* data = &lbl_8046DBE8;

    temp_r3 = fn_80174274();

    for (i = 0; i < 4; i++) {
