#include "gmresultplayer.h"

#include "gm_unsplit.h"

#include "cm/camera.h"

#include <sysdolphin/baselib/aobj.h>
#include <sysdolphin/baselib/cobj.h>
#include <sysdolphin/baselib/controller.h>
#include <sysdolphin/baselib/displayfunc.h>
#include <sysdolphin/baselib/dobj.h>
#include <sysdolphin/baselib/gobj.h>
#include <sysdolphin/baselib/gobjgxlink.h>
#include <sysdolphin/baselib/gobjobject.h>
#include <sysdolphin/baselib/jobj.h>
#include <sysdolphin/baselib/mobj.h>
#include <sysdolphin/baselib/mtx.h>
#include <sysdolphin/baselib/tobj.h>
#include <melee/ef/efasync.h>
#include <melee/ef/eflib.h>
#include <melee/ft/ftdemo.h>
#include <melee/gm/gmresult.h>
#include <melee/gm/gm_1601.h>
#include <melee/gm/gm_1A45.h>
#include <melee/gm/types.h>
#include <melee/gr/ground.h>
#include <melee/gr/stage.h>
#include <melee/if/ifcoget.h>
#include <melee/it/item.h>
#include <melee/lb/lb_00B0.h>
#include <melee/lb/lb_00F9.h>
#include <melee/lb/lbarchive.h>
#include <melee/lb/lbaudio_ax.h>
#include <melee/lb/lbbgflash.h>
#include <melee/mn/mnmain.h>
#include <melee/mp/mpcoll.h>
#include <melee/pl/player.h>
#include <melee/sc/types.h>
#include <sysdolphin/baselib/random.h>

extern ResultsData lbl_8046DBE8;

typedef struct {
    /* 0x00 */ u8 pad_00[0x20];
    /* 0x20 */ f32 x20[4];
} CharScaleEntry;

extern CharScaleEntry lbl_803D6A18[];
extern f32 lbl_803D7058[];

typedef struct {
    /* 0x00 */ u8 pad_00[0x24];
    /* 0x24 */ f32 x24;
    /* 0x28 */ f32 x28;
    /* 0x2C */ f32 x2C;
    /* 0x30 */ f32 x30;
    /* 0x34 */ f32 x34;
    /* 0x38 */ f32 x38;
    /* 0x3C */ GObj_RenderFunc x3C;
    /* 0x40 */ GObj_RenderFunc x40;
    /* 0x44 */ GObj_RenderFunc x44;
    /* 0x48 */ GObj_RenderFunc x48;
    /* 0x4C */ f32 x4C;
    /* 0x50 */ f32 x50;
    /* 0x54 */ f32 x54;
    /* 0x58 */ f32 x58;
    /* 0x5C */ f32 x5C;
    /* 0x60 */ f32 x60;
    /* 0x64 */ GObj_RenderFunc x64;
    /* 0x68 */ GObj_RenderFunc x68;
    /* 0x6C */ GObj_RenderFunc x6C;
    /* 0x70 */ GObj_RenderFunc x70;
    /* 0x74 */ f32 x74;
    /* 0x78 */ f32 x78;
    /* 0x7C */ f32 x7C;
    /* 0x80 */ f32 x80;
    /* 0x84 */ f32 x84;
    /* 0x88 */ f32 x88;
    /* 0x8C */ f32 x8C;
    /* 0x90 */ f32 x90;
    /* 0x94 */ f32 x94;
    /* 0x98 */ f32 x98;
} ResultsPlayerConfig;

extern ResultsPlayerConfig lbl_803B7B68;
extern HSD_CObjDesc lbl_803D7910;
extern u8 lbl_803D6A08[];
extern s32 lbl_804DA3F0;
extern s32 lbl_804DA3F4;

extern int lbl_8046E38C[4];

extern HSD_JObj* lbl_8046E39C[4];

typedef struct {
    /* 0x00 */ u8 x0_0 : 4;
               u8 x0_4 : 2;
               u8 x0_6 : 2;
    /* 0x01 */ u8 player_flags[4];
    /* 0x05 */ u8 pad_05[0x09];
    /* 0x0E */ u8 variant[4];
    /* 0x12 */ u8 pad_12[0x02];
    /* 0x14 */ s32 char_kind[4];
    /* 0x24 */ u8 costume_override[4];
    /* 0x28 */ MatchEnd match_end;
    /* 0x22A4 */ u16 scissor_x[4];
    /* 0x22AC */ u16 scissor_y[4];
    /* 0x22B4 */ u16 dim_w1[4];
    /* 0x22BC */ u16 dim_w2[4];
    /* 0x22C4 */ u16 dim_h1[4];
    /* 0x22CC */ u16 dim_h2[4];
    /* 0x22D4 */ s16 score_tbl[4][4];
    /* 0x22F4 */ u8 pad_22F4[0x2314 - 0x22F4];
} lbl_8046E3AC_t;

extern lbl_8046E3AC_t lbl_8046E3AC;

typedef struct ResultsDisplayData {
    /* 0x000 */ u8 pad_000[0x104];
    /* 0x104 */ HSD_ImageDesc player_img1[4];
    /* 0x164 */ HSD_ImageDesc player_img2[4];
    /* 0x1C4 */ HSD_ImageDesc shared_img;
    /* 0x1DC */ HSD_GObj* gobjs[4];
    /* 0x1EC */ HSD_JObj* jobjs[4];
    /* 0x1FC */ lbl_8046E3AC_t state;
} ResultsDisplayData;

extern ResultsDisplayData lbl_8046E1B0;

void gm_80177724(struct ResultsMatchInfo* arg0)
{
    memzero(arg0, sizeof(*arg0));
}

static inline void inline0(HSD_JObj* jobj, float f)
{
    HSD_ForeachAnim(jobj, JOBJ_TYPE, ALL_TYPE_MASK, HSD_AObjSetRate,
                    AOBJ_ARG_AF, 0.0);
    HSD_ForeachAnim(jobj, JOBJ_TYPE, ALL_TYPE_MASK, HSD_AObjSetCurrentFrame,
                    AOBJ_ARG_AF, f);
    HSD_JObjAnimAll(jobj);
}

void fn_80177748(void)
{
    MatchEnd* temp_r3;
    int i;
    CharacterKind ckind;
    int var_r24;

    ResultsData* data = &lbl_8046DBE8;

    temp_r3 = fn_80174274();

    for (i = 0; i < 4; i++) {
        if (temp_r3->player_standings[i].slot_type != Gm_PKind_NA) {
            ckind = temp_r3->player_standings[i].character_kind;
            HSD_JObjClearFlagsAll(data->player_data[i].jobjs[0], JOBJ_HIDDEN);
            inline0(data->player_data[i].jobjs[0], gm_80168B34(ckind, 0, 0));
