#include "gmstaffroll.h"

#include "gm_unsplit.h"

#include "ef/efasync.h"
#include "ef/eflib.h"
#include "gm/gmmain_lib.h"
#include "if/textlib.h"
#include "lb/lb_00B0.h"
#include "lb/lb_00F9.h"
#include "lb/lbarchive.h"
#include "lb/lbaudio_ax.h"
#include "lb/lbbgflash.h"
#include "lb/lblanguage.h"
#include "sc/types.h"

#include <baselib/particle.h>
#include <math_ppc.h>
#include <sysdolphin/baselib/cobj.h>
#include <sysdolphin/baselib/controller.h>
#include <sysdolphin/baselib/debug.h>
#include <sysdolphin/baselib/sislib.h>
#include <sysdolphin/baselib/displayfunc.h>
#include <sysdolphin/baselib/dobj.h>
#include <sysdolphin/baselib/fog.h>
#include <sysdolphin/baselib/gobjgxlink.h>
#include <sysdolphin/baselib/gobjobject.h>
#include <sysdolphin/baselib/gobjplink.h>
#include <sysdolphin/baselib/gobjproc.h>
#include <sysdolphin/baselib/jobj.h>
#include <sysdolphin/baselib/lobj.h>
#include <sysdolphin/baselib/memory.h>
#include <sysdolphin/baselib/random.h>
#include <trigf.h>

#include "baselib/psappsrt.h"
#include "baselib/psstructs.h"

struct staffInfo_t {
    char pad_0[0x948];
};
STATIC_ASSERT(sizeof(struct staffInfo_t) == 0x948);

/* 4D67F8 */ static struct {
    HSD_Text* win[2];
    int x8;
}* staffInfo;

struct staffInfoSortBuf_t {
    char pad_0[0x2E68];
};
STATIC_ASSERT(sizeof(struct staffInfoSortBuf_t) == 0x2E68);

typedef struct {
    int index;
    HSD_JObj* jobj;
    Mtx mtx;
    s32 x38;
} SortBufEntry;

/* 4D67FC */ static SortBufEntry* staffInfoSortBuf;

struct gm_804D6804_t {
    /* +0 */ float x0;
    /* +4 */ float x4;
};

/* 4D6804 */ static struct gm_804D6804_t gm_804D6804;
/* 4D680C */ static HSD_Text* gm_804D680C;

/* 4D6810 */ static s32 gm_804D6810;
/* 4D6814 */ static s32 gm_804D6814;
/* 4D6818 */ static s32 gm_804D6818;
/* 4D681C */ static s32 gm_804D681C;
/* 4D6820 */ static s32 gm_804D6820;
/* 4D6824 */ static f32 gm_804D6824;
/* 4D6828 */ static f32 gm_804D6828;
/* 4D682C */ static HSD_JObj* gm_804D682C;
/* 4D6830 */ static HSD_CObj* gm_804D6830;
/* 4D6834 */ static HSD_CObj* gm_804D6834;
/* 4D6838 */ static HSD_Fog* gm_804D6838;
/* 4D683C */ static UNK_T gm_804D683C;
/* 4D6840 */ static SceneDesc* gm_804D6840;
/* 4D6844 */ static DynamicModelDesc** gm_804D6844;
/* 4D6848 */ static s32 gm_804D6848;
/* 4D684C */ static s32 gm_804D684C;

typedef struct {
    /* 0x00 */ u8 x0;
    /* 0x01 */ u8 pad_01[3];
    /* 0x04 */ int (*check)(s16);
    /* 0x08 */ s16 check_arg;
    /* 0x0A */ u8 pad_0A[2];
    /* 0x0C */ int alt_page;
    /* 0x10 */ u8 has_check;
    /* 0x11 */ u8 x11[2];
    /* 0x13 */ u8 pad_13;
} StaffEntryData;

/* 3DBFD8 */ static StaffEntryData gm_803DBFD8[198] = { 0 };
extern f32 gm_803DD1C8[0x13];
extern GXColor gm_804D42B8;
extern GXColor gm_804D42BC;
extern GXColor gm_804D42C0;
extern GXColor gm_804D42C4;
extern GXColor gm_804D42C8;
extern GXColor gm_804D42CC;
extern s32 gm_804DAAEC;

bool gm_801AA644(void)
{
    return gmMainLib_8015EDD4();
}

bool gm_801AA664(CharacterKind arg0)
{
    return gm_80164840(arg0);
}

bool gm_801AA688(void)
{
    PAD_STACK(4);
    return gm_80164840(CKIND_MARS) || gm_80164840(CKIND_EMBLEM);
}

void gm_801AA6D8(s16 arg0)
{
    un_803048C0(arg0);
}

bool gm_801AA6FC(void)
{
    PAD_STACK(4);
    return un_803048C0(0x10B) || un_803048C0(0x10A) || un_803048C0(0x109);
}

bool gm_801AA774(void)
{
    PAD_STACK(4);
    return un_803048C0(0x107) || un_803048C0(0x108);
}

void gm_801AA7C4_OnFrame(void)
{
    if (gm_804D6814 >= 0x134D) {
        lbAudioAx_80028B90();
        lbAudioAx_800236DC();
        gm_801A4B60();
