#include "gmtoulib.h"

#include "gm_1601.h"
#include "gm_unsplit.h"
#include "gmmain_lib.h"
#include "gmtoulib.h"

#include "gmtoulib.static.h"

#include "types.h"

#include <placeholder.h>

#include "baselib/fog.h"
#include "baselib/gobjgxlink.h"
#include "baselib/gobjobject.h"

#include "ft/forward.h"

#include "lb/lb_00F9.h"
#include "lb/lblanguage.h"
#include "mn/mnmain.h"
#include "mn/mnname.h"
#include "mn/mnstagesel.h"

#include "pl/forward.h"

#include "pl/player.h"
#include "sc/types.h"

#include <printf.h>
#include <dolphin/os.h>
#include <baselib/controller.h>
#include <baselib/dobj.h>
#include <baselib/fog.h>
#include <baselib/gobj.h>
#include <baselib/gobjgxlink.h>
#include <baselib/gobjobject.h>
#include <baselib/gobjplink.h>
#include <baselib/gobjproc.h>
#include <baselib/jobj.h>
#include <baselib/mobj.h>
#include <baselib/particle.h>
#include <baselib/random.h>
#include <baselib/sislib.h>

extern SceneDesc* lbl_804D666C;
extern SceneDesc* lbl_804D6670;
extern SceneDesc* lbl_804D6674;
extern u8 lbl_804D6680[8];
extern char* lbl_804DA6B4;
extern char* lbl_804DA6B8;
extern char* lbl_804DA6BC;
extern char* lbl_804DA6C0;
extern char* lbl_804DA6C8;
extern char* lbl_804DA6CC;
extern char* lbl_804DA6D0;
static s32 lbl_804D6630;
static s32 lbl_804D6634;
extern struct lbl_803B7C80_t {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    s32 unk10;
    s32 unk14;
    s32 unk18;
    s32 unk1C;
    s32 unk20;
    s32 unk24;
} lbl_803B7C80;
typedef struct CamDesc {
    s32 d[14];
} CamDesc;
extern CamDesc lbl_803B7CA8;

typedef struct BracketEntrySlot {
    /* 0x00 */ HSD_GObj* x2C;
    /* 0x04 */ u8 x30;
    /* 0x05 */ u8 pad31;
    /* 0x06 */ u8 x32;
    /* 0x07 */ u8 pad33;
    /* 0x08 */ s32 x34;
    /* 0x0C */ s32 x38;
    /* 0x10 */ s32 x3C;
    /* 0x14 */ s32 x40;
    /* 0x18 */ s32 x44;
    /* 0x1C */ s32 x48;
    /* 0x20 */ u8 x4C;
    /* 0x21 */ u8 x4D;
    /* 0x22 */ u8 x4E;
    /* 0x23 */ u8 x4F;
    /* 0x24 */ u8 x50;
    /* 0x25 */ u8 x51;
    /* 0x26 */ u8 x52;
    /* 0x27 */ u8 pad53;
    /* 0x28 */ u16 x54;
    /* 0x2A */ u8 pad56[0x2C - 0x2A];
} BracketEntrySlot;
STATIC_ASSERT(sizeof(BracketEntrySlot) == 0x2C);

static inline BracketEntrySlot* BracketEntry_GetSlot(BracketEntry* entry,
                                                     s32 slot_idx)
{
    return &((BracketEntrySlot*) &entry->x2C)[slot_idx];
}

void fn_8018A514(int count, float val)
{
    BracketEntry* entries = lbl_80473AB8;
    s32 region;
    BracketSrcEntry* src;
    int i;
    s32 n;

    if (count < 9) {
        region = 0;
    } else if (count >= 14) {
        region = 2;
    } else {
        region = 1;
    }

    src = ((BracketSrcEntry**) ((u8*) entries + 0x3700))[region];

    if (count < 9) {
        for (i = 0; i < count; i++) {
            src += lbl_803D9D20.x0[i + 0x20];
        }
    } else if (count < 14) {
        for (i = 9; i < count; i++) {
            src += lbl_803D9D20.x0[i + 0x20];
        }
    } else {
        for (i = 14; i < count; i++) {
            src += lbl_803D9D20.x0[i + 0x20];
