#include "ftCo_0A01.h"

#include "ftpickupitem.h"

#include <placeholder.h>
#include <platform.h>

#include "ft/chara/ftPopo/ftPp_1211.h"
#include "ft/fighter.h"
#include "ft/ft_0877.h"
#include "ft/ftcpuattack.h"
#include "ft/ftlib.h"
#include "ft/inlines.h"
#include "ft/types.h"

#include "ftCommon/forward.h"
#include "ftDonkey/forward.h"
#include "ftKoopa/forward.h"
#include "ftMewtwo/forward.h"
#include "ftPopo/forward.h"
#include "ftSamus/forward.h"

#include "gm/gm_unsplit.h"
#include "gr/grbigblue.h"
#include "gr/grcorneria.h"
#include "gr/grinishie1.h"
#include "gr/grlib.h"
#include "gr/ground.h"
#include "gr/grvenom.h"
#include "gr/stage.h"
#include "gr/types.h"
#include "it/inlines.h"
#include "it/item.h"
#include "it/types.h"
#include "lb/lb_00CE.h"
#include "lb/lbcollision.h"
#include "mp/mpisland.h"
#include "mp/mplib.h"
#include "mp/types.h"
#include "pl/player.h"

#include <math.h>
#include <math_ppc.h>
#include <dolphin/mtx.h>
#include <melee/ft/ftcmdscript.h>
#include <MetroTRK/intrinsics.h>

/**
 * Priority table, mapping ItemKind to priority number,
 * for which items the CPU should prefer to target.
 * Higher numbers are preferred.
 */
int ftCo_803C5A68[] = {
    1, 0, 0, 1, 0, 0, 0, 1, 7, 6, 5, 4, 4, 3, 1, 1, 2, 1,
    5, 2, 2, 2, 3, 3, 3, 4, 0, 0, 8, 4, 1, 4, 4, 5, 5,
};

typedef struct ftCo_803C6594_t {
    /* 00 */ Vec3 x0;
    /* 0C */ f32 xC;
    /* 10 */ f32 x10;
    /* 14 */ f32 x14;
    /* 18 */ f32 x18;
    /* 1C */ f32 x1C;
    /* 20 */ f32 x20;
    /* 24 */ f32 x24;
    /* 28 */ f32 x28;
    /* 2C */ f32 x2C;
    /* 30 */ f32 x30;
    /* 34 */ f32 x34;
    /* 38 */ f32 x38;
    /* 3C */ f32 x3C;
    /* 40 */ f32 x40;
    /* 44 */ u8 x44;
    /* 48 */ f32 x48;
    /* 4C */ f32 x4C;
    /* 50 */ struct ftCo_803C6594_t* next;
} ftCo_803C6594_t;

/* static */ extern ftCo_803C6594_t* ftCo_803C6594[];
/* 0A2638 */ static void ftCo_800B1DA0(Fighter* fp);

void ftCo_800A0148(Fighter* fp)
{
    struct Fighter_x1A88_t* x1A88 = &fp->x1A88;

    if (fp->cur_pos.y + x1A88->x558 > Stage_GetBlastZoneTopOffset()) {
        ftCo_800B46B8(fp, CpuCmd_SetLstickX, 0);
        ftCo_800B46B8(fp, CpuCmd_SetLstickY, 0);
        ftCo_800B463C(fp, CpuCmd_Done);
    } else if (ftCo_800A1CA8(fp)) {
        ftCo_800B46B8(fp, CpuCmd_SetLstickX, 0);
        ftCo_800B46B8(fp, CpuCmd_SetLstickY, 0);
        ftCo_800B46B8(fp, CpuCmd_WaitFor, 10);
        ftCo_800B463C(fp, CpuCmd_ReleaseY);
        ftCo_800B46B8(fp, CpuCmd_WaitFor, 1);
        ftCo_800B463C(fp, CpuCmd_PressY);
        ftCo_800B46B8(fp, CpuCmd_WaitFor, 10);
        ftCo_800B463C(fp, CpuCmd_ReleaseY);
        ftCo_800B46B8(fp, CpuCmd_WaitFor, 1);
        ftCo_800B463C(fp, CpuCmd_Done);
