#include "tydisplay.h"

#include "gm/gm_1A3F.h"
#include "gm/gm_1A45.h"
#include "if/textdraw.h"
#include "if/textlib.h"
#include "lb/lblanguage.h"
#include "ty/toy.h"
#include "ty/tyfigupon.h"
#include "ty/tylist.h"
#include "ty/types.h"

#include <placeholder.h>

#include <MSL/math_ppc.h>
#include <MSL/trigf.h>

#include <baselib/archive.h>
#include <baselib/cobj.h>
#include <baselib/debug.h>
#include <baselib/fog.h>
#include <baselib/gobj.h>
#include <baselib/gobjgxlink.h>
#include <baselib/gobjobject.h>
#include <baselib/gobjplink.h>
#include <baselib/gobjproc.h>
#include <baselib/jobj.h>
#include <baselib/lobj.h>
#include <baselib/memory.h>
#include <baselib/random.h>

#include <dolphin/os.h>

#include "lb/lb_00B0.h"
#include "lb/lb_00CE.h"
#include "lb/lb_00F9.h"
#include "lb/lbaudio_ax.h"
#include "lb/lbarchive.h"
#include "lb/lbvector.h"

#include "mn/mnmain.h"

#include "db/db.h"

extern char un_804D5AC0[2];
extern DevText* un_804D6F24;
extern s32 un_804A2DE8[];
extern char un_804A2D98[0x38];

typedef struct TyDspBgData {
    /* 0x00 */ HSD_GObj* gobj0;
    /* 0x04 */ HSD_GObj* gobj4;
    /* 0x08 */ u8 pad8[4];
    /* 0x0C */ HSD_JObj* jobj;
    /* 0x10 */ u8 pad10[0x3C];
    /* 0x4C */ HSD_Archive* archive;
} TyDspBgData;

extern TyDspBgData* un_804D6F1C;
extern s32 un_804D6F20;
extern HSD_GObj** un_804D6F18;
extern HSD_GObj* un_804D6F2C;
extern s32 un_804D6F28;
extern u8 un_804A2DD0[0x18];

typedef struct TyDspArchNames {
    const char* entries[43];
} TyDspArchNames;

typedef struct TyDspNameTables {
    const char* jobj_names[43];
    const char* matanim_names[43];
    TyDspArchNames arch_names;
    s32 terminator;
} TyDspNameTables;

extern const TyDspNameTables un_803B8988;
extern const TyDspArchNames un_803B8A34;

typedef struct TyDspEntry {
    /* 0x00 */ s32 x00;
    /* 0x04 */ u8 x04;
    /* 0x05 */ u8 x05;
    /* 0x06 */ u8 pad_06[2];
    /* 0x08 */ f32 x08;
    /* 0x0C */ f32 x0C;
} TyDspEntry;

typedef struct TyDspSceneGfx {
    /* 0x00 */ HSD_GObj* x00;
    /* 0x04 */ HSD_GObj* x04;
    /* 0x08 */ HSD_GObj* x08;
} TyDspSceneGfx;

typedef struct TyDspPos {
    /* 0x00 */ f32 x;
    /* 0x04 */ f32 z;
} TyDspPos;

typedef struct TyDspGrid {
    /* 0x000 */ s32 x00;
    /* 0x004 */ f32 x04;
    /* 0x008 */ f32 x08;
    /* 0x00C */ f32 x0C;
    /* 0x010 */ f32 x10;
    /* 0x014 */ TySortElemI sort[301];
    /* 0x97C */ TyDspPos pos[301];
} TyDspGrid;

/// #un_803181BC

void un_803182D4_OnFrame(void)
{
    TyModeState* state = (TyModeState*) un_804A284C;

    if (state->x4 != 0) {
        un_803181BC();
        gm_801A4B60();
    }
}

void un_8031830C(TySortElem* base, s32 lo, s32 hi)
{
    TySortElem tmp;
    PAD_STACK(8);

    if (lo < hi) {
        s32 mid = (lo + hi) / 2;
        s32 pivot, i;
        TySortElem* p;
        TySortElem* q;

        if (lo != mid) {
            p = &base[lo];
            q = &base[mid];
            tmp = *p;
            *p = *q;
            *q = tmp;
        }

        i = lo + 1;
        pivot = lo;
        p = &base[lo];
        for (q = &base[i]; i <= hi; i++, q++) {
            if (q->val < p->val) {
                pivot += 1;
                if (pivot != i) {
                    TySortElem* s = &base[pivot];
                    tmp = *s;
                    *s = *q;
                    *q = tmp;
                }
            }
        }

