#include "tydisplay.h"

#include "math.h"
#include "math_ppc.h" // IWYU pragma: keep
#include "placeholder.h"
#include "platform.h"
#include "stddef.h"
#include "toy.h"
#include "trigf.h" // IWYU pragma: keep

#include <placeholder.h>
#include <platform.h>

#include "baselib/archive.h"
#include "baselib/cobj.h"
#include "baselib/debug.h"
#include "baselib/dobj.h"
#include "baselib/fog.h"
#include "baselib/gobj.h"
#include "baselib/gobjgxlink.h"
#include "baselib/gobjobject.h"
#include "baselib/gobjplink.h"
#include "baselib/gobjproc.h"
#include "baselib/jobj.h"
#include "baselib/lobj.h"
#include "baselib/memory.h"
#include "baselib/mobj.h"
#include "baselib/random.h"
#include "baselib/tobj.h"
#include "baselib/wobj.h"
#include "db/db.h"
#include "dolphin/gx.h"
#include "dolphin/mtx.h"
#include "dolphin/os.h"
#include "gm/gm_1A45.h"
#include "if/textdraw.h"
#include "if/textlib.h"
#include "if/types.h"
#include "lb/lb_00B0.h"
#include "lb/lb_00CE.h"
#include "lb/lbarchive.h"
#include "lb/lbaudio_ax.h"
#include "lb/lblanguage.h"
#include "lb/lbspdisplay.h"
#include "lb/lbvector.h"
#include "melee/if/textlib.h"
#include "mn/mnmain.h"
#include "MSL/math.h"
#include "MSL/math_ppc.h"
#include "sc/types.h"
#include "ty/toy.h"
#include "ty/types.h"

/* 31830C */ static void _tyDisplay_8031830C(TySortElem*, s32, s32);
/* 318714 */ static void _tyDisplay_80318714(TySortElem*, s32, s32);
/* 318B1C */ static void _tyDisplay_80318B1C(s32 arg0);
/* 318CB4 */ static void _tyDisplay_80318CB4(s32);
/* 319540 */ static void _tyDisplay_80319540(s32);
/* 319994 */ static void _tyDisplay_80319994(s32);
/* 319EF0 */ static void _tyDisplay_80319EF0(void);
/* 31A4EC */ static void _tyDisplay_8031A4EC(HSD_GObj*);
/* 31A94C */ static void _tyDisplay_8031A94C(HSD_GObj*);
/* 31B1FC */ static void _tyDisplay_8031B1FC(void);
/* 31B328 */ static void _tyDisplay_8031B328(void);
/* 31B850 */ static void _tyDisplay_8031B850(void);
/* 31BA78 */ static void _tyDisplay_8031BA78(s32, s32, f32);
/* 31BBF4 */ static s32 _tyDisplay_8031BBF4(s8);
/* 31BC54 */ static HSD_GObj* _tyDisplay_8031BC54(s32);
/* 31BF34 */ static void _tyDisplay_8031BF34(s32 arg0);
/* 31C1D0 */ static void _tyDisplay_8031C1D0(void);
/* 4A2D98 */ static char _tyDisplay_devtext_buf[9 * (3 * 2)];
/* 4A2DD0 */ static TyDspArchiveHolder _tyDisplay_804A2DD0;
/* 4A2DE8 */ static HSD_Archive*
    _tyDisplay_804A2DE8[0xB0 / sizeof(HSD_Archive*)];
/* 4D6F10 */ static HSD_JObj** _tyDisplay_804D6F10;
/* 4D6F14 */ static TyDspGrid* _tyDisplay_804D6F14;
/* 4D6F18 */ static TyDspConfig* _tyDisplay_804D6F18;
/* 4D6F1C */ static TyDspBgData* _tyDisplay_804D6F1C;
/* 4D6F20 */ static s32 _tyDisplay_804D6F20;
/* 4D6F24 */ static DevText* _tyDisplay_804D6F24;
/* 4D6F28 */ static s32 _tyDisplay_804D6F28;
/* 4D6F2C */ static HSD_GObj* _tyDisplay_804D6F2C;

STATIC_ASSERT(sizeof(_tyDisplay_devtext_buf) == 0x36);
STATIC_ASSERT(sizeof(_tyDisplay_804A2DD0) == 0x18);

/// @todo .data order hack
static void order_data_0(void)
{
    /*  +0 */ (void) "ToyDspPanel_Top_joint";
    /* +18 */ (void) "ToyDspBg_Top_joint";
}

/// @todo Not de-duplicated in #tyDisplay_8031BB34, therefore not a literal?
static char _tyDisplay_803FF01C[] = "ToyDspStand_Top_joint";

/// @todo .data order hack
static void order_data_44(void)
{
    /* +44 */ (void) "ScMenDisplay_fog";
}

static inline void quicksort(TySortElem* base, s32 lo, s32 hi)
{
    TySortElem tmp;
    PAD_STACK(16);

    if (lo < hi) {
        s32 mid = (lo + hi) / 2;
        s32 pivot, i;

        if (lo != mid) {
            tmp = base[lo];
            base[lo] = base[mid];
            base[mid] = tmp;
        }

        pivot = lo;
        for (i = lo + 1; i <= hi; i++) {
            if (base[i].val < base[lo].val) {
                pivot++;
