#include "tyfigupon.h"

#include "inlines.h"
#include "math.h"
#include "toy.h"
#include "tylist.h"
#include "types.h"

#include "gm/gm_1601.h"
#include "if/textlib.h"
#include "if/types.h"
#include "lb/lb_00B0.h"
#include "lb/lb_00F9.h"
#include "lb/lbarchive.h"
#include "lb/lbaudio_ax.h"
#include "lb/lbcardgame.h"
#include "lb/lblanguage.h"
#include "lb/lbvector.h"
#include "mn/mnmain.h"

#include <dolphin/mtx.h>
#include <dolphin/os.h>
#include <baselib/archive.h>
#include <baselib/cobj.h>
#include <baselib/controller.h>
#include <baselib/displayfunc.h>
#include <baselib/dobj.h>
#include <baselib/fog.h>
#include <baselib/gobj.h>
#include <baselib/gobjgxlink.h>
#include <baselib/gobjobject.h>
#include <baselib/gobjplink.h>
#include <baselib/gobjproc.h>
#include <baselib/gobjuserdata.h>
#include <baselib/jobj.h>
#include <baselib/lobj.h>
#include <baselib/memory.h>
#include <baselib/mobj.h>
#include <baselib/random.h>
#include <baselib/sislib.h>
#include <baselib/tobj.h>

typedef struct {
    /* 0x00 */ HSD_GObj* x0;
    /* 0x04 */ HSD_GObj* x4;
    /* 0x08 */ HSD_GObj* x8;
    /* 0x0C */ u8 pad_0C[0x4];
    /* 0x10 */ s32 x10;
    /* 0x14 */ HSD_Text* x14;
    /* 0x18 */ HSD_Text* x18;
    /* 0x1C */ u8 pad_1C[0x4];
    /* 0x20 */ s32 x20;
    /* 0x24 */ s32 x24;
    /* 0x28 */ u8 x28;
    /* 0x29 */ u8 x29;
} TyFiguponData;

extern TyFiguponData* un_804D6EF0;
extern HSD_CObjDesc* un_804D6F04;
extern void* un_804D6F08;
extern s32 un_804D6EFC;
extern s32 un_804D6F00;
extern char un_803FE5E8[];
extern void* un_804D6EF8;

/* .data string literals for tyfigupon.c */
static char str_panel_joint[] = "ToyFigurePonPanel_Top_joint";
static char str_bg_joint[] = "ToyFigurePonBg_Top_joint";
static char str_archive_jp[] = "TyMnFigp.dat";
static char str_archive_us[] = "TyMnFigp.usd";
static char str_coin_joint[] = "ToyFigurePonCoin_Top_joint";
static char str_coin_animjoint[] = "ToyFigurePonCoin_Top_animjoint";
static char str_coin_matanim[] = "ToyFigurePonCoin_Top_matanim_joint";
static char str_coin_shapeanim[] = "ToyFigurePonCoin_Top_shapeanim_joint";
static char str_file[] = "tyfigupon.c";
static u16 str_jobj_indices[] = {
    0x4, 0x2, 0x3, 0x5, 0x6, 0x7, 0x8, 0x9, 0xD, 0xA, 0xB, 0xC, 0xE,
};
static char str_err_bg[] = "*** BG data aren't being loaded!\n";
static char str_panel_smash_matanim[] =
    "ToyFigurePonPanel_zsmash_matanim_joint";
static char str_bg_animjoint[] = "ToyFigurePonBg_Top_animjoint";
static char str_bg_matanim[] = "ToyFigurePonBg_Top_matanim_joint";
static char str_bg_shapeanim[] = "ToyFigurePonBg_Top_shapeanim_joint";
static char str_nm_joint[] = "ToyFigurePonNm_Top_joint";
static char str_nm_animjoint[] = "ToyFigurePonNm_Top_animjoint";
static char str_nm_matanim[] = "ToyFigurePonNm_Top_matanim_joint";
static char str_nm_shapeanim[] = "ToyFigurePonNm_Top_shapeanim_joint";
static char str_bet_joint[] = "ToyFigurePonBet_Top_joint";
static char str_bet_animjoint[] = "ToyFigurePonBet_Top_animjoint";
static char str_bet_matanim[] = "ToyFigurePonBet_Top_matanim_joint";
static char str_bet_shapeanim[] = "ToyFigurePonBet_Top_shapeanim_joint";
static char str_panel_arrow_matanim[] =
    "ToyFigurePonPanel_zarrow_matanim_joint";
static char str_lever_joint[] = "ToyFigurePonLever_Top_joint";
static char str_lever_animjoint[] = "ToyFigurePonLever_Top_animjoint";
static char str_lever_matanim[] = "ToyFigurePonLever_Top_matanim_joint";
static char str_lever_shapeanim[] = "ToyFigurePonLever_Top_shapeanim_joint";
static char str_par_joint[] = "ToyFigurePonPar_Top_joint";
static char str_par_animjoint[] = "ToyFigurePonPar_Top_animjoint";
static char str_par_matanim[] = "ToyFigurePonPar_Top_matanim_joint";
static char str_par_shapeanim[] = "ToyFigurePonPar_Top_shapeanim_joint";
static char str_err_panel[] = "*** Can not Load Panel Label(%s)\n";
static char str_scene_lights[] = "ScMenFigure_scene_lights";
static char str_sdtoy_jp[] = "SdToy.dat";
static char str_sdtoy_data_jp[] = "SIS_ToyData";
static char str_sdtoy_us[] = "SdToy.usd";
static char str_sdtoy_data_us[] = "SIS_ToyData_E";
static char str_nget_joint[] = "ToyFigurePonNget_Top_joint";
static char str_nget_animjoint[] = "ToyFigurePonNget_Top_animjoint";
static char str_nget_matanim[] = "ToyFigurePonNget_Top_matanim_joint";
static char str_nget_shapeanim[] = "ToyFigurePonNget_Top_shapeanim_joint";

static HSD_CameraDescPerspective tyfigupon_cam_desc = {
    NULL,
    0,
    1,
    { 0, 640, 0, 480 },
    { 0, 640, 0, 480 },
    NULL,
    NULL,
    0.0f,
    NULL,
    0.1f,
    32768.0f,
    40.0f,
    1.2173333f,
};

typedef struct {
    u8 pad[0x4D];
    u8 x4D;
} TyFiguponInner;

typedef struct {
    /* 0x00 */ u32 x0;
    /* 0x04 */ u32 x4;
    /* 0x08 */ s32 x8;
    /* 0x0C */ u8 pad_0C[0x4];
    /* 0x10 */ s32 x10;
    /* 0x14 */ s32 x14;
    /* 0x18 */ s32 x18;
    /* 0x1C */ u8 pad_1C[0xC];
    /* 0x28 */ s32 x28;
    /* 0x2C */ s32 x2C;
    /* 0x30 */ s32 x30;
    /* 0x34 */ u8 pad_34[0x10];
    /* 0x44 */ f32 x44;
    /* 0x48 */ u8 pad_48[0x10];
} TyFiguponUD;

typedef struct {
    /* 0x00 */ u32 x0;
    /* 0x04 */ u32 x4;
    /* 0x08 */ u8 pad_08[0x4];
    /* 0x0C */ u32 xC;
} TyFiguponED4;

void tyFigupon_80314AA8(HSD_JObj* jobj, char* anim_str, char* matanim_str,
                        char* shapeanim_str)
{
    HSD_AnimJoint* ajoint;
    HSD_MatAnimJoint* majoint;
    HSD_ShapeAnimJoint* sajoint;
    struct un_804D6EF4_t* data = un_804D6EF4;
    PAD_STACK(16);

    if (anim_str != NULL) {
        ajoint = HSD_ArchiveGetPublicAddress(data->archive, anim_str);
    } else {
        ajoint = NULL;
    }
    if (matanim_str != NULL) {
        majoint = HSD_ArchiveGetPublicAddress(data->archive, matanim_str);
    } else {
        majoint = NULL;
    }
    if (shapeanim_str != NULL) {
        sajoint = HSD_ArchiveGetPublicAddress(data->archive, shapeanim_str);
    } else {
        sajoint = NULL;
    }
    HSD_JObjAddAnimAll(jobj, ajoint, majoint, sajoint);
    HSD_JObjReqAnimAll(jobj, 0.0f);
}

#pragma dont_inline on
s32 un_80314B54(void)
{
    s32 i;
    s32 count = 0;

    for (i = 0; i < 0x125; i++) {
