#include "debugconsole_main.h"

#include <dolphin/pad.h>
#include <dolphin/vi.h>
#include <sysdolphin/baselib/cobj.h>
#include <sysdolphin/baselib/gobj.h>
#include <sysdolphin/baselib/gobjgxlink.h>
#include <sysdolphin/baselib/gobjobject.h>
#include <sysdolphin/baselib/hsd_3915.h>
#include <sysdolphin/baselib/hsd_3933.h>
#include <sysdolphin/baselib/video.h>
#include <MetroTRK/ppc_reg.h>

typedef struct _ExcptNode {
    /* 0x1 */ struct _ExcptNode* next;
    /* 0x4 */ void (*callback)(struct _ExcptNode*);
} ExcptNode;

typedef struct PSNode {
    /* 0x00 */ struct PSNode* child;
    /* 0x04 */ u8 _pad[4];
    /* 0x08 */ void (*callback)(struct PSNode*);
} PSNode;

/// @todo misnomer - moved from particle file, not particle-related
struct ParticleScreenState {
    /* 0x00 */ u8 x0_b7 : 1;
    /* 0x00 */ u8 x0_b6 : 1;
    /* 0x00 */ u8 x0_b5 : 1;
    /* 0x00 */ u8 x0_rest : 5;
    /* 0x01 */ u8 _pad0[0x3];
    /* 0x04 */ s32 x4;
    /* 0x08 */ s32 x8;
    /* 0x0C */ s32 x0C;
    /* 0x10 */ s32 x10;
    /* 0x14 */ s32 x14;
    /* 0x18 */ s32 x18;
    /* 0x1C */ s32 x1C;
    /* 0x20 */ s32 x20;
    /* 0x24 */ s32 x24;
    /* 0x28 */ u32 x28;
    /* 0x2C */ s32 x2C;
    /* 0x30 */ void* x30;
    /* 0x34 */ s32 x34;
    /* 0x38 */ s32 x38;
    /* 0x3C */ s32 x3C;
    /* 0x40 */ s32 x40;
    /* 0x44 */ s32 x44;
    /* 0x48 */ s32 x48;
    /* 0x4C */ void* x4C;
    /* 0x50 */ void* x50;
    /* 0x54 */ u8 _pad4[0x68];
    /* 0xBC */ u32 xBC;
    /* 0xC0 */ u32 xC0;
    /* 0xC4 */ s32 xC4;
    /* 0xC8 */ s32 xC8;
    /* 0xCC */ s32 xCC;
    /* 0xD0 */ void* xD0;
    /* 0xD4 */ OSContext* xD4;
};

extern u8 lbl_804088B8[];
extern u8 lbl_8040AB00[];
/* 4D78C8 */ extern int hsd_804D78C8;
/* 4D78CC */ extern u32 hsd_804D78CC;

/* 4CF810 */ static struct ParticleScreenState hsd_804CF810;

typedef struct _EventData {
    /* 0x00 */ u8 _pad[0x10];
    /* 0x10 */ char** entries;
    /* 0x14 */ s32 index;
} EventData;

typedef struct _ParticleFontData {
    /* 0x0000 */ u8 _pad0[0x700];
    /* 0x0700 */ u8 x700[0x38];
    /* 0x0738 */ u8 _pad738[0x230];
    /* 0x0968 */ u8 x968[0x38];
    /* 0x09A0 */ u8 _pad9A0[0x38];
    /* 0x09D8 */ u8 x9D8[0x38];
    /* 0x0A10 */ u8 _padA10[0x1110];
    /* 0x1B20 */ u8 x1B20[0x38];
} ParticleFontData;

typedef struct _DispData {
    /* 0x00 */ u8 _pad[0x10];
    /* 0x10 */ s32 x10;
    /* 0x14 */ s32 x14;
} DispData;

typedef union {
    f32 f;
    u8 bytes[4];
} ParticleFloatBytes;

struct ParticleScreenBuffer {
    u8 data[1];
};

extern u8 lbl_8040AB40[];

void hsd_80394314(void)
{
    struct ParticleScreenState* sp = &hsd_804CF810;

    memset(sp, 0, sizeof(*sp));
    hsd_803941E8(&((struct ParticleScreenState*) sp)->x24,
                 &((struct ParticleScreenState*) sp)->x2C);

    {
        s32 mode;
        if (((struct ParticleScreenState*) sp)->x28 != 0) {
            mode = 2;
        } else {
            mode = 1;
        }
        ((struct ParticleScreenState*) sp)->x38 = mode;
    }

    ((struct ParticleScreenState*) sp)->x34 = 0;
    ((struct ParticleScreenState*) sp)->x30 = &HSD_VIData;
    ((struct ParticleScreenState*) sp)->x3C =
        ((u16*) ((struct ParticleScreenState*) sp)->x30)[2];
    ((struct ParticleScreenState*) sp)->x40 =
        ((u16*) ((struct ParticleScreenState*) sp)->x30)[4];
    ((struct ParticleScreenState*) sp)->x44 =
        (((u16) ((struct ParticleScreenState*) sp)->x3C + 15) * 2) & 0x1FFE0;
    ((struct ParticleScreenState*) sp)->x48 =
        ((struct ParticleScreenState*) sp)->x44 *
        ((struct ParticleScreenState*) sp)->x40;
    ((struct ParticleScreenState*) sp)->x4 = 0;
    ((struct ParticleScreenState*) sp)->x8 =
        ((struct ParticleScreenState*) sp)->x40;
    ((struct ParticleScreenState*) sp)->x18 = 0;
    ((struct ParticleScreenState*) sp)->x14 = 0;
    ((struct ParticleScreenState*) sp)->x20 =
        (u32) (((struct ParticleScreenState*) sp)->x3C - 0x28) / 11;
    ((struct ParticleScreenState*) sp)->x1C =
        (u32) (((struct ParticleScreenState*) sp)->x40 - 0x50) / 14;
    ((struct ParticleScreenState*) sp)->x4C = lbl_804088B8;
    ((struct ParticleScreenState*) sp)->x50 = 0;
    ((struct ParticleScreenState*) sp)->xC4 = 0;
}

// @TODO: Currently 94.99% match - obj file has extra addi for lis/addi
/// pair resolution; linked code matches 100%
void hsd_80394434(void* text)
{
    struct ParticleScreenState* sp = &hsd_804CF810;
    s32* x4_ptr = (s32*) sp + 1;
    s32 x = sp->x4;
    s32 y = sp->x8;
    s32 mode = sp->x0_b7;
    s32 interlace = sp->x0_b6;
    u8* font = (u8*) sp->x4C;
    s8* ptr = text;

    while (*ptr != 0) {
        switch (*ptr) {
        case '\r':
            break;
        case '\n':
            x = *x4_ptr;
            y += 14;
            /* fallthrough */
        default:
            if (mode != 0) {
                hsd_803922FC(font + (*ptr & 0x7F) * 0x38, x, y, interlace,
                             (&sp->x24)[sp->x34], sp->x3C, sp->x40, sp->x44,
                             sp->x50);
            } else {
                hsd_803921B8(font + (*ptr & 0x7F) * 0x38, x, y,
                             (&sp->x24)[sp->x34], sp->x3C, sp->x40, sp->x44,
                             sp->x50);
            }
            x += 11;
            break;
        }
        ptr++;
    }
}

// @TODO: Currently 91.32% match - needs register allocation fix
void hsd_80394544(s32 col, s32 row, u32 num_cols, u32 num_rows, s32 x, s32 y,
                  s32 xfb_buf, s32 xfb_w, s32 xfb_h, s32 xfb_stride,
                  s32 font_data, void* color_data)
{
    s32 cur_x;
    s32 interlace;
    u32 r;
    u32 c;
    s32 mode;
    u8 ch;

    mode = hsd_804CF810.x0_b7;
    interlace = hsd_804CF810.x0_b6;
    r = 0;

    while (r < num_rows) {
        hsd_80393E68(col, row);
        y -= 14;

        for (cur_x = x + (c = 0) * 11; c < num_cols; c++) {
            ch = hsd_80394068();
            if (ch == 0) {
                break;
            }
            if (mode != 0) {
                hsd_803922FC((void*) (font_data + (ch & 0x7F) * 0x38), cur_x,
                             y, interlace, xfb_buf, xfb_w, xfb_stride, xfb_h,
                             color_data);
            } else {
                hsd_803921B8((void*) (font_data + (ch & 0x7F) * 0x38), cur_x,
                             y, xfb_buf, xfb_w, xfb_stride, xfb_h, color_data);
            }
            cur_x += 11;
        }
        row++;
        r++;
    }
}

#pragma push
#pragma global_optimizer off
void hsd_80394668(void)
{
    struct ParticleScreenState* sp = &hsd_804CF810;
    s32 pos;
    PAD_STACK(24);

    {
        s32* dst_base;
        struct ParticleScreenBuffer* dst;
        u32 size;
        struct ParticleScreenBuffer* src;

        src = (struct ParticleScreenBuffer*) sp->x2C;
        if ((u32) src != 0) {
            /* Copy XFB data with brightness adjustment */
            dst_base = (s32*) sp + sp->x34;
            dst = (struct ParticleScreenBuffer*) dst_base[9];
            size = sp->x48;

            for (pos = 0; pos < size; pos += 2) {
                u8* s1 = src->data + pos;
                u8* d1 = dst->data + pos;
                d1[0] = (u8) (((s1[0] - 0x10) & 0xFFFFFF) + 0x10);
                d1[1] = s1[1];
            }
        } else {
            /* Draw console text to framebuffer */
            void* saved_color;
            s32 cur_x;
            s32 y_off;
            void** x50_ptr;
            s32* x40_ptr;
            s32* x8_ptr;
            s32* x4_ptr;
            s32 row;
            s32 col;

            x50_ptr = &sp->x50;
            saved_color = *x50_ptr;
            *x50_ptr = lbl_8040AB40;
            x4_ptr = &sp->x4;
            x40_ptr = &sp->x40;
            x8_ptr = &sp->x8;
            row = 0;

            while (row <= sp->x1C) {
                y_off = (row + 1) * 14;
                col = 0;
                cur_x = 0x14;

                while (col < sp->x20) {
                    *x4_ptr = cur_x;
                    *x8_ptr = (*x40_ptr - 0x28) - y_off;
                    {
                        s32 interlace = sp->x0_b6;
                        if (sp->x0_b7 != 0) {
                            hsd_803922FC(((ParticleFontData*) sp->x4C)->x700,
                                         *x4_ptr, *x8_ptr, interlace,
                                         (&sp->x24)[sp->x34], sp->x3C,
                                         *x40_ptr, sp->x44, *x50_ptr);
                        } else {
                            hsd_803921B8(((ParticleFontData*) sp->x4C)->x700,
                                         *x4_ptr, *x8_ptr, (&sp->x24)[sp->x34],
                                         sp->x3C, *x40_ptr, sp->x44, *x50_ptr);
                        }
                    }
                    cur_x += 11;
                    col++;
                }
                row++;
            }
            *x50_ptr = saved_color;
        }
    }
}
#pragma pop

// @TODO: Register swap in second loop (r29/r30)
void hsd_80394950(OSContext* ctx)
{
    OSContext tmp;
    OSContext* saved;
    BOOL irq;
    s32 i;
    u8* p;

    if (!(ctx->state & OS_CONTEXT_STATE_FPSAVED)) {
        return;
    }

    irq = OSDisableInterrupts();
    saved = OSGetCurrentContext();
    OSClearContext(&tmp);
    OSSetCurrentContext(&tmp);

    OSReport("- FPR -----------------------------------------------\n");

    i = 0;
    p = (u8*) ctx;
    do {
        f64 fval = *(f64*) (p + 0x90);
        OSReport("R%02d=%08X:%08X (%e)\n", i, *(u32*) (p + 0x90),
                 *(u32*) (p + 0x94), fval);
        i++;
        p += 8;
    } while (i < 32);

    OSReport("- PSF -----------------------------------------------\n");

    i = 0;
    p = (u8*) ctx;
    do {
        u32 val0 = ((u32*) p)[0x24];
        u32 val1 = ((u32*) p)[0x25];
        OSReport("R%02d=%08X:%08X (%e, %e)\n", i, val0, val1, ((f32*) p)[0x24],
                 ((f32*) p)[0x25]);
        i++;
        p += 8;
    } while (i < 32);

    OSClearContext(&tmp);
    OSSetCurrentContext(saved);
    OSRestoreInterrupts(irq);
}

/// unused function to force data ordering for these report strings
static void unused(OSContext* ctx)
{
    OSReport("- MISC ----------------------------------------------\n");
    OSReport("SRR0=%08X SRR1=%08X\n", ctx->srr0, ctx->srr1);
    OSReport("CR  =%08X LR  =%08X\n", ctx->cr, ctx->lr);
    OSReport("CTR =%08X XER =%08X\n", ctx->ctr, ctx->xer);
    OSReport("FPSCR=%08X\n", ctx->fpscr);
    OSReport("GQR%d=%08X GQR%d=%08X\n", 0, ctx->gqr[0], 1, ctx->gqr[1]);
}

// @TODO: Currently 99.94% match - minor relocation difference
void Exception_ReportStackTrace(OSContext* ctx, int max_depth)
{
    u32 i;
    u32* sp;

    OSReport("- STACK ---------------------------------------------\n");
    OSReport(" Address:  Back Chain  LR Save\n");

    sp = (u32*) ctx->gpr[1];
    i = 0;

    while (sp != NULL && (u32) (sp + 0x4000) != 0xFFFF && i < (u32) max_depth)
    {
        if ((u32) sp < 0x80000000u) {
            break;
        }
        if ((s64) (u32) sp >= (s64) OSGetPhysicalMemSize() + 0x800000000) {
            break;
        }
        OSReport("%08X:   %08X   %08X\n", sp, sp[0], sp[1]);
        sp = (u32*) sp[0];
        i++;
    }
}

// @TODO: Currently 99.81% match - instructions match, string relocations
// differ
void Exception_ReportCodeline(u16 error, int dsisr, int dar, OSContext* ctx)
{
    char* exception_type;
    char* around_or_at;
    int srr1;

    OSReport("- UNHANDLED EXCEPTION -------------------------------\n");
    OSReport("DSISR=%08X DAR=%08X\n", dsisr, dar);
    error = (u16) error;
    OSReport("ERROR %d: ", error);

    switch (error) {
    case 0:
        OSReport("(SYSTEM RESET)\n");
        return;
    case 1:
        OSReport("(MACHINE CHECK)\n");
        return;
    case 2:
        OSReport("(DSI)\n");
        OSReport("Instruction at %08X (read from SRR0) attempted\n"
                 "to access invalid address %08X (read from DAR)\n",
                 ctx->srr0, dar);
        if (dsisr & 0x02000000) {
            OSReport("Store operation.\n");
        } else {
            OSReport("Load operation.\n");
        }
        if (dsisr & 0x40000000) {
            OSReport("No appropriate page entry or DBAT exist.\n");
        }
        if (dsisr & 0x08000000) {
            OSReport("Memory access is not permitted by the page or DBAT.\n");
        }
        if (dsisr & 0x400000) {
            OSReport("DABR match occurs.\n");
        }
        return;
    case 3:
        OSReport("(ISI)\n");
        OSReport("Attempted to fetch instruction from invalid address\n"
                 "%08X (read from SRR0)\n",
                 ctx->srr0);
        if (ctx->srr1 & 0x40000000) {
            OSReport("No appropriate page entry or IBAT exist.\n");
        }
        if (ctx->srr1 & 0x10000000) {
            OSReport("Illegal address.\n");
        }
        if (ctx->srr1 & 0x08000000) {
            OSReport("Memory access is not permitted by the page or IBAT.\n");
        }
        break;
    case 4:
        OSReport("(EXTERNAL INTERRUPT)\n");
        return;
    case 5:
        OSReport("(ALIGNMNET)\n");
        OSReport("Instruction at %08X (read from SRR0) attempted\n"
                 "to access unaligned address %08X (read from DAR)\n",
                 ctx->srr0, dar);
        return;
    case 6:
        OSReport("(PROGRAM)\n");
        srr1 = ctx->srr1;
        around_or_at = (srr1 & 0x10000) ? "around" : "at";
        if (srr1 & 0x100000) {
            exception_type = "IEEE floating point enabled program exception";
        } else if (srr1 & 0x80000) {
            exception_type = "Illegal instruction";
        } else if (srr1 & 0x40000) {
            exception_type = "Privileged instruction";
        } else if (srr1 & 0x20000) {
            exception_type = "Trap program exception";
        } else {
            exception_type = "Unknown type of program exception";
        }
        OSReport("%s %s %08X (read from SRR0)\n", exception_type, around_or_at,
                 ctx->srr0);
        return;
    case 7:
        OSReport("(FLOATING POINT)\n");
        return;
    case 8:
        OSReport("(DECREMENTER)\n");
        return;
    case 9:
        OSReport("(SYSTEM CALL)\n");
        return;
    case 10:
        OSReport("(TRACE)\n");
        return;
    case 11:
        OSReport("(PERFORMANCE MONITOR)\n");
        return;
    case 12:
        OSReport("(BREAKPOINT)\n");
        return;
    case 13:
        OSReport("(SYSTEM INTERRPUT)\n");
        return;
    case 14:
        OSReport("(THERMAL INTERRPUT)\n");
        return;
    default:
        OSReport("(UNKNOWN)\n");
        break;
    }
}

void fn_80394DF4(void* node_ptr)
{
    struct ParticleScreenState* sp = &hsd_804CF810;
    ExcptNode* node = node_ptr;
    ExcptNode* prev;
    ExcptNode* head;
    ExcptNode** head_ptr;

    if (node == NULL || (head = *(head_ptr = (ExcptNode**) &sp->xD0)) == NULL)
    {
        return;
    }
    if (head == node) {
        *head_ptr = head->next;
        node->next = NULL;
        sp->x0_b5 = 1;
        return;
    }
    prev = head;
    while (prev != NULL) {
        if (prev->next == node) {
            prev->next = node->next;
            node->next = NULL;
            sp->x0_b5 = 1;
            return;
        }
        prev = prev->next;
    }
}

void hsd_80394E8C(void* node_ptr)
{
    void** head;
    ExcptNode* node = node_ptr;

    if (hsd_804D78C8 < 1) {
        return;
    }
    head = (void**) &hsd_804CF810.xD0;
    if (*head == node_ptr) {
        return;
    }
    if (*head == NULL) {
        *head = node_ptr;
        node->next = NULL;
    } else {
        fn_80394DF4(node_ptr);
        node->next = ((ExcptNode*) *head)->next;
        ((ExcptNode*) *head)->next = NULL;
        *head = node_ptr;
    }
    if (node->callback != NULL) {
        node->callback(node);
    }
    hsd_804CF810.x0_b5 = 1;
}

extern u8 lbl_8040AB20[];

// @TODO: Currently 94.46% match - BSS relocation and register allocation
// differences remain
void hsd_80394F48(void* data)
{
    u8* base_color = lbl_8040AB00;
    struct ParticleScreenState* sp = &hsd_804CF810;
    EventData* dp = data;
    s32 num_entries;
    void** px50;
    s32* pxC8;
    s32* pxCC;
    s32* px4;
    s32* px40;
    s32* px8;
    s32 col_start;
    s32 row_start;
    void* hi_color;
    s32 x_base;
    s32 cur_row;
    s32 i;
    s32 b6;

    PAD_STACK(64);

    num_entries = strlen(dp->entries[0]);
    px50 = &sp->x50;
    pxC8 = &sp->xC8;
    pxCC = &sp->xCC;
    px4 = &sp->x4;
    px40 = &sp->x40;
    px8 = &sp->x8;
    *px50 = base_color;
    col_start = *pxC8;
    row_start = *pxCC;

    *px4 = col_start * 11 + 0x14;
    *px8 = (*px40 - 0x28) - (row_start + 1) * 14;

    b6 = sp->x0_b6;
    if (sp->x0_b7 != 0) {
        hsd_803922FC(((ParticleFontData*) sp->x4C)->x968, *px4, *px8, b6,
                     (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
    } else {
        hsd_803921B8(((ParticleFontData*) sp->x4C)->x968, *px4, *px8,
                     (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
    }

    i = 0;
    *px4 += 11;
    while (i < num_entries) {
        b6 = sp->x0_b6;
        if (sp->x0_b7 != 0) {
            hsd_803922FC(((ParticleFontData*) sp->x4C)->x9D8, *px4, *px8, b6,
                         (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
        } else {
            hsd_803921B8(((ParticleFontData*) sp->x4C)->x9D8, *px4, *px8,
                         (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
        }
        i++;
        *px4 += 11;
    }

    b6 = sp->x0_b6;
    if (sp->x0_b7 != 0) {
        hsd_803922FC(((ParticleFontData*) sp->x4C)->x968, *px4, *px8, b6,
                     (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
    } else {
        hsd_803921B8(((ParticleFontData*) sp->x4C)->x968, *px4, *px8,
                     (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
    }

    *px4 += 11;
    x_base = col_start * 11 + 0x14;
    hi_color = base_color + 0x20;
    cur_row = row_start - 1;

    for (i = 0; dp->entries[i] != 0; i++) {
        *px4 = x_base;
        *px8 = (*px40 - 0x28) - (cur_row-- + 1) * 14;

        b6 = sp->x0_b6;
        if (sp->x0_b7 != 0) {
            hsd_803922FC(((ParticleFontData*) sp->x4C)->x1B20, *px4, *px8, b6,
                         (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
        } else {
            hsd_803921B8(((ParticleFontData*) sp->x4C)->x1B20, *px4, *px8,
                         (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
        }

        if (i == dp->index) {
            *px50 = hi_color;
        } else {
            *px50 = base_color;
        }

        *px4 += 11;
        hsd_80394434(dp->entries[i]);

        *px4 += strlen(dp->entries[i]) * 11;
        *px50 = base_color;

        b6 = sp->x0_b6;
        if (sp->x0_b7 != 0) {
            hsd_803922FC(((ParticleFontData*) sp->x4C)->x1B20, *px4, *px8, b6,
                         (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
        } else {
            hsd_803921B8(((ParticleFontData*) sp->x4C)->x1B20, *px4, *px8,
                         (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
        }
    }

    *px50 = base_color;
    *px4 = x_base;
    *px8 = (*px40 - 0x28) - (cur_row + 1) * 14;

    b6 = sp->x0_b6;
    if (sp->x0_b7 != 0) {
        hsd_803922FC(((ParticleFontData*) sp->x4C)->x968, *px4, *px8, b6,
                     (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
    } else {
        hsd_803921B8(((ParticleFontData*) sp->x4C)->x968, *px4, *px8,
                     (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
    }

    {
        s32 j = 0;
        *px4 += 11;
        while (j < num_entries) {
            b6 = sp->x0_b6;
            if (sp->x0_b7 != 0) {
                hsd_803922FC(((ParticleFontData*) sp->x4C)->x9D8, *px4, *px8,
                             b6, (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44,
                             *px50);
            } else {
                hsd_803921B8(((ParticleFontData*) sp->x4C)->x9D8, *px4, *px8,
                             (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44,
                             *px50);
            }
            j++;
            *px4 += 11;
        }
    }

    b6 = hsd_804CF810.x0_b6;
    if (sp->x0_b7 != 0) {
        hsd_803922FC(((ParticleFontData*) sp->x4C)->x968, *px4, *px8, b6,
                     (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
    } else {
        hsd_803921B8(((ParticleFontData*) sp->x4C)->x968, *px4, *px8,
                     (&sp->x24)[sp->x34], sp->x3C, *px40, sp->x44, *px50);
    }

    *px4 += 11;
    *pxC8 += 4;
    *pxCC -= dp->index + 1;
}

s32 hsd_80395550(void* event_ptr)
{
    EventData* data = event_ptr;
    u32 flags = hsd_804CF810.xBC;
    u32 bit = 1;

    while (bit <= flags) {
        switch (flags & bit) {
        case 0x8: {
            s32 counter = data->index;
            if (counter > 0) {
                data->index = counter - 1;
            } else {
                char** base = data->entries;
                s32 count = 0;
                while (base[count + 1] != 0) {
                    count++;
                }
                data->index = count;
            }
            return 1;
        }
        case 0x4: {
            s32 idx = data->index;
            char** base = data->entries;
            if (base[idx + 1] != 0) {
                data->index = idx + 1;
            } else {
                data->index = 0;
            }
            return 1;
        }
        case 0x100:
            return 2;
        case 0x200:
        case 0x1000:
            return -1;
        default:
            bit <<= 1;
            break;
        }
    }
    return 0;
}

extern u8 lbl_8040AB20[];
extern u8 lbl_8040B8AC[];
extern u8 lbl_8040B904[];

void hsd_80395644(void)
{
    struct ParticleScreenState* sp =
        (struct ParticleScreenState*) &hsd_804CF810;
    void* saved;
    void** p = &sp->x50;
    s32 val_x20;
    s32 val_x1C;

    PAD_STACK(16);
    saved = *p;
    *p = lbl_8040AB20;
    val_x20 = sp->x20;
    val_x1C = sp->x1C;
    sp->x4 = (val_x20 - 21) * 11 + 20;
    sp->x8 = (sp->x40 - 40) - (val_x1C + 1) * 14;
    if (hsd_804D78C8 >= 1) {
        hsd_80394434(lbl_8040B8AC);
    }
    *p = saved;
}

s32 hsd_803956D8(void* disp_ptr)
{
    struct ParticleScreenState* sp = &hsd_804CF810;
    DispData* data = disp_ptr;
    s32 val;

    if (sp->xBC & 0x1000) {
        hsd_80394E8C(lbl_8040B904);
        sp->x14 = 0;
        data->x10 = 0;
        return 1;
    }

    val = data->x10;
    if (val < 120) {
        data->x10 = val + 1;
    } else {
        data->x10 = 0;
        {
            s32* pp = &sp->x14;
            *pp += sp->x1C;
            if (!(u8) hsd_80394128(0, *pp)) {
                if (!(u8) hsd_80394128(0, *pp + 1)) {
                    *pp = 0;
                    hsd_80394E8C(lbl_8040B904);
                }
            }
        }
        return 1;
    }
    return 0;
}

static inline void get_screen_data(void** data)
{
    *data = hsd_804CF810.x50;
}

static inline void set_default_screen_data(void)
{
    hsd_804CF810.x50 = lbl_8040AB20;
}

// @TODO: BSS relocation and register allocation differences remain
void hsd_803957C0(u8 input)
{
    struct ParticleScreenState* sp = &hsd_804CF810;
    s32* x10_ptr = &sp->x10;
    void** x50_ptr;
    s32* x8_ptr;
    s32* x40_ptr;
    s32* x4_ptr;
    s32 col;
    s32 row;
    s32 b6;
    u8 ch;
    void* saved;
    PAD_STACK(24);

    col = sp->x0C + sp->x18;
    row = *x10_ptr + sp->x14;

    while (col >= 0) {
        ch = (u8) hsd_80394128(col, row);
        if (ch != 0) {
            break;
        }
        col--;
    }

    if (ch == 0) {
        if (col < 0) {
            col = 0;
        }
        ch = ' ';
    }

    get_screen_data(&saved);
    set_default_screen_data();
    sp->x8 = (sp->x40 - 40) - (*x10_ptr + 1) * 14;
    sp->x4 = col * 11 + 20;

    x50_ptr = &sp->x50;
    {
        struct ParticleScreenState* draw_sp = &hsd_804CF810;
        x4_ptr = &draw_sp->x4;
        x40_ptr = &draw_sp->x40;
        (void) x40_ptr;
        x8_ptr = &draw_sp->x8;
        b6 = draw_sp->x0_b6;

        if (draw_sp->x0_b7) {
            hsd_803922FC((void*) ((u8*) draw_sp->x4C + (ch & 0x7F) * 0x38),
                         *x4_ptr, *x8_ptr, b6, (&draw_sp->x24)[draw_sp->x34],
                         draw_sp->x3C, *x40_ptr, draw_sp->x44, *x50_ptr);
        } else {
            hsd_803921B8((void*) ((u8*) draw_sp->x4C + (ch & 0x7F) * 0x38),
                         *x4_ptr, *x8_ptr, (&draw_sp->x24)[draw_sp->x34],
                         draw_sp->x3C, *x40_ptr, draw_sp->x44, *x50_ptr);
        }
    }

    if (input == (u32) sp->xD0) {
        struct ParticleScreenState* final_sp = &hsd_804CF810;
        *x4_ptr = (final_sp->x20 - 0x27) * 11 + 20;
        *x8_ptr = (*x40_ptr - 40) - (final_sp->x1C + 1) * 14;
        hsd_80394434("<<PUSH START BUTTON TO SEE INSTRUCTION>>");
    }

    *x50_ptr = saved;
}

#pragma push
#pragma dont_inline on
s32 hsd_80395970(void)
{
    struct ParticleScreenState* sp = &hsd_804CF810;
    s32 saved_x;
    s32 saved_y;
    s32 result;
    s32 i;
    u8 ch;

    result = 0;
    hsd_80393E34(&saved_x, &saved_y);
    hsd_80393E68(sp->x0C + sp->x18, sp->x10 + sp->x14);

    for (i = 0; i < 8; i++) {
        ch = hsd_80394068();
        if (ch == 0) {
            ch = hsd_80394068();
            if (ch == 0) {
                break;
            }
        }
        if (ch >= '0' && ch <= '9') {
            result = (result << 4) + ch - '0';
        } else if (ch >= 'A' && ch <= 'F') {
            result = (result << 4) + ch - 'A' + 10;
        } else if (ch >= 'a' && ch <= 'f') {
            result = (result << 4) + ch - 'a' + 10;
        } else {
            break;
        }
    }

    result = (result & 0x0FFFFFF0) | (s32) 0x80000000;
    hsd_80393E68(saved_x, saved_y);
    return result;
}

#pragma pop

extern u8 lbl_8040BA5C[];

extern struct {
    /* 0x00 */ u8 _pad[0x10];
    /* 0x10 */ u32 x10;
} lbl_8040BAF0;

extern struct {
    /* 0x00 */ u8 _pad[0x10];
    /* 0x10 */ u32 x10;
    /* 0x14 */ s32 x14;
    /* 0x18 */ void* x18;
} lbl_8040BC3C;

s32 hsd_80395A78(void)
{
    u32 bit;
    s32 new_col;
    s32 new_scroll;
    s32 sum;
    void* sp = &hsd_804CF810;
    PAD_STACK(8);

    bit = 1;
    while (bit <= ((struct ParticleScreenState*) sp)->xBC) {
        switch (((struct ParticleScreenState*) sp)->xBC & bit) {
        case 0x8:
            if (((struct ParticleScreenState*) sp)->x10 <
                ((struct ParticleScreenState*) sp)->x1C - 1)
            {
                ((struct ParticleScreenState*) sp)->x10 =
                    ((struct ParticleScreenState*) sp)->x10 + 1;
            } else {
                ((struct ParticleScreenState*) sp)->x14 += 1;
            }
            return 1;
        case 0x4:
            if (((struct ParticleScreenState*) sp)->x10 > 0) {
                ((struct ParticleScreenState*) sp)->x10 -= 1;
            } else if (((struct ParticleScreenState*) sp)->x14 > 0) {
                ((struct ParticleScreenState*) sp)->x14 -= 1;
