#ifndef GALE01_3A949C
#define GALE01_3A949C

#include <placeholder.h>

#include <Gecko_setjmp.h>

typedef struct {
    u8 x0[0x80 * 0x24];
} __baselib_UnkType002;

typedef struct {
    u8 x0[0x300];
} __baselib_UnkType003;

/* 4D1138 */ extern u8 hsd_804D1138[0x10];
/* 4D1148 */ extern u32 hsd_804D1148[0x80][0x9];
/* 4D2348 */ extern __baselib_UnkType003 hsd_804D2348;
/* 4D2648 */ extern __jmp_buf hsd_804D2648;
/* 4D2E70 */ extern u8 hsd_804D2E70[2084];
/* 4D79A0 */ extern UNK_T hsd_804D79A0;
/* 4D79A4 */ extern UNK_T hsd_804D79A4;
/* 4D7990 */ extern s32 hsd_804D7990;
/* 4D7994 */ extern s32 hsd_804D7994;
/* 4D79A8 */ extern UNK_T hsd_804D79A8;

#endif
