#include "psdisp.h"

#include "baselib/forward.h"

#include "baselib/cobj.h"
#include "baselib/fog.h"
#include "baselib/lobj.h"
#include "baselib/mtx.h"
#include "baselib/psdisptev.h"
#include "baselib/psstructs.h"
#include "baselib/state.h"
#include "baselib/util.h"

#include <libc/math.h>
#include <math.h>
#include <string.h>
#include <dolphin/gx.h>

typedef struct {
    u8 filename[9];
    u8 message[39];
    UNK_T pointers[3];
    u32 bitfields[8];
} psdisp_UnknownType001;

typedef struct {
    UNK_T pointers[4];
    u8 message[36];
    u8 filename[9];
} psdisp_UnknownType002;

typedef struct {
    HSD_Particle* head;
    HSD_Particle* tail;
} psdisp_ParticleSortBucket;

typedef Vec3 Point3d;

typedef struct {
    u8 x0_pad[0xAC];
    HSD_Particle* xAC[17];
} psdisp_ParticleSortCache;

STATIC_ASSERT(sizeof(psdisp_ParticleSortBucket) == 8);
STATIC_ASSERT(sizeof(psdisp_ParticleSortCache) == 0xF0);

/* 39F89C */ static void calcTornadoLastPos(HSD_Particle*, f32*, f32*, f32*);
/* 39FA28 */ static void getColorPrimEnv(HSD_Particle*, GXColor*, GXColor*);
/* 39FB74 */ static void getColorMatAmb(HSD_Particle*, GXColor*, GXColor*);
/* 3B9628 */ extern f32 HSD_PSDisp_803B9628[12];
/* 40C300 */ extern psdisp_UnknownType001 HSD_PSDisp_8040C300;
/* 40C360 */ extern psdisp_UnknownType002 HSD_PSDisp_8040C360;
/* 4D6380 */ extern u8 HSD_PSDisp_804D6380[2];
/* 4D6384 */ extern u8 HSD_PSDisp_804D6384[2];
/* 4D0908 */ extern HSD_Particle* hsd_804D0908[146];
/* 4D0B50 */ extern void* psTexGroupArray_804D0B50;
/* 4D0C54 */ extern void* psNumCmdList_804D0C54;
/* 4D0FC0 */ extern psdisp_ParticleSortCache HSD_PSDisp_804D0FC0;
/* 4D7908 */ extern HSD_Fog* HSD_PSDisp_804D7908;
/* 4D790C */ extern s32 HSD_PSDisp_804D790C;
/* 4D7910 */ extern s32 HSD_PSDisp_804D7910;
/* 4D7914 */ extern f32 HSD_PSDisp_804D7914;
/* 4D7918 */ extern f32 HSD_PSDisp_804D7918;
/* 4D791C */ extern f32 HSD_PSDisp_804D791C;
/* 4D7920 */ extern f32 HSD_PSDisp_804D7920;
/* 4D7924 */ extern f32 HSD_PSDisp_804D7924;
/* 4D7928 */ extern f32 HSD_PSDisp_804D7928;
/* 4D792C */ extern s32 HSD_PSDisp_804D792C;
/* 4D7930 */ extern s32 HSD_PSDisp_804D7930;
/* 4D7934 */ extern GXColor HSD_PSDisp_804D7934;
/* 4D7938 */ extern GXColor HSD_PSDisp_804D7938;
/* 4D793C */ extern GXColor HSD_PSDisp_804D793C;
/* 4D7940 */ extern GXColor HSD_PSDisp_804D7940;
/* 4D7944 */ extern GXColor HSD_PSDisp_804D7944;
/* 4D7948 */ extern s32 HSD_PSDisp_804D7948;

void setVtxDesc(s32 fmt)
{
    GXClearVtxDesc();
    switch (fmt) {
    case 0:
        GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
        GXSetVtxDesc(GX_VA_TEX0, GX_INDEX8);
        return;
    case 1:
        GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
        return;
    case 2:
        GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
        GXSetVtxDesc(GX_VA_CLR0, GX_DIRECT);
        GXSetVtxDesc(GX_VA_TEX0, GX_INDEX8);
        return;
    case 3:
        GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
        GXSetVtxDesc(GX_VA_CLR0, GX_DIRECT);
        return;
    case 4:
        GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
        GXSetVtxDesc(GX_VA_TEX0, GX_DIRECT);
        return;
    case 5:
        GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
        GXSetVtxDesc(GX_VA_CLR0, GX_DIRECT);
        GXSetVtxDesc(GX_VA_TEX0, GX_DIRECT);
        return;
    }
}

static void calcTornadoLastPos(HSD_Particle* pp, f32* x, f32* y, f32* z)
{
    f32 radius;
    f32 px, py, pz;
