#ifndef __GALE01_01E8F8
#define __GALE01_01E8F8

#include "lbmthp.h" // IWYU pragma: export

#include <dolphin/os/OSAlarm.h>

/* 4333E0 */ static struct lbl_804333E0_t Movieplayer;
/* 4D7CC0 */ static float lb_804D7CC0;

/* 4D7CE0 */ static float lbl_804D7CE0;

struct lbl_803BAFE8_t {
    /* 0x00 */ s32 x0;
    /* 0x04 */ u16 x4;
    /* 0x06 */ u16 x6;
    /* 0x08 */ s32 x8;
    /* 0x0C */ s32 xC;
    /* 0x10 */ s32 x10;
    /* 0x14 */ s32 x14;
}; /* size = 0x18 */

/* 3BAFE8 */ extern struct lbl_803BAFE8_t lbl_803BAFE8;
/* 4D3834 */ extern s32 lbl_804D3834;

#endif
