#include "mncharsel.h"

#include "mncharsel.static.h"

#include "types.h"

#include <MSL/trigf.h>
#include <sysdolphin/baselib/aobj.h>
#include <sysdolphin/baselib/controller.h>
#include <sysdolphin/baselib/dobj.h>
#include <sysdolphin/baselib/fog.h>
#include <sysdolphin/baselib/mobj.h>
#include <sysdolphin/baselib/gobjgxlink.h>
#include <sysdolphin/baselib/jobj.h>
#include <sysdolphin/baselib/random.h>
#include <sysdolphin/baselib/sislib.h>
#include <melee/gm/gm_unsplit.h>
#include <melee/gm/gm_1601.h>
#include <melee/gm/gmmain_lib.h>
#include <melee/gm/types.h>
#include <melee/lb/lb_00F9.h>
#include <melee/lb/lbarchive.h>
#include <melee/lb/lbaudio_ax.h>
#include <melee/lb/lbcardgame.h>
#include <melee/lb/lbcardnew.h>
#include <melee/lb/lbdvd.h>
#include <melee/lb/lblanguage.h>
#include <melee/lb/types.h>
#include <melee/mn/mncharsel.h>
#include <melee/mn/mnmain.h>
#include <melee/mn/mnmainrule.h>
#include <melee/mn/mnname.h>
#include <melee/mn/mnnamenew.h>

TextKerning* mnCharSel_8025BC20(TextKerning* arg0, u32 arg1)
{
    TextKerning* kerning;
    u32 render_zeroes;
    render_zeroes = 0;
    kerning = HSD_SisLib_804D1124[0][41].kerning;
    if (arg1 >= 10000) {
        arg1 = 9999;
    }
    if (arg1 >= 1000) {
        arg0->left = kerning[arg1 / 1000].left;
        arg0->right = kerning[arg1 / 1000].right;
        arg0 += 1;
        arg1 = arg1 % 1000;
        render_zeroes = 1;
    }
    if ((arg1 >= 100) || render_zeroes) {

    if (mnCharSel_804D6CB0->match_type == TRAINING_MODE) {
        num_doors = 2;
    } else {
        num_doors = mnCharSel_804D6CF5;
    }

    for (j = 0; j < num_doors; j++) {
        if (door != j && mnCharSel_803F0DFC.doors[j].p_kind != 3 &&
            mnCharSel_803F0DFC.doors[j].sel_icon < 0x19 &&
            mnCharSel_803F0DFC.doors[j].sel_icon ==
                mnCharSel_803F0DFC.doors[door].sel_icon &&
            mnCharSel_803F0DFC.doors[door].costume ==
                mnCharSel_803F0DFC.doors[j].costume)
        {
            return true;
        }
    }
    return false;
}
#pragma dont_inline off

/// #mnCharSel_8025DB34

inline HSD_JObj* lb_80011E24_inline(int i)
{
    HSD_JObj* jobj;
    lb_80011E24(mnCharSel_804D6CC0, &jobj, i, -1);
    return jobj;
}

inline void anim_inline(int i, float f)
{
    HSD_JObj* jobj;
    lb_80011E24(mnCharSel_804D6CC0, &jobj, i, -1);
    HSD_ForeachAnim(jobj, JOBJ_TYPE, TOBJ_MASK, HSD_AObjReqAnim, AOBJ_ARG_AF,
                    f);
    HSD_JObjAnimAll(jobj);
    HSD_ForeachAnim(jobj, JOBJ_TYPE, TOBJ_MASK, HSD_AObjStopAnim, AOBJ_ARG_AOV,
                    0, 0);
}

void mnCharSel_8025EE8C(u8 idx)
{
    float temp_f31;
    int i;
    HSD_JObj* cc0;

    u8 _[8];

    HSD_JObj* sp14;
    HSD_JObj* sp10;
    HSD_JObj* spC;

    if (mnCharSel_804D6CF5 == 1) {
        temp_f31 = mnCharSel_803F0A48.mode_info[idx].mode_ffa_frame;
        cc0 = mnCharSel_804D6CC0;
        lb_80011E24(cc0, &sp14, 0x24, -1);
        HSD_ForeachAnim(sp14, JOBJ_TYPE, TOBJ_MASK, HSD_AObjReqAnim,
                        AOBJ_ARG_AF, temp_f31);
        HSD_JObjAnimAll(sp14);
        HSD_ForeachAnim(sp14, JOBJ_TYPE, TOBJ_MASK, HSD_AObjStopAnim,
                        AOBJ_ARG_AOV, 0, 0);
        mnCharSel_8025DB34(0);
        if (mnCharSel_804D6CB0->match_type == TRAINING_MODE) {
            mnCharSel_8025DB34(1);
        }
    } else {
        if (mnCharSel_804D6CB0->data.data.rules.is_teams) {
            temp_f31 = mnCharSel_803F0A48.mode_info[idx].mode_teams_frame;
            cc0 = mnCharSel_804D6CC0;
            lb_80011E24(cc0, &sp10, 0x24, -1);
            HSD_ForeachAnim(sp10, JOBJ_TYPE, TOBJ_MASK, HSD_AObjReqAnim,
                            AOBJ_ARG_AF, temp_f31);
            HSD_JObjAnimAll(sp10);
            HSD_ForeachAnim(sp10, JOBJ_TYPE, TOBJ_MASK, HSD_AObjStopAnim,
                            AOBJ_ARG_AOV, 0, 0);
        } else {
            temp_f31 = mnCharSel_803F0A48.mode_info[idx].mode_ffa_frame;
            cc0 = mnCharSel_804D6CC0;
            lb_80011E24(cc0, &spC, 0x24, -1);
            HSD_ForeachAnim(spC, JOBJ_TYPE, TOBJ_MASK, HSD_AObjReqAnim,
                            AOBJ_ARG_AF, temp_f31);
            HSD_JObjAnimAll(spC);
            HSD_ForeachAnim(spC, JOBJ_TYPE, TOBJ_MASK, HSD_AObjStopAnim,
                            AOBJ_ARG_AOV, 0, 0);
        }
        for (i = 0; i < mnCharSel_804D6CF5; i++) {
            mnCharSel_8025DB34(i);
        }
    }
}

static HSD_GObj** mnCharSel_804A0BC0[4];
static struct CSSCharModel {
    /* 0x00 */ HSD_GObj* gobj;
    /* 0x04 */ u8 x4;
    /* 0x05 */ u8 x5;
    /* 0x06 */ u8 x6;
    /* 0x07 */ u8 x7;
    /* 0x08 */ float x8;
    /* 0x0C */ float xC;
    /* 0x10 */ float x10;
    /* 0x14 */ float x14;
}* mnCharSel_804A0BD0[4];

/// #fn_8025F0E0
void fn_8025F0E0(HSD_GObj* gobj)
{
    HSD_JObj* jobj = GET_JOBJ(gobj);
    void (*sp5C)(HSD_AObj*, f32);
    void (*sp60)(HSD_AObj*, void*, HSD_ObjUpdateFunc);
    HSD_JObj* sp54;
    HSD_JObj* sp4C;
    HSD_JObj* sp48;
    HSD_JObj* sp44;
    HSD_JObj* sp40;
    HSD_JObj* sp3C;
    HSD_JObj* sp38;
    HSD_JObj* sp34;
    HSD_JObj* sp30;
    HSD_JObj* sp2C;
    CSSIcon* icons;
    CSSDoor* doors;
    GameRules* rules;
    HSD_DObj* dobj;
    HSD_MObj* mobj;
    void* sp58;
    int i;
    int door_offset;
    u8 timer;
    u8 val;
    int anim;
    float fval;

    sp58 = &mnCharSel_804A0BC0;

    if ((mnCharSel_804D6CEC % 10) != 0) {
        if ((u8) mnCharSel_804D6CF5 == 1) {
            lb_80011E24(jobj, &sp54, 0x27, -1);
        } else {
            lb_80011E24(jobj, &sp54, 0x27, -1);
        }
        HSD_ForeachAnim(sp54, JOBJ_TYPE, ALL_TYPE_MASK, HSD_AObjReqAnim,
                         AOBJ_ARG_AF, 0.0f);
