#ifndef __GALE01_243A3C
#define __GALE01_243A3C

#include "mndiagram2.h" // IWYU pragma: export

#include <placeholder.h>

#include <melee/mn/types.h>

/* Struct for archive data at mnDiagram_804A0834 */
typedef struct {
    /* 0x00 */ HSD_Joint* x0;
    /* 0x04 */ HSD_AnimJoint* x4;
    /* 0x08 */ HSD_MatAnimJoint* x8;
    /* 0x0C */ HSD_ShapeAnimJoint* xC;
} mnDiagram_ArchiveData;

/* 3EEAD0 */ extern u8 mnDiagram2_803EEAD0[0x90];
/* 3EEB60 */ extern struct AnimLoopSettings mnDiagram2_803EEB60;
/* 4A0834 */ extern mnDiagram_ArchiveData mnDiagram_804A0834;
/* 4D4FB8 */ extern GXColor mnDiagram2_804D4FB8;
/* 4D4FBC */ extern GXColor mnDiagram2_804D4FBC;
/* 4D4FC0 */ extern char mnDiagram2_804D4FC0[7];
/* 4D4FC8 */ extern char mnDiagram2_804D4FC8[5];
/* 4D4FD0 */ extern u8 mnDiagram2_804D4FD0[3];
/* 4D6C18 */ extern HSD_GObj* mnDiagram2_804D6C18;
/* 4DBFC8 */ extern f32 mnDiagram2_804DBFC8;
/* 4DBFCC */ extern f32 mnDiagram2_804DBFCC;
/* 4DBFD0 */ extern f32 mnDiagram2_804DBFD0;
/* 4DBFD4 */ extern f32 mnDiagram2_804DBFD4;
/* 4DBFD8 */ extern f32 mnDiagram2_804DBFD8;
/* 4DBFDC */ extern f32 mnDiagram2_804DBFDC;
/* 4DBFE0 */ extern f32 mnDiagram2_804DBFE0;
/* 4DBFE4 */ extern f32 mnDiagram2_804DBFE4;
/* 4DBFE8 */ extern f64 mnDiagram2_804DBFE8;

#endif
