#include "mnnamenew.h"

#include "gm/gm_18A5.h"
#include "gm/gm_1A3F.h"
#include "gm/gmmain_lib.h"
#include "lb/lb_00B0.h"
#include "lb/lb_00F9.h"
#include "lb/lbarchive.h"
#include "lb/lbaudio_ax.h"
#include "lb/lbcardgame.h"
#include "lb/lblanguage.h"
#include "mn/mncharsel.h"
#include "mn/mnmain.h"
#include "mn/mnname.h"
#include "mn/types.h"

#include <dolphin/os.h>
#include "sc/types.h"
#include "sysdolphin/baselib/gobj.h"
#include "sysdolphin/baselib/gobjgxlink.h"
#include "sysdolphin/baselib/gobjobject.h"
#include "sysdolphin/baselib/gobjplink.h"
#include "sysdolphin/baselib/gobjproc.h"
#include "sysdolphin/baselib/gobjuserdata.h"
#include "sysdolphin/baselib/jobj.h"
#include "sysdolphin/baselib/memory.h"
#include "sysdolphin/baselib/random.h"
#include "sysdolphin/baselib/sislib.h"

extern volatile char mnNameNew_NullCharacter;
extern u8 mnNameNew_PortInUse;
extern char mnNameNew_CurrentNameText[0x10];
extern u8** AutoNamesList;
extern char** NotAllowedNamesList;
extern u8 mn_804D6BB4;
extern u8 mn_804D6BB5;
extern u8 mnNameNew_804D4F7C[4];
extern void* mnNameNew_804D6C08;
extern u8 mnNameNew_SpaceCharacter[2];
extern char* mnNameNew_803EDCE4[];
extern void* mnNameNew_804A06F0[];
extern void* mnNameNew_804A0700[];
extern void* mnNameNew_804A0710[];
extern void* mnNameNew_804A0720[];

extern u16 mnNameNew_803EDA7C[];
extern StaticModelDesc MenMainBack_Top;
extern StaticModelDesc MenMainPanel_Top;
extern HSD_CObjDesc* MenMain_cam;
extern UNK_T MenMain_lights;
extern HSD_FogDesc* MenMain_fog;

extern char** mnNameNew_803EDA8C[];
extern char** mnNameNew_803EDB54[];
extern char** mnNameNew_803EDC1C[];
extern Vec3 mnNameNew_803EE324;

/// Row of 4 glyph character pointers for a single key position.
typedef struct GlyphRow {
    char* glyphs[4];
} GlyphRow;

/// Large static data block starting at mnNameNew_803EDA58.
/// Contains animation settings, glyph lookup tables, etc.
typedef struct NameNewData {
    /* 0x000 */ AnimLoopSettings anim[3];
    /* 0x024 */ u16 key_counts[8];
    /* 0x034 */ char* glyph_set_a[50];
    /* 0x0FC */ char* glyph_set_b[50];
    /* 0x1C4 */ char* glyph_single[50];
    /* 0x28C */ GlyphRow glyph_lower[50];
    /* 0x5AC */ GlyphRow glyph_upper[50];
    /* 0x8CC */ Vec3 ref_pos;
} NameNewData;

static AnimLoopSettings mnNameNew_803EDA58[3] = {
    { 0.0f, 19.0f, -0.1f },
    { 20.0f, 39.0f, -0.1f },
    { 0.0f, 10.0f, -0.1f },
};

static Vec3 mnNameNew_803EE330 = { -0.7f, 0.7f, 0.0f };


void mnNameNew_8023B0F8(HSD_GObj* arg0, u8 arg1)
{
    HSD_JObj* jobj;
    NameNewEntry* data;

    PAD_STACK(8);

    data = arg0->user_data;
    jobj = data->jobjs[10];
    if (arg1 == 0x33) {
        HSD_JObjReqAnimAll(jobj, 1.0f);
    } else if (data->mode == 0) {
        HSD_JObjReqAnimAll(jobj, 2.0f);
    } else {
        HSD_JObjReqAnimAll(jobj, 0.0f);
    }
    HSD_JObjAnimAll(jobj);
    jobj = data->jobjs[11];
    if (arg1 == 0x34) {
        HSD_JObjReqAnimAll(jobj, 1.0f);
    } else if (data->mode == 1) {
        HSD_JObjReqAnimAll(jobj, 2.0f);
    } else {
        HSD_JObjReqAnimAll(jobj, 0.0f);
    }
    HSD_JObjAnimAll(jobj);
    jobj = data->jobjs[7];
    if (arg1 == 0x35) {
        HSD_JObjReqAnimAll(jobj, 1.0f);
